#include <ansi.h>

inherit NPC;

mixed ask_here();         //導航系統入口
mixed ask_ok();           //每次完成導師的任務後調用
mixed ask_zhiliao();      //給新手治療
mixed ask_chucun();       //請求出村

void create()
{
        set_name(HIC "老村長" NOR, ({ "lao cunzhang", "lao", "cunzhang" }));
        set("long", @LONG
這是一個瘦小的老者，看起來有一百多歲，他是北戲子北醜和
南賢的師傅，也是這個新手村的村長，如果你有什麼問題不妨
找他幫忙，輸入指令 ask lao about here 可得到幫助信息。
LONG);
        set("nickname", HIY "人見人愛" NOR);
        set("title", HIR "導師" NOR);
        set("gender", "男性" );
        set("age", 110);
        set("attitude", "friendly");
        set("max_jing", 5000000);
        set("max_qi", 5000000);
        set("max_jingli", 5000000);
        set("jingli", 5000000);
        set("max_neili", 5000000);
        set("neili", 5000000);
        set("jiali", 600);
        set("str", 100);
        set("int", 100);
        set("con", 100);
        set("dex", 100);
        set("combat_exp", 100000000);

        set("inquiry", ([
                "here" : (: ask_here :),
                "HERE" : (: ask_here :),
                "ok"   : (: ask_ok :),
                "OK"   : (: ask_ok :),
                "治療" : (: ask_zhiliao :),
                "治病" : (: ask_zhiliao :),
                "醫療" : (: ask_zhiliao :),
                "療傷" : (: ask_zhiliao :),
                "恢復" : (: ask_zhiliao :),
                "解毒" : (: ask_zhiliao :),
                "出村" : (: ask_chucun :),
        ]));

        set_skill("dodge", 800);
        set_skill("unarmed", 800);
        set_skill("force", 800);
        set_skill("parry", 800);
        set_skill("sword", 800);
        set_skill("poison", 800);
        set_skill("medical", 800);
        set_skill("hand", 800);
        set_skill("strike", 800);
        set_skill("staff", 800);
        set_skill("finger", 800);
        set_skill("claw", 800);
        set_skill("blade", 800);
        set_skill("pixie-jian", 800);
        set_skill("literate", 800);
        set_skill("taoism", 800);
        set_skill("buddhism", 800);
        set_skill("jiuyang-shengong", 800);
        set_skill("lingbo-weibu", 800);
        set_skill("qiankun-danuoyi", 800);
        set_skill("xuanming-zhang", 800);
        set_skill("jiuyin-baiguzhao", 800);
        set_skill("lonely-sword", 800);
        set_skill("qianzhu-wandushou", 800);
        set_skill("ranmu-daofa", 800);
        set_skill("dagou-bang", 800);
        set_skill("shaolin-yishu", 800);
        set_skill("wudu-qishu", 800);
        set_skill("throwing", 800);
        set_skill("mantian-xing", 800);
        set_skill("idle-force", 800);
        set_skill("sad-strike", 800);

        map_skill("unarmed", "sad-strike");
        map_skill("force", "jiuyang-shengong");
        map_skill("dodge", "lingbo-weibu");
        map_skill("parry", "qiankun-danuoyi");
        map_skill("hand", "qianzhu-wandushou");
        map_skill("strike", "xuanming-zhang");
        map_skill("claw", "jiuyin-baiguzhao");
        map_skill("sword", "lonely-sword");
        map_skill("blade", "ranmu-daofa");
        map_skill("staff", "dagou-bang");
        map_skill("throwing", "mantian-xing");
        map_skill("poison", "wudu-qishu");
        map_skill("medical", "shaolin-yishu");

        prepare_skill("unarmed", "sad-strike");

        set("chat_chance_combat", 200);
        set("chat_msg_combat", ({
                (: perform_action, "sword.po" :),
                (: perform_action, "blade.zhenyan" :),
                (: perform_action, "blade.huo" :),
                (: perform_action, "staff.wugou" :),
                (: perform_action, "staff.chan" :),
                (: perform_action, "staff.ban" :),
                (: perform_action, "unarmed.xiao" :),
                (: perform_action, "parry.nuoyi" :),
                (: perform_action, "dodge.lingbo" :),
                (: perform_action, "throwing.shan" :),
                (: perform_action, "hand.zhugu" :),
                (: perform_action, "strike.wuji" :),
                (: perform_action, "finger.six" :),
                (: perform_action, "finger.zhongheng" :),
                (: perform_action, "claw.zhua" :),
                (: exert_function, "recover" :),
                (: exert_function, "powerup" :),
                (: exert_function, "shield" :),
                (: exert_function, "heal" :),
                (: exert_function, "dispel" :),
                (: exert_function, "regenerate" :),
        }));

        setup();
        carry_object("d/city/obj/cloth")->wear();
}

mixed ask_zhiliao()
{
        object me;
        string msg;

        me = this_player();

        if( query("combat_exp", me)>200000 )
        {
                return "對不起，你經驗太高了，我恐怕也幫不了你！\n";
        }

        if( time()-query_temp("last_full", me)<30 )
        {
                tell_object(me, HIG "老村長告訴你：你剛治療過，等下再來吧！\n" NOR);
                return 1;
        }
        msg = HIC "老村長看了看你道：好吧！就讓我來給你治療吧！\n" NOR;
        msg+= HIY "老村長默唸口訣，然後用手在你身上一點，頓時一到金光將你籠罩 ……\n" NOR;
        msg+= HIG "你感覺全身舒暢之極！你的狀態恢復滿了！\n\n" NOR;
        
        set("jing",query("max_jing",  me), me);
        set("eff_jing",query("max_jing",  me), me);
        set("jingli",query("max_jingli",  me), me);
        set("eff_jingli",query("max_jingli",  me), me);
        set("neili",query("max_neili",  me), me);
        set("qi",query("max_qi",  me), me);
        set("eff_qi",query("max_qi",  me), me);
        set("food", me->max_food_capacity(), me);
        set("water", me->max_water_capacity(), me);

        me->clear_condition();

        set_temp("last_full", time(), me);

        tell_object(me, msg);

        return 1;
}

// 完成接受的練習
mixed ask_ok()
{
        object me;
        mapping n_quest;

        string msg;
        int exp, qn, score;

        object weapon;

        me = this_player();
        n_quest=query("newbie_quest", me);

        if (! mapp(n_quest))
        {
                tell_object(me, HIG "老村長告訴你：你目前並沒有任何練習任務在身。\n"
                                    "如果有需要請 ask lao about here \n" NOR);
                return 1;
        }

        if (n_quest["leixing"] == "wield")
        {
                weapon=query_temp("weapon", me);

                if (! objectp(weapon))
                {
                        tell_object(me, HIG "老村長告訴你：你並沒有裝備劍啊，如果對使用兵器有疑問你可以輸入\n"
                                            "指令 ask lao about 106\n\n" NOR);
                        return 1;
                }
                if( query("skill_type", weapon) != "sword" )
                {
                        tell_object(me, HIG "老村長告訴你：你並沒有裝備劍。\n\n" NOR);

                        return 1;
                }
                n_quest["completed"] = 1;
        }
        if (n_quest["leixing"] == "jifa")
        {
                if (! me->query_skill("sword", 1) || ! me->query_skill("tianjian", 1))
                {
                        tell_object(me, HIR "老村長對你説道：" + n_quest["msg"] + "\n" NOR);
                        return 1;
                }
                if (me->query_skill_mapped("sword") != "tianjian")
                {
                        tell_object(me, HIR "老村長對你説道：" + n_quest["msg"] + "\n" NOR);
                        return 1;
                }
                n_quest["completed"] = 1;
        }
        if (n_quest["leixing"] == "baishi")
                if( query("family/master_id", me) == "wu bo" )
                        n_quest["completed"] = 1;
        
        if (n_quest["completed"])
        {
                exp=query("newbie_quest/point", me)*5+random(10);
                qn = exp / 2 + random(exp / 2);
                score=query("newbie_quest/point", me);

                msg = HIG "老村長點頭微笑道：不錯！不錯！看來你已經掌握了 " + HIY + 
                          query("newbie_quest/quest_name", me)+HIG"的方法了！\n"NOR;
                msg+= HIC "你完成了老村長交給你的練習任務， 獲得了「" + chinese_number(exp) + 
                      "點實戰經驗和" + chinese_number(qn) + "點潛能以及" + chinese_number(score) + "點"
                      "江湖閲歷」。\n" HIW "能力得到了提升！\n\n" NOR;

                addn("combat_exp", exp, me);
                addn("potential", qn, me);
                addn("score", score, me);

                // 任務記錄
                set("newbie_quest_completed/"+query("newbie_quest/leixing", me), 1, me);

                // 任務完成
                delete("newbie_quest", me);

                me->save();
        }
        else
        {
                tell_object(me, HIR "老村長對你説道：" + n_quest["msg"] + "\n" NOR);
                return 1;
        }

        tell_object(me, msg);

        return 1;
}

int accept_object(object me, object ob)
{
        return 1;
}

// 接受詢問，可回答相關問題，且可分派任務
// me代表this_player()
mixed accept_ask(object me, string topic) 
{
        mixed n_quest;
        string msg;

        n_quest=query("newbie_quest", me);

        // 檢查是否是任務狀態
        if (mapp(n_quest))
        {
                   tell_object(me, HIR "老村長對你説道：" + n_quest["msg"] + "\n如果已經練習請ask lao about ok\n" NOR);
                    return 1;
        }
        
        if (topic == "1") // 什麼是文字MUD遊戲
        {
                 msg = HIW + "\n"
"老村長對你説道：那就讓我來給您介紹一下文字MUD遊戲吧：\n"
"----------------------------------------------------\n" HIY +
"    文字MUD遊戲是懸浮於現實中的一個虛擬世界，" HIM "在這裏你可以扮演一個角色，\n"
"這個角色也許就是你在現實中隱藏於內心深處的真實性格的折射。 你可以控制\n"
"你所扮演的角色在這個虛擬的世界裏生存、成長、尋覓、宣泄 ……，你也將逐\n"
"漸和你所扮演的角色融為一體， 用心去感受這個虛擬世界給你帶來的快樂和難\n"
"忘時光，慢慢地忘卻俗世中的不快與悲愁 ……\n\n" HIY +
"    在文字MUD這個虛擬的世界裏，你幾乎可以做你在現實中可以做的所有事情，\n" HIM +
"聊天、吃飯、喝水、生病/治病，愛情/友情，打架/練功/殺人/救人，探險，尋\n"
"寶，賺錢，買房，結婚，招兵買馬逐鹿中原， 甚至可以成為整個虛擬世界的統\n"
"治者，從此君臨天下 ……\n\n" HIY +
"    與圖形遊戲相比，文字MUD遊戲最大的特色就是給人無限的想象空間，" HIM "圖形\n"
"遊戲是以固定、直觀的圖形描述你所看到的事物，而文字MUD就如你在讀一本精\n"
"彩的小説一樣， 所有小説中地點、人物、事件都是用生動的文字和色彩描述出\n"
"來，這樣一來可以給人以無窮無盡的想象空間，讓人感覺整個世界的多姿多彩。\n\n"
"    在這裏你扮演着一個虛擬的角色，確切地來説你扮演的角色就是你。 和圖\n"
"形遊戲不同的是，你需要輸入各種指令來達到你的目的，看東西可以輸入 look\n"
"指令，吃東西輸入eat指令，切磋武藝用fight指令，走路用go指令， 説話則可\n"
"以用chat、say、tell等指令，一言以蔽之，" HIY "你不再是通過鼠標來操作你的角色，\n"
"而是通過輸入各種指令來控制你所扮演的角色的各種行為，" HIM "指令是文字MUD最常\n"
"用，最高效的操作方式。\n\n" HIY +
"    在這個虛擬世界裏，你沒有任何固定的目標， " HIM "你可以不斷地成長，拜師學\n"
"藝，鑽研至高無尚的武學；你也可以無憂無慮做些買賣， 四處蒐羅一些奇珍異\n"
"寶賣個好價錢，成為一名富甲天下富豪；當然， 你也可以整日摸索諸如機關鑄\n"
"造之術，鍛造出震驚天下的神兵利器，戰衣寶甲； 如果你是懷着一顆救世濟民\n"
"之心，你也可以立志做一名藥師， 將畢生的精力灌注於對醫術、藥理的研究中，\n"
"成為華佗再現、扁鵲重生的一代神醫藥王； 假如你天生不願過多涉足紛亂的江\n"
"湖，喜歡做一個獨來獨往、來去無蹤的人， 你不妨嘗試到扶桑或高麗去做一名\n"
"刺客，從此過着隱姓埋名，浪跡天涯的生活 ……\n\n"
"    這就是文字MUD虛擬世界，趕快將融入到這個世界中來吧，它會帶給你無窮\n"
"無盡的歡樂和微笑，讓你忘卻塵世中的無奈與悲愁 ……\n\n" HIR
"                                              泥潭Ⅴ之王者歸來 歡迎您\n\n" NOR;
      
        } else
        if (topic == "2") // 單介紹一下這個遊戲的玩法
        {                 msg = HIW + "\n"
"老村長對你説道：那就讓我來給您介紹一下泥潭Ⅴ的玩法吧：\n"
"----------------------------------------------------\n" HIC +
"注：以下的「" HIY "泥潭" HIC "」代表本遊戲「" HIY "泥潭Ⅴ" HIC "」\n\n" HIY +
"    泥潭是一個以濃郁的武俠色彩為背景的虛擬文字網絡遊戲，" HIM "註冊進入遊戲後\n"
"你首先來到的是『" HIG "古村" HIM "』，在這裏，你將在系統為你設定的新手導師的細心的指\n"
"導下，瞭解和掌握如何進行這個遊戲。同時，在你向新手導師學習的過程中你可\n"
"以通過完成一些新手導師交給你的簡單任務獲取一定的經驗點和相關獎勵，更重\n"
"要的是，在古村的「武伯」（在練武場）處你還可以學到幾種武功技能，這將對\n"
"你日後的發展和行走江湖有很大的幫助。\n\n" HIY + 
"    當在古村歷練完或不願歷練，你可請求導師「老村長」允許你出村，" HIM "一旦老\n"
"村長覺得你歷練合格後將准許你離開古村進入江湖闖蕩。大家注意了，在古村裏\n"
"一切都有導師老村長的照顧，生病啊、受傷啊、飢餓啊什麼都可以免費找他，而\n"
"且在古村裏你的年齡永遠不會增加。但是一旦你出了古村，進入紛亂複雜的江湖\n"
"就大不一樣了，一切都得自己照顧自己了。\n\n" HIY +
"    進入江湖後最好就是立刻找一個自己中意的門派，拜師學藝。" HIM "泥潭提供了不\n"
"少的門派，諸如華山、武當、少林、逍遙等知名門派，各門派的特色也各有不同，\n"
"拜哪個門派學哪門武藝全憑個人的喜好。\n\n" HIY +
"    當你進入門派後，你就是真正江湖中的人了，以後的路如何走就得靠你自己\n"
"去抉擇。" HIM "本遊戲為每個玩家提供了多元化的發展空間，有多種職業方向供你們去\n"
"選擇，這以後你們就得學會多看help幫助文件（輸入指令help），多和其他玩家\n"
"交流，多開動你們的腦筋，你完全可以把這裏想象成一個虛擬的現實世界，把自\n"
"己的才智充分的在這裏發揮出來 ……\n\n" HIR
"    需要着重説明的是，你的一切行為都是通過指令來控制的，指令有以下幾部\n"
"分組成：\n" HIM
"    1、" HIG "指令名：" HIM "  如吃的指令名就是 eat，殺人的指令名就是 kill 。\n\n"
"    2、" HIG "對  象：" HIM"  比如你要吃饅頭(man tou)，你的對象就是饅頭(man tou)，\n"
"                 要殺李四(li si)，你的對象就是李四(li si)。\n" HIR
"                 注：對象均是以ID的形式出現，在中文名後的括號中的英文名\n"
"                 就是對象ID，如要殺李四(li si)，應該輸入指令：\n"
"                 kill li si ，而不是輸入指令 kill 李四；\n"
"                 要吃饅頭(man tou)應該輸入指令：\n"
"                 eat man tou ，而不是輸入指令 eat 饅頭。\n" HIM
"    3、" HIG "參  數：" HIM "  比如直接輸入指令 hp 可顯示你當前的狀態， 而再加上一個\n"
"                 參數 -g 的話則可顯示你的先天屬性，即輸入指令 hp -g 。\n\n" 
"    具體的細節可通過 " HIY "ask lao about 信息編號" HIM " 來進一步瞭解。\n\n" HIM
"    好了，現在就趕快開始你的人生旅程吧，祝君多珍重！\n\n" HIR
"                                                     泥潭巫師組 歡迎您\n\n" NOR;

        } else
        if (topic == "3") // 我在遊戲裏能做些什麼
        {                 msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你可以做些什麼吧：\n"
"----------------------------------------------------\n" HIY +
"    正如你在現實中一樣，這裏是一個虛擬現實的世界，在這裏你可以做幾乎一\n"
"切你想做的事：探險、聊天、練功、經商、做官、殺人、救人、結婚等等，只不\n"
"過你是以另一個虛擬的角色存在於這個世界中。你可以在這裏完成你在現實中無\n"
"法完成的想法、願望或者一些夢想 ……\n\n"
"    總之，一句話，在這裏以外你是生活在一個世界中，而進入這裏以後你又是\n"
"生活在屬於這個充滿夢想的世界 ……\n\n" HIR
"                                                     泥潭巫師組 歡迎您\n\n" NOR;
        } else
        if (topic == "4") // 我自己是誰
        {
                msg =  HIM "關於<你自己是誰>有以下相關信息：\n" NOR;
                msg += HIY "編號         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "41        查看我自己的外表\n"
                           "42        查看我自己的基本資料\n"
                           "43        查看我自己的狀態\n"
                           "44        查看我自己的天賦屬性\n"
                           "45        查看我自己所學的技能\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以輸入指令 ask lao about <編號>\n" NOR;
                msg += HIR "如要了解 <查看我自己的外表> 的信息，則輸入 ask lao about 41\n" NOR;
        } else
        if (topic == "5") // 我在哪裏
        {
                msg =  HIM "關於<你在哪裏>有以下相關信息：\n" NOR;
                msg += HIY "編號         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "51        查看我所在的地點\n"
                           "52        查看我所在的區域\n"
                           "53        查看整個中原地圖\n"
                           "54        查看整個世界地圖\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以輸入指令 ask lao about <編號>\n" NOR;
                msg += HIR "如要了解 <查看我所在的區域> 的信息，則輸入 ask lao about 52\n" NOR;
        } else
        if (topic == "6") // 如何移動
        {
                msg =  HIM "關於<如何移動>有以下相關信息：\n" NOR;
                msg += HIY "編號         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "61        行走\n"
                           "62        乘坐馬車\n"
                           "63        騎馬\n"
                           "64        追尋自己的神兵\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以輸入指令 ask lao about <編號>\n" NOR;
                msg += HIR "如要了解 <乘坐馬車> 的信息，則輸入 ask lao about 62\n" NOR;
        } else
        if (topic == "7") // 如何跟其他朋友交流
        {
                msg =  HIM "關於<如何跟其他朋友交流>有以下相關信息：\n" NOR;
                msg += HIY "編號         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "71        聊天\n"
                           "72        留言\n"
                           "73        短消息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以輸入指令 ask lao about <編號>\n" NOR;
                msg += HIR "如要了解 <留言> 的信息，則輸入 ask lao about 72\n" NOR;
        } else
        if (topic == "8") // 我可以扮演哪些角色
        {                 msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你關於泥潭職業的相關信息吧：\n"
"----------------------------------------------------\n" HIM +
"    抱歉，目前職業系統更新中，暫未開放。\n\n" NOR;
        } else
        if (topic == "9") // 如何生存
        {
                msg =  HIM "關於<如何生存>有以下相關信息：\n" NOR;
                msg += HIY "編號         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "91        解決温飽\n"
                           "92        生病了怎麼辦\n"
                           "93        死亡後怎麼辦\n"
                           "94        中毒了怎麼辦\n"
                           "95        受傷了怎麼辦\n"
                           "96        如何揀東西、給東西、扔東西\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以輸入指令 ask lao about <編號>\n" NOR;
                msg += HIR "如要了解 <中毒了怎麼辦> 的信息，則輸入 ask lao about 94\n" NOR;
        } else
        if (topic == "10") // 如何練功和使用兵器
        {
                msg =  HIM "關於<如何練功和使用兵器>有以下相關信息：\n" NOR;
                msg += HIY "編號         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "101       內功介紹\n"
                           "102       外功介紹\n"
                           "103       輕功介紹\n"
                           "104       招架介紹\n"
                           "105       其他技能介紹\n"
                           "106       使用兵器\n"
                           "107       拜師學藝\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以輸入指令 ask lao about <編號>\n" NOR;
                msg += HIR "如要了解 <內功介紹> 的信息，則輸入 ask lao about 101\n" NOR;
        } else
        if (topic == "11") // 如何戰鬥
        {
                msg =  HIM "關於<如何戰鬥>有以下相關信息：\n" NOR;
                msg += HIY "編號         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "111       戰鬥系統介紹\n"
                           "112       戰鬥前的必要準備\n"
                           "113       戰鬥指令介紹\n"
                           "114       如何施展內功\n"
                           "115       如何施展外功\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以輸入指令 ask lao about <編號>\n" NOR;
                msg += HIR "如要了解 <內功介紹> 的信息，則輸入 ask lao about 101\n" NOR;
        } else
        if (topic == "12") // 如何得到更多幫助
        {
                msg =  HIM "關於<如何得到更多幫助>有以下相關信息：\n" NOR;
                msg += HIY "編號         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "121       查看幫助文件庫\n"
                           "122       玩家間的交流\n"
                           "123       請求新手導師幫助\n"
                           "124       廣播你的求教信息\n"
                           "125       在泥潭信息庫中搜索你需要的信息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以輸入指令 ask lao about <編號>\n" NOR;
                msg += HIR "如要了解 <廣播你的求教信息> 的信息，則輸入 ask lao about 124\n" NOR;
        } else
        if (topic == "13") // 如何離開這裏到外面的世界去
        {
                msg = HIM "等你在這裏歷練合格（輸入指令 " HIY "ask lao about 出村" HIM "）後，可到『古村』村口\n"
                      "去找" HIG "花伯" HIM "（輸入指令 " HIY "ask hua about 出村" HIM "）。\n" NOR;

        } 
        // ==================================================================================
        // 從 4 開始的二級分類
        // ==================================================================================
        else
        if (topic == "41") // 查看我自己的外表
        {
                msg=HIM"\n你可以輸入指令"+BLINK+HIY+"look "+query("id", me)+NOR+HIM"來查看"
                          "你自己的外表。\n" NOR;
                msg += HIR "趕快試試這個指令吧！\n\n" NOR;
        } else
        if (topic == "42") // 查看我自己的基本資料
        {
                msg = HIM "\n你可以輸入指令 " + BLINK + HIY + "score" + NOR + HIM " 來查看你自己的基本資料。\n" NOR;
                msg += HIR "趕快試試這個指令吧！\n\n" NOR;
                
                msg += HIM "關於<score指令所顯示的基本資料>有以下相關信息：\n" NOR;
                msg += HIY "編號         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "421       天性的作用\n"
                           "422       實戰經驗的作用\n"
                           "423       江湖閲歷的作用\n"
                           "424       正氣和邪氣的作用\n"
                           "425       門派貢獻的作用\n"
                           "426       江湖威望的作用\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以輸入指令 ask lao about <編號>\n" NOR;
                msg += HIR "如要了解 <江湖威望的作用> 的信息，則輸入 ask lao about 425\n" NOR;
                msg += HIY "輸入指令 " + HIR + BLINK + "score" + NOR + HIY " 可查看到以上基本資料。\n" NOR;
        } else
        if (topic == "43") // 查看我自己的狀態
        {
                msg = HIM "\n你可以輸入指令 " + BLINK + HIY + "hp" + NOR + HIM " 來查看你自己當前的狀態。\n" NOR;
                msg += HIR "趕快試試這個指令吧！\n\n" NOR;
                
                msg += HIM "關於<hp指令所顯示的數據>有以下相關信息：\n" NOR;
                msg += HIY "編號         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "431       精氣的作用\n"
                           "432       精力的作用\n"
                           "433       氣血的作用\n"
                           "434       內力的作用\n"
                           "435       食物與飲水有什麼作用\n"
                           "436       潛能的作用\n" 
                           "437       體會的作用\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以輸入指令 ask lao about <編號>\n" NOR;
                msg += HIR "如要了解 <內力的作用> 的信息，則輸入 ask lao about 434\n" NOR;
                msg += HIY "輸入指令 " + HIR + BLINK + "hp" + NOR + HIY " 可查看以上信息。\n" NOR;

        } else
        if (topic == "44") // 查看我自己的天賦屬性
        {
                msg = HIM "\n你可以輸入指令 " + BLINK + HIY + "hp -g" + NOR + HIM " 來查看你自己當前的狀態。\n" NOR;
                msg += HIR "趕快試試這個指令吧！\n\n" NOR;
                
                msg += HIM "關於<hp -g 指令所顯示的數據>有以下相關信息：\n" NOR;
                msg += HIY "編號         信    息\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIC "441       臂力的作用\n"
                           "442       悟性的作用\n"
                           "443       根骨的作用\n"
                           "444       身法的作用\n"
                           "445       種類的作用\n" NOR;
                msg += HIY "------------------------------------------\n" NOR;
                msg += HIR "要了解的信息可以輸入指令 ask lao about <編號>\n" NOR;
                msg += HIR "如要了解 <身法的作用> 的信息，則輸入 ask lao about 444\n" NOR;
                msg += HIY "輸入指令 " + HIR + BLINK + "hp -g" + NOR + HIY " 可查看以上信息。\n" NOR;

        } else
        if (topic == "45") // 查看我自己所學的技能
        {
                msg = HIM "\n你可以輸入指令 " + BLINK + HIY + "cha" + NOR + HIM " 來查看"
                          "你掌握的技能。\n" NOR;
                msg += HIR "趕快試試這個指令吧！\n\n" NOR;

        } else
        if (topic == "421") // 天性的作用
        {
                 msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你泥潭中有關天性的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    天性即是你出生時具有的先天性格，不同的天性會對你以後的發\n"
"展有一定的影響，雖然天性對你拜哪個門派並沒有什麼影響，但是它\n"
"會影響你學某些武功，而泥潭中的絕大多數上層武功均有天性的限制。\n"
"例如由胡家刀法與苗家劍法所演練合成的不世武學刀劍歸真便非天性\n"
"光明磊落者不能學習，而此種天性者卻不會使用毒技。又例，修煉號\n"
"稱武林第一祕笈的葵花魔功及其殘缺不全版本的辟邪劍法，便均需陰\n"
"險奸詐之輩。除了武功對性格的要求外，不同性格同時還具有以下特\n"
"點：\n\n" HIY +
"   【光明磊落】       具有最大的憤怒值和最大的加怒能力，能夠\n"
"                      有效的施展憤怒一擊。另外還將獲得更好的\n"
"                      抗打擊能力，不容易受傷。\n\n" + HIC +
"   【狡黠多變】       在受到對方的牽制性攻擊或是自身使用絕招\n"
"                      後，所受到的忙碌狀態將會縮短一些，但並\n"
"                      不是每次都能夠奏效。\n\n" HIR +
"   【心狠手辣】       和光明磊落者一樣，能夠有效的運用憤怒技\n"
"                      能，施展加怒和憤怒一擊。另外在命中對手\n"
"                      時還具有更為強大的殺傷力。\n\n" + HIG +
"   【陰險奸詐】       在普通戰鬥狀態下或是使用一些特殊的進攻\n"
"                      性絕招時，自身的攻擊命中率將獲得有效的\n"
"                      提升，可以更容易擊中對手。\n\n" NOR;

        } else
        if (topic == "422") // 實戰經驗的作用
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關實戰經驗的信息吧：\n"
"-----------------------------------------------------\n" HIM +
"    簡單來説，實戰經驗有以下幾點作用：\n\n" HIY + 
"一、影響你在戰鬥中的攻擊命中率及傷害點數。\n"
"二、限制你的技能等級，你的技能等級換算公式如下：\n" HIR
"    實戰經驗 >= 技能等級*技能等級*技能等級 / 10\n" HIY
"三、影響你在門派中繼續向上拜師和學習一些絕招。\n"
"四、隨着你實戰經驗地升高，你的任務難度也會逐漸增大。\n\n" HIM
"    如何提高實戰經驗：\n\n" HIY
"    可以通過完成師門任務、自由任務或一些特殊故事情節獲取實戰經驗。\n\n" NOR;

        } else
        if (topic == "423") // 江湖閲歷的作用
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關江湖閲歷的信息吧：\n"
"-----------------------------------------------------\n" HIY +
"    簡單來説，江湖閲歷有以下作用：\n\n" HIM
"一、在你領取師門任務前，師傅會叫你外出歷練，而歷練前提就是需\n"
"要具有100點江湖閲歷。\n"
"二、對於一些特殊事件會對江湖閲歷做要求。\n"
"三、影響你的綜合實力評價。\n\n" HIR
"    如何提升江湖閲歷？\n\n" HIM
"    通過完成各種任務，到郭府歷練等都可以提高江湖閲歷，同時在\n"
"古村歷練完成後也將獲得一些江湖閲歷。\n" NOR;

        } else
        if (topic == "424") // 正氣和邪氣的作用
        {                
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關正氣和邪氣的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    正氣和邪氣代表着你正邪立場，江湖中有正道就有邪道，所謂正邪\n"
"不兩立，一旦你選擇了正道，就將被邪道所排斥，相反也是如此。所以，\n"
"一開始你就得想好你以後是走哪條路，泥潭為玩家們提供了比較豐富的\n"
"門派以供選擇，其中包含正派，如武當、少林等，也有邪派，如星宿派、\n"
"日月神教等，正派要求你具有正氣而邪派要求你具有邪氣。你在一個門\n"
"派中的地位越高，則要求你的正氣或者邪氣越高。\n\n" HIR
"    如何增加正氣或邪氣？\n\n" HIM
"    很簡單，你只要多殺正派人士，你的邪氣就會增加；多殺邪派人士，\n"
"你的正氣就會增加。在進入這個世界的時候，你的正氣是 0，即代表你\n"
"沒有正氣也沒有邪氣，加入正派時只要你的正氣不是負數（即沒有邪氣）\n"
"即可；而加入某些邪派卻需要邪氣，一開始，當你什麼技能都沒有的時\n"
"候，可以去通過吃人頭來增加邪氣。\n\n" NOR;

        } else
        if (topic == "425") // 門派貢獻的作用
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關門派貢獻作用的信息吧：\n"
"---------------------------------------------------------\n" HIM +
"    在泥潭裏，所有的玩家都會有一個門派，在門派中你要獲得較高\n"
"的地位，學到更高級的武功及絕招以及獲得師傅獎勵的物品都需要消\n"
"耗門派貢獻。\n\n"
"    在泥潭裏，你可以通過完成師門任務（輸入指令 help quest 查\n"
"看）或一些特殊故事情節來增加門派貢獻度。\n\n" NOR;

        } else
        if (topic == "426") // 江湖威望的作用
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關江湖威望作用的信息吧：\n"
"---------------------------------------------------------\n" HIM +
"    簡單來説，江湖威望有以下作用：\n\n"
"一、在門派掌門處領取殺人的任務時需要至少20點江湖威望。\n"
"二、在做自由任務之調解任務時，需要請單正做調解，至少要江湖威\n"
"望10000點以上才能請得動單正。\n"
"三、影響你的綜合實力評價。\n\n" HIR
"    如何增加江湖威望？\n\n" HIM
"一、如果你能弄到黃金可通過向泥潭基金捐獻黃金獲得威望。\n"
"二、通過完成門派掌門交給你的送信任務來增加威望。\n\n" NOR;

        } else
        if (topic == "431") // 精氣的作用
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關精氣的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    簡單來説，精氣代表着你的精神狀態，你在讀書或者研究武功的\n"
"時候需要消耗精氣。精氣為零隻會導致你不能讀書或研究武功，不會\n"
"暈倒。\n\n" HIR
"   如何提高精氣？\n\n" HIM 
"   提高你的精力值，精氣上限值受精力值的限制。\n\n" NOR;

        } else
        if (topic == "432") // 精力的作用
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關精力的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    精力是一個比較重要的屬性值，代表着你的思維狀態，一旦精\n"
"力為零你就會暈倒，這非常之嚴重，如果在戰鬥中你突然暈倒即意\n"
"味着死亡。再就是，精力的高低影響着你的發展，如修煉一些高級\n"
"武學境界，同時精力的高低也直接影響着精氣的高低。\n\n" HIR
"    如何提高精力？\n\n" HIM
"    你可以通過吐吶（輸入指令 help tuna 查看）來提高你的精力。\n\n" NOR;

        } else
        if (topic == "433") // 氣血的作用
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關氣血的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    氣血代表着你的生命值，當氣血為零的時候你就會死亡。在練\n"
"習武功或進行一些體力活動時要消耗氣血。\n\n" HIR
"    如何提高氣血？\n\n" HIM
"    隨着你年齡的增加你的氣血會增加少量，在泥潭裏累積在線 240\n"
"小時增加年齡一歲。再就是你的內力上限影響你的氣血，內力越來越\n"
"高你的氣血就會越高，所以等你有一定內功基礎後可以通過打坐來提\n"
"高內力，從而提高你的氣血， 有關打坐方法請輸入指令 help dazuo\n"
"查看。\n\n" NOR;

        } else
        if (topic == "434") // 內力的作用
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關內力的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    內力代表你體內所藴藏的能量，簡單來説，在你施展絕招，運功\n"
"療傷、解毒等時候，都需要消耗你的內力值。內力在泥潭裏是一個非\n"
"常重要的屬性。\n\n" HIR
"    如何提高內力？\n" HIM
"    等你有一定內功基礎的時候可以通過打坐來提高你的內力，有關\n"
"打坐的方法及指令可輸入指令 help dazuo 來查看。\n\n" NOR;

        } else
        if (topic == "435") // 食物與飲水有什麼作用
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關食物與飲水的作用的信息吧：\n"
"-------------------------------------------------------------\n" HIM +
"    食物和飲水屬性代表着你的飢餓程度，一旦食物或飲水為零則會\n"
"導致你暈倒，如在戰鬥中暈倒則意味着死亡。\n\n" HIR
"    如何提高食物和飲水？\n\n" HIR
"    在泥潭裏你可以通過吃東西和喝東西來提高食物和飲水，通常在\n"
"各城市的客店都會有食物和水袋賣。\n\n" NOR;
        } else
        if (topic == "436") // 潛能有什麼作用
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關潛能的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    潛能通俗地來説就是“學習點數”，你在向師傅學習技能或自己\n"
"研究技能的時候都需要消耗潛能，如果潛能不足，你將無法繼續學習\n"
"技能。\n\n" HIR
"    如何提高潛能？\n\n" HIM
"    在泥潭中你可以通過多種途徑來提高潛能，如工作、做任務、服\n"
"用一些特殊丹藥等。通常玩家通過完成師門任務來積累潛能。\n\n" NOR;
        } else
        if (topic == "437") // 體會有什麼作用
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關體會的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    體會即實戰體會，是你在戰鬥或任務中獲得的體會，當你的體會\n"
"值積累到一定的時候，可以通過汲取體會（輸入指令 jiqu ）來將體\n"
"會轉化為武學修養，武學修養影響着你學習一些高級武功。\n\n" HIR
"    如何提高體會？\n\n" HIM
"    通過完成師門任務或一些特殊任務可提高實戰體會。\n\n" NOR;

        } else
        if (topic == "441") // 臂力的作用
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關臂力的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    在泥潭中臂力分為" HIY "先天臂力" HIM "和" HIY "後天臂力" HIM "，先天臂力是你一出生就\n"
"具有的，且不會隨着後天某些武功的增加而增加，但是可以通過服用\n"
"各種仙丹、奇遇和先天特殊技能來提升，除此外別無他法。\n\n"
"    先天臂力的高低會影響你日後學習某些高級技能，如九陰神功需\n"
"要限制你先天臂力不低於三十八點。\n\n"
"    後天臂力則不同，後天臂力可通過學習基本拳腳等空手技能來提\n"
"升，每學習十級可提升一點臂力，後天臂力的計算公式是：\n\n" HIG
"    後天臂力 = 先天臂力 + 拳腳等級 / 10\n\n" HIM
"    臂力影響你的：攻擊威力、負重等。\n\n"
"    先天臂力可輸入指令 hp -g 查看。\n"
"    後天臂力可輸入指令 score 查看。\n\n"NOR;

        } else
        if (topic == "442") // 悟性的作用
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關悟性的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    在泥潭中悟性分為" HIY "先天悟性" HIM "和" HIY "後天悟性" HIM "，先天悟性是你一出生就\n"
"具有的，且不會隨着後天某些武功的增加而增加，但是可以通過服用\n"
"各種仙丹、奇遇和先天特殊技能來提升，除此外別無他法。\n\n"
"    先天悟性的高低會影響你日後學習某些高級技能，如獨孤九劍需\n"
"要限制你先天悟性不低於三十九點。\n\n"
"    後天悟性則不同，後天悟性可通過學習讀書寫字來提升，每學習\n"
"十級可提升一點悟性，後天悟性的計算公式是：\n\n" HIG
"    後天悟性 = 先天悟性 + 讀書寫字等級 / 10\n\n" HIM
"    悟性影響你的：學習速度、領悟能力。\n\n"
"    先天悟性可輸入指令 hp -g 查看。\n"
"    後天悟性可輸入指令 score 查看。\n\n"NOR;

        } else
        if (topic == "443") // 根骨的作用
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關根骨的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    在泥潭中根骨分為" HIY "先天根骨" HIM "和" HIY "後天根骨" HIM "，先天根骨是你一出生就\n"
"具有的，且不會隨着後天某些武功的增加而增加，但是可以通過服用\n"
"各種仙丹、奇遇和先天特殊技能來提升，除此外別無他法。\n\n"
"    先天根骨的高低會影響你日後學習某些高級技能，如六脈神劍需\n"
"要限制你先天根骨不低於三十六點。\n\n"
"    後天根骨則不同，後天根骨可通過學習基本內功來提升，每學習\n"
"十級可提升一點根骨，後天根骨的計算公式是：\n\n" HIG
"    後天根骨 = 先天根骨 + 基本內功等級 / 10\n\n" HIM
"    根骨影響你的：體力等恢復速度、內力上限等。\n\n"
"    先天根骨可輸入指令 hp -g 查看。\n"
"    後天根骨可輸入指令 score 查看。\n\n"NOR;


        } else
        if (topic == "444") // 身法的作用
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關身法的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    在泥潭中身法分為" HIY "先天身法" HIM "和" HIY "後天身法" HIM "，先天身法是你一出生就\n"
"具有的，且不會隨着後天某些武功的增加而增加，但是可以通過服用\n"
"各種仙丹、奇遇和先天特殊技能來提升，除此外別無他法。\n\n"
"    先天身法的高低會影響你日後學習某些高級技能，如凌波微步需\n"
"要限制你先天身法不低於三十點。\n\n"
"    後天身法則不同，後天身法可通過學習基本輕功來提升，每學習\n"
"十級可提升一點身法，後天身法的計算公式是：\n\n" HIG
"    後天身法 = 先天身法 + 基本輕功等級 / 10\n\n" HIM
"    身法影響你的：攻擊命中、閃躲能力。\n\n"
"    先天身法可輸入指令 hp -g 查看。\n"
"    後天身法可輸入指令 score 查看。\n\n"NOR;

        } else
        if (topic == "445") // 種類的作用
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關種類的作用的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    輸入 hp -g 命令後，可以看到第一行顯示以下種類：\n\n" HIG
"    『初始』 『先天』 『成功』 『失敗』 『故事』 『元神』\n\n" HIM
"    初始：你出生的時候獲得該天賦（如先天悟性）初始先天值。\n"
"    先天：你當前該天賦（如先天根骨）的先天值。\n"
"    成功：這項代表你服用丹藥來增加先天屬性的成功次數。\n"
"    失敗：這項代表你服用丹藥來增加先天屬性的失敗次數。\n"
"    故事：1代表你已經中過能增加該天賦的故事。\n"
"          0代表你未中過能增加該天賦的故事。\n"
"    元神：表示你通過元神的修煉也可以增加臂力、悟性等屬性。\n\n" HIR
"    注：無論成敗，對於一種天賦，你一生只能吃十個增加天賦的仙\n"
"    丹。如先天悟性，你總共吃丹數量最多限制為十顆，當前已服用\n"
"    仙丹數量（如增加先天悟性的仙丹）的計算方法如下：\n\n" HIG
"    服用數量 = 成功次數 + 失敗次數\n\n" NOR;

        } else
        if (topic == "51") // 查看我所在的地點
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關你所在的地點信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    輸入指令 " BLINK + HIR "look" NOR + HIM" 可查看你當前所在的地點，你可以看到以下一些\n"
"    信息：\n\n" HIM
"    地點名：    " HIY "即該地點的地名，如你現在就在「世界之樹」這個\n"
"    地方。\n\n" HIM
"    地點描述：  " HIY "即該地點的説明，如“這裏是古村的正中心……”\n"
"    就是該地點的一些描述。\n\n" HIM
"    地點出口：  " HIY "即該地點連接到的其他地方，如：\n"
"   “這裏明顯的出口是 north、east、west 和 south” \n"
"    以上的north（北面）、east（東面）等就是該地點的出口。\n\n" HIM
"    人物、物品：" HIY "即該地點中有哪些人物，如：\n"
"    “導師「人見人愛」老村長(lao cunzhang)” 就是該地點中\n"
"    人物。如果地上有物品則會有相關顯示：如“一兩黃金(Gold)”\n\n" NOR;

        } else
        if (topic == "52") // 查看我所在的區域
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關你所在的區域信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    輸入指令 " BLINK + HIY + "map" + NOR + HIM " 來查看你當前所在區域。\n" HIR
"    趕快試試這個指令吧！\n\n" NOR;
        } else
        if (topic == "53") // 查看整個中原地圖
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關查看中原地圖信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    輸入指令 " BLINK + HIY + "map china" + NOR + HIM " 來查看整個中原地圖。\n" HIR
"    趕快試試這個指令吧！\n\n" NOR;
        } else
        if (topic == "54") // 查看整個世界地圖
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關查看世界地圖信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    輸入指令 " BLINK + HIY + "help mapall.txt" + NOR + HIM " 來查看整個世界地圖。\n" HIR
"    趕快試試這個指令吧！\n\n" NOR;
        } else
        if (topic == "61") // 行走
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關行走的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    在泥潭裏行走是最基本最常用的移動方式，你可以通過行走移動到與你\n"
"所在地點有出口的地方，如你輸入指令 look 可以看到你所在地點的出口：\n\n" HIG
"    這裏明顯的出口是 north、east、west 和 south \n\n" HIM
"    north(北)、east(東)、west(西)、south(南)就是這個地點的出口，你\n"
"只需要輸入出口的英文名，如輸入指令 north 即向北移動。 通過連續地移\n"
"動你便可以達到你想去的地方。\n\n"
"    但是，如果對地圖不熟悉，使用行走的方式移動容易迷路，這就需要借\n"
"助 show 指令的了，輸入指令 show 可以看到你所在的這個地點在你這個區\n"
"域內的具體位置，通過指令 show 你可以查看到你在的地點是「世界之樹」，\n"
"而你所在的區域是【古村】，根據：\n\n "HIG
"    上北、下南、左西、右東的原則，\n\n" HIM
"    如果你要行走到「南練武場」，則依次輸入：\n\n" HIC
"    east、east、south\n\n" HIM
"    即可到達，而為簡單方便起鍵，通常出口都可以進行以下縮寫：\n\n" HIR
"    east = e; south = s; north = n; west = w;\n"
"    up(上) = u; down(下) = d; northeast(東北) = ne 等等\n\n" NOR;

        if( !query("newbie_quest_completed/move", me) )
        {
                msg += HIM "    現在，你將接受一個練習，根據你學到的行走方式，你移動到「" HIG "竹林" HIM "」\n";
                msg +=     "去，然後回來找我 " HIY "ask lao about ok" HIM " 。\n\n" NOR;
                set("newbie_quest/leixing", "move", me);
                set("newbie_quest/quest_name", "如何行走", me);
                set("newbie_quest/tar_id", "zhulin", me);
                set("newbie_quest/point", 10, me);
                set("newbie_quest/msg", HIY"你先移動到竹林去，然後再回來找我（ask lao about ok）。"NOR, me);
                me->save();
        } // endif
        } else
        if (topic == "62") // 乘坐馬車
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關乘坐馬車的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    通常，在一個城市內移動不需要乘坐馬車，使用行走方式即可。但是如\n"
"果需要移動到其他城市，便可以通過乘坐馬車來節約時間。馬車可在每個城\n"
"市的馬廄裏輸入指令 " HIY "goto <城市ID>" HIM " 來乘坐，在馬廄輸入指令 " HIY "look paizi\n"
HIM "可查看各城市ID。\n\n" NOR;
        } else
        if (topic == "63") // 騎馬
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關騎馬的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    騎馬的功能幾乎的乘坐馬車一樣，但是騎馬具有更大的靈活性，其不但\n"
"可以從任何地方開始，直接到達各大城市馬廄，而且可以通過記錄某些地點，\n"
"以後可騎馬直接達到。更重要的是，你不但可以自己騎馬而且也可以搭上你\n"
"的同伴與你一起快馬同行。\n"
"如果你對騎馬的移動方式感興趣可參見幫助文件 " HIY "help horse\n\n" NOR;
        } else
        if (topic == "64") // 追尋自己的神兵
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關追尋自己的神兵的信息吧：\n"
"-----------------------------------------------------------\n" HIM +
"    每一個江湖人士都會有一把自己心愛的兵器，兵器也有等級之分，當你\n"
"的兵器被煉化到十級的時候，你便可以把兵器放在任何一個地方，以後直接\n"
"通過追尋(指令為 miss <兵器ID>)便可從任何地方到達你兵器所在地方。\n"
"如果你對追尋神兵感興趣的話可參見幫助文件 " HIY "help weapon\n\n" NOR;
        } else
        if (topic == "71") // 聊天指令
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關聊天指令的信息吧：\n"
"-----------------------------------------------------\n" HIM +
"    任何一個世界中都無法離開交流，而聊天是最直觀，最高效的交流方式。\n"
"本遊戲為各位玩家提供了非常豐富的聊天指令，現簡單介紹如下：\n\n" HIC
"    chat <聊天內容>   ： 將聊天內容廣播出，所有在線的玩家都能收到。\n"
"    sos <聊天內容>    ： 新手求救，可在此發出你的求救信息。\n"
"    rumor <聊天內容>  ： 發佈謠言。此頻道可隱藏發言人的姓名。\n"
"    bill <聊天內容>   ： 交易頻道，交易信息可在此頻道發佈。\n"
"    family <聊天內容> ： 同門交流，只有與你同師門的玩家能收到。\n"
"    tell sb <聊天內容>： 密談，跟sb進行祕聊，這些聊天內容只有你們兩人看得到。\n\n" HIM
"    其他聊天指令可參見幫助文件 help channels\n\n" NOR;
        } else
        if (topic == "72") // 留言
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關留言的信息吧：\n"
"-----------------------------------------------------\n" HIM +
"    在遊戲中的客店或其他一些特殊的地方都設有留言板(board)，你可以在這些地方\n"
"輸入指令 post <留言主題>，然後輸入留言內容後，注意，這時你需要按 . 鍵（即小\n"
"數點號），表示你輸入完畢。這時，路過的玩家只要輸入 read new 或者 read <留言\n"
"編號>  就可以查看你輸入的內容了。要查看所有的留言可以輸入指令 look <留言板編\n"
"號>，通常為 look board\n\n" BLINK + HIY
"    你面前就有一塊 新手留言板(board)，你可以嘗試一下以上指令。\n\n" NOR;

        } else
        if (topic == "73") // 短消息
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關短消息的信息吧：\n"
"-----------------------------------------------------\n" HIM +
"    本站為方便玩家間交流，克服離線後難以交流的缺點，特地開發了短消息系統，玩\n"
"家可通過輸入指令 msg mail <玩家ID> 向任何一個玩家發送短消息， 不管該玩家是否\n"
"在線都能收到這條消息，是目前最普遍的交流方式。\n\n" NOR;
        } else
        if (topic == "91") // 解決温飽
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關解決温飽的信息吧：\n"
"-----------------------------------------------------\n" HIM +
"    一個人總有飢餓和口渴的時候，這時，就需要補充以下能量了，通常在各城市的客\n"
"店裏能買到雞腿和水袋等。使用指令 eat <物品ID> 可吃東西，而指令 drink <物品ID>\n"
"可以喝水等物品。\n\n"
"    在古村裏，你不會飢餓或者口渴，但是一旦你出去了就需要注意了。\n\n" NOR;
        } else
        if (topic == "92") // 生病了怎麼辦
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關生病了怎麼辦的信息吧：\n"
"--------------------------------------------------------\n" HIM +
"    通常新手由於體質較差會經常生病，這時，新手可以到揚州的藥鋪裏有各種治病的\n"
"藥買，你可以根據你的病情買一些藥，吃後即可恢復正常。\n\n"
"    在古村裏，如果你生病可以來找我 ask lao about 治療 。\n\n" NOR;
        } else
        if (topic == "93") // 死亡後怎麼辦
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關死亡後怎麼辦的信息吧：\n"
"---------------------------------------------------------\n" HIM +
"    在你死亡後，會到陰曹地府內，白無常會説你的陽壽未盡叫你回到陽間。然後，你\n"
"可以繼續遊戲。但是死亡後，你身上的物品會丟失並且會丟失一定的經驗、潛能和武功。\n\n"
"    在古村裏，你不用擔心，你不會死亡，不過出村後一定要多加小心哦！\n\n" NOR;
        } else
        if (topic == "94") // 中毒怎麼辦
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關中毒怎麼辦的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    如果你內功等級高，你中毒後，可以先封閉穴道（輸入指令 fengxue），然後儘快\n"
"解毒。解毒的方式有多種，一種是自己用內功逼毒或者找內功高的玩家幫助解毒，還有\n"
"一種是找解毒的NPC幫助解毒。具體信息可參見幫助文件 help poison\n\n"
"    如果你在古村中毒的話，可來找我解毒 ask lao about 治療 \n\n" NOR;

        } else
        if (topic == "95") // 受傷了怎麼辦 
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關受傷了怎麼辦的信息吧：\n"
"---------------------------------------------------------\n" HIM +
"    通常，你的氣血會逐漸慢慢的恢復，恢復速度跟你的根骨屬性有關。如果你的內功\n"
"達到一定等級，你可以運用內功來療傷，具體信息可參見幫助文件 help force\n\n"
"    如果你在古村受傷，你可以來找我，輸入指令 ask lao about 治療 \n\n" NOR;
        } else
        if (topic == "96") // 如何揀東西、給東西、扔東西
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關如何揀東西、給東西、扔東西的信息吧：\n"
"-----------------------------------------------------------------------\n" HIM +
"    首先，你輸入指令 look 可以看到你所在地方有什麼東西可揀。\n"
"    然後輸入指令 get <物品ID> 可將物品揀起來，輸入指令 i 可查看你身上的物品。\n\n"
"        輸入指令 give <對方ID> <數量> <物品ID> 可將你身上的物品給對方。如：\n"
"                 give jack 2 man tou 可將兩個饅頭給jack。\n\n"
"        輸入指令 drop <數量> <物品ID> 可將身上物品丟棄。\n\n" NOR;
        }
 else
        if (topic == "101") // 內功介紹
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關內功的信息吧：\n"
"-------------------------------------------------\n" HIM +
"    內功即你的武功的內在修為，如九陽神功就是一種內功。在泥潭裏內功是比較重要的，\n"
"它直接影響着你的內力大小，攻擊威力等諸多方面。內功主要有以下作用：\n\n" HIY +
"普通功能\n\n" HIC +
"regenerate     提振精神          recover     調勻氣息\n"
"lifeheal       為人療傷          heal        運功療傷\n"
"dispel         療解毒素          inspire     激勵精神\n\n" HIY +
"特殊功能\n\n" HIC +
"roar           內勁傷敵          shot        彈射毒藥\n"
"powerup        提升戰力          shield      護體真氣\n\n" NOR +
"    如你要使用療傷功能則可使用指令 yun heal。當然，前提是你已經學會一種內功，並\n"
"且內功修為和內力修為達到一定等級。\n\n" HIY;
"    更多相關幫助請參閲幫助文件 help force\n\n" NOR;
        } else
        if (topic == "102") // 外功介紹
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關外功的信息吧：\n"
"--------------------------------------------------\n" HIM +
"    外功即你的外家功夫的修為，如劍法，拳法等，如獨孤九劍和太極拳就是外功的一種。\n"
"通常戰鬥中用來攻擊對方的都是外功，而外功施展絕招需要內功和內力的支持。\n\n" HIY +
"    有關武功説明可參見幫助文件 help skills\n\n" NOR;
        } else
        if (topic == "103") // 輕功介紹
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關輕功的信息吧：\n"
"--------------------------------------------------\n" HIM +
"    輕功影響着你的攻擊命中率及閃躲回避率，如果你的輕功等級較高可以在戰鬥中有更\n"
"高的機率打中對方，並且當別人攻擊你的時候你有更多的機會閃避。\n\n" NOR;
        } else
        if (topic == "104") // 招架介紹
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關招架的信息吧：\n"
"-------------------------------------------------\n" HIM +
"    招架很好理解，假設別人在攻擊你的時候你沒有成功地閃避，但是，如果你招架等級\n"
"較高仍然可以將別人的攻擊化去，如別人一刀砍向你，你用手中的兵器擋住。\n\n" NOR;
        } else
        if (topic == "105") // 其他技能介紹
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關其他技能介紹的信息吧：\n"
"---------------------------------------------------------\n" HIM +
"    在泥潭中除了內功、外功、輕功、招架外還有其他許多技能，其中部分會直接影響到你\n"
"的戰鬥效果，如桃花島絕學「陰陽八卦」，可以破除對手的特殊防禦效果；其他部分雖然不\n"
"會對你的戰鬥效果有影響，但是它們卻是武學提升和學習一些高級武功的先決條件，如武學\n"
"修養，很多高級的武功都會要求你的武學修養，武學修養只能通過汲取戰鬥中累計的實戰經\n"
"驗來提升。還有一些其他技能如：丹青技術、鑲嵌手藝、梵文、禪宗心法等都會有相應的作\n"
"用，具體的應用，你可以在需要時參看相關的幫助文件。\n\n" NOR;
        } else
        if (topic == "106") // 使用兵器
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關使用兵器的信息吧：\n"
"-----------------------------------------------------\n" HIM +
"    兵器在泥潭中的地位非常之重要，一把好的兵器可以使你戰鬥力大大地提升，在泥潭中\n"
"兵器大致分為以下幾類：\n\n" HIY
"    攻擊類兵器：劍、刀、杖、棍、鞭、拳套、指套等\n" HIC +
"    防禦類兵器：甲、衣、鞋、靴、、頭盔、頭飾、護腕、披風等。\n\n" HIR
"    如何裝備/卸載兵器：\n\n" HIY
"    攻擊類兵器都使用指令 wield <兵器ID> 裝備，但是拳套，指套等空手武功兵器除外。\n"
"    攻擊類兵器都使用指令 unwield <兵器ID> 卸載裝備，但是拳套，指套等空手武功兵器除外。\n\n" HIC +
"    防禦類兵器都使用指令 wear <兵器ID> 裝備。\n" HIC +
"    防禦類兵器都使用指令 remove <兵器ID> 卸載裝備。\n\n" HIR
"    你可以通過查看兵器屬性（look <兵器ID>）來查看該兵器如何使用。\n" HIR
"    輸入指令 i 可查看你身上的物品！\n\n" NOR;

        if( !query("newbie_quest_completed/wield", me) )
        {
                msg += HIM "    現在，你將接受一個練習，根據你學到兵器使用方法，到兵器室去拿一把劍（到兵器室\n";
                msg +=     "內輸入指令 get jian from 裝備後來找我 " HIY "ask lao about ok" HIM " 。\n\n" NOR;
                set("newbie_quest/leixing", "wield", me);
                set("newbie_quest/quest_name", "如何裝備兵器", me);
                set("newbie_quest/tar_id", "newbiejian", me);
                set("newbie_quest/point", 15, me);
                set("newbie_quest/msg", HIY"你先把兵器室裏的劍拿來裝上，然後在來找我。\n"NOR, me);
                me->save();
        } // endif
        } else
        if (topic == "107") // 拜師學藝
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關拜師學藝的信息吧：\n"
"-----------------------------------------------------------------------\n" HIM +
"    每個人要成長總得不斷地學習，拜師是個人成長髮展的必然階段，泥潭提供了30餘個門派供\n"
"大家選擇，每個門派均有其特色，玩家可以選擇自己喜歡的門派發展。當然，國有國法，家有家\n"
"規，既然你選擇了一個門派就好好地在此發展吧，如果你想要判師，那麼……，後果非常嚴重，\n"
"你將終身被本門派的高手追殺，一旦被殺，你所有的特殊武功將被廢掉，更嚴重的是，即使你躲\n"
"過了本門高手的追殺，要想在江湖中容身也是非常困難的，很多門派不收判師的人，所以，你得\n"
"考慮清楚，以免後悔莫及。\n\n"
"    好了，該説説如何拜師了，首先，到你想去的門派，一開始你得從入門弟子做起，一般拜一\n"
"些武功比較低微的人物為師，就拿華山派來説，你進入華山派，首先得拜勞德諾為師，拜師的指\n"
"令是 bai <師傅ID>，等你武功等級和門派貢獻提高後可以繼續向上拜，比如你拜華山掌門嶽不羣\n"
"為師，這時你就可以學到更高級的武功技能了，如紫霞神功等，你可以用指令 cha <師傅ID>來查\n"
"看你師傅會哪些武功，使用指令 xue <師傅ID> <武功ID> <學習次數> 來學習武功。\n\n" NOR;

        if( !query("newbie_quest_completed/baishi", me) )
        {
                msg += HIM "    現在，你將接受一個練習，你到練武場去找一個叫武伯的人，然後拜他為師後再回來\n"; 
                msg +=     "找我 " HIY "ask lao about ok" HIM " 。\n\n" NOR;
                set("newbie_quest/leixing", "baishi", me);
                set("newbie_quest/quest_name", "如何拜師", me);
                set("newbie_quest/tar_id", "wuqingzi", me);
                set("newbie_quest/point", 15, me);
                set("newbie_quest/msg", HIY"你先去拜武伯為師，然後在來找我。\n"NOR, me);
                me->save();
        } // endif
        } else
        if (topic == "111") // 戰鬥系統介紹
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關戰鬥系統的信息吧：\n"
"-----------------------------------------------------\n" HIM +
"    所謂學以致用，學習了各種武功就是要在戰鬥中能派上用場。本遊戲的戰鬥系統是自動戰鬥\n"
"類型的，也就是説一旦你和對方開始戰鬥，則你所扮演的角色將自動發招，直到戰鬥結束為止。\n"
"當然，你在戰鬥過程中可以靈活地控制你的角色，如施展絕招，恢復氣血，運功等，從而達到克\n"
"敵制勝的效果。\n\n"
"    影響你戰鬥能力的有諸多因素，如你的臂力、武器攻擊力、武功強弱等會影響你的攻擊能力；\n"
"身法，輕功效果等會影響你的閃避和命中能力；防具等又會影響你的防護能力。如果要查看你的\n"
"戰鬥能力，你可以輸入指令 stats/ability 來查看。不要一味地追求某一方面的強度， 綜合全\n"
"面的發展才是最重要的，在泥潭裏沒有最強，只有更強！\n\n" NOR;
        }  else
        if (topic == "112") // 戰鬥前的準備
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關戰鬥前的準備的信息吧：\n"
"-------------------------------------------------------\n" HIM +
"    首先，你得確保你要準備好在戰鬥中使用什麼武功，假設你要使用兵器武功，如你已經學會\n"
"了華山劍法和獨孤九劍，那麼戰鬥中你只能在同一時間使用一種武功，這裏我們要做的就是確定\n"
"你要使用何種劍法，在泥潭裏，選擇戰鬥中使用的武功叫“激發”，比如我們將獨孤九劍激發到\n"
"基本劍法上，然後只要裝備一把劍就可以在戰鬥中施展獨孤九劍了，指令格式為：\n\n" HIY
"    jifa sword <武功ID>，如 jifa sword lonely-sword，就是激發獨孤九劍為基本劍法。\n\n" HIM
"    如果你要換使用華山劍法則只需輸入 jifa sword huashan-sword 即可。\n\n" HIC
"    這時，你要問，我同樣也激發了空手武功，那麼該如何才能施展呢？\n\n" NOR
"    很簡單，只要你取下兵器，你所施展的武功自然就是空手武功了，但是空手武功跟兵器類武\n"
"功稍稍有點不同，試想，雖然空手武功也需要激發，但是，由於空手武功包含了：拳腳、掌法、\n"
"指法、爪法等，這些在戰鬥中同一時間內只能施展一種，那麼如何來確定我們施展何種空手技能\n"
"呢，這時，我們就需要通過“準備”來實現這個功能，即當手中無兵器時，用何種空手技能戰鬥。\n"
"指令如下：\n\n" HIY
"    首先，拿九陰白骨爪來説，其武功類型為空手爪法，我們先把它激發為基本爪法：\n\n"
"    jifa claw jiuyin-baiguzhao 然後，準備空手技能施展爪法，指令為：\n\n"
"    bei claw，這樣就完成了空手技能的準備。現在，裝上你心愛的兵器，出去闖蕩江湖吧！！！\n\n" NOR;

        if( !query("newbie_quest_completed/jifa", me) )
        {
                msg += HIM "    現在，你將接受一個練習，先找老村長學會「基本劍法」和「天劍」，然後將天劍\n";                              
                msg +=     "激發為基本劍法後再來找我 " HIY "ask lao about ok" HIM " 。\n\n" NOR;
                set("newbie_quest/leixing", "jifa", me);
                set("newbie_quest/quest_name", "如何激發武功", me);
                set("newbie_quest/tar_id", "tianjian", me);
                set("newbie_quest/point", 20, me);
                set("newbie_quest/msg", HIY"你先去把天劍激發為基本劍法，然後在來找我（ask lao about ok）。\n"NOR, me);
                me->save();
        } // endif
        }  else
        if (topic == "113") // 戰鬥指令介紹
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關戰鬥指令的信息吧：\n"
"-----------------------------------------------------\n" HIM +
"    在泥潭裏戰鬥功能是相當豐富的，現在大概介紹一些常用的功能及指令用法：\n\n" HIG
"    kill <對象ID>      :       殺人，一旦下達此指令後，雙方將盡全力撕殺。\n"
"    hit <對象ID>       :       打人，通常此指令通常用於將對手打暈為止。\n"
"    fight <對象ID>     :       切磋，同對手切磋武藝，此戰鬥方式一般不會有什麼危險。\n"
"    jiali <數值>       :       這個表示你設置用多少內力來傷敵，通常設置為max。\n"
"    halt               :       停止戰鬥，在下達kill指令後無法停止。\n"
"    perform <絕招ID>   :       施展絕招。\n"
"    yun <內功ID>       :       運功，如yun powerup可提高戰鬥力。詳細地可參見幫助文件 help force。\n\n" HIM
"    以上都是戰鬥中最常用的指令，要想了解更多的請參見泥潭幫助文件庫，輸入指令 help 。\n\n";

         }  else
        if (topic == "114") // 如何施展內功
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關如何施展內功的信息吧：\n"
"-------------------------------------------------\n" HIM +
"    首先，你得將一種特殊內功，如北冥神功激發到你的基本內功上，再確保你有足夠的內力。\n"
"    施展內功的指令是 yun <內功ID>，如下所示：\n\n" HIY
"普通功能\n\n" HIC
"regenerate     提振精神          recover     調勻氣息\n"
"lifeheal       為人療傷          heal        運功療傷\n"
"dispel         療解毒素          inspire     激勵精神\n\n" HIY
"特殊功能\n\n" HIC
"roar           內勁傷敵          shot        彈射毒藥\n"
"powerup        提升戰力          shield      護體真氣\n\n" HIM
"    如要調勻氣息，則輸入 yun recover 即可。\n\n" NOR;
        } else
        if (topic == "115") // 如何施展外功
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關如何施展外功的信息吧：\n"
"------------------------------------------------------\n" HIM +
"    外功，用通俗一點的説法就是你武功的絕招，比如獨孤九劍有一招叫「破劍式」，要施\n"
"展該招則輸入指令 perform po 即可。施展外功的命令格式為：\n\n" HIY
"    perform 絕招ID\n\n" NOR;

        if( !query("newbie_quest_completed/perform", me) )
        {
                msg += HIM "    現在，你將接受一個練習，到竹林使用天劍的絕招（perform lian）殺一隻\n" NOR;
                msg += HIM "野兔（指令為 kill ye tu），然後再來找我 " HIY "ask lao about ok" HIM " 。\n\n" NOR;
                set("newbie_quest/leixing", "perform", me);
                set("newbie_quest/quest_name", "如何施展外功", me);
                set("newbie_quest/tar_id", "tianjian", me);
                set("newbie_quest/point", 30, me);
                me->set("newbie_quest/msg",HIY"你先用天劍的絕招（perform lian）到竹林殺（kill ye tu）一隻野兔，然後\n"
                                                "再來找我（ask lao about ok）。\n" NOR);
                me->save();
        } // endif
        }    else
        if (topic == "121") // 查看幫助文件庫
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關查看幫助文件庫的信息吧：\n"
"--------------------------------------------------------\n" HIM +
"    泥潭幫助文件庫中有豐富的有關這個遊戲的各種幫助信息，幾乎所有的信息都可以在裏面\n"
"查閲到，輸入指令 help 可打開幫助信息庫，然後輸入 help <信息代碼>  可查看到具體需要\n"
"查看的信息，如需要查看華山派介紹則輸入 help huashan 即可。\n\n" NOR;
        }  else
        if (topic == "122") // 玩家間的交流
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關如何玩家間的交流的信息吧：\n"
"-----------------------------------------------------------\n" HIM +
"    在泥潭裏，交流是必不可少的學習途徑，也是獲得幫助最重要的方法之一，記住，多和\n"
"有經驗的朋友交流，少走彎路，可以使你更快地成長。本站提供了豐富的交流指令，可以參\n"
"見幫助文件 help channels。\n\n"
"    雖然在線交流非常重要，但是離線交流也很重要，你可以使用 msg send <玩家ID>  指\n"
"令發送一個短信息給對方，不管對方是否在線都會收到，交流在泥潭裏就是如此的簡單。\n\n" NOR;
        }  else
        if (topic == "123") // 請求新手導師幫助
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關請求新手導師幫助的信息吧：\n"
"----------------------------------------------------------\n" HIM +
"    新手導師是本站為引導新人入門而聘請的有經驗的玩家擔當的，如果你有什麼問題可以\n"
"找新手導師，和他們交談或是發送短信息給他們都行。輸入指令 who -v 可查看在線的導師。\n\n" NOR;
        }  else
        if (topic == "124") // 廣播你的求教信息
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關廣播你的求教信息的信息吧：\n"
"-------------------------------------------------------------\n" HIM +
"    除了與導師在線交流及短消息溝通外，一些問題你需要徵求所有導師的意見以及本站管\n"
"理巫師的意見，你可以使用 teach help 指令發佈你的求教信息。\n\n" NOR;
        }  else
        if (topic == "125") // 在泥潭信息庫中搜索你指定的信息
        {
                msg = HIW + "\n"
"老村長對你説道：那就讓我來告訴你有關在泥潭信息庫中搜索你指定的信息的信息吧：\n"
"---------------------------------------------------------------------------\n" HIM +
"    雖然泥潭的幫助庫文件內容非常豐富，但是也帶來另外一個問題，如何快速地查找到你\n"
"需要的信息呢？我們為方便大家查找各種信息，提供了一個 grep 指令，比如你要在幫助庫\n"
"中查找有關 太極拳 的信息，你可以輸入 grep help 太極拳 ，這時，系統會將幫助文件庫\n"
"中所有有關太極拳的幫助文件名羅列出來，供你進一步參考。\n\n" NOR;
        }
        else
        {
                msg = HIY "你問的問題我好像並沒聽説過，請輸入指令 " HIM "ask lao about here" HIY " 查看我知道的問題。\n" NOR;
        }

        tell_object(me, msg);
        return 1;
}

// 進行幫助
/*
        n_quest = ([
             "leixing"      :   "wield",
             "quest_name"   :   "裝備兵器"
             "target_id"    :   "tie jian",
             "target_name"  :   "鐵劍",
             "target_place" :   "兵器室",
             "point"        :   10, // 獎勵點數
             "msg"          :   "到兵器室去拿一把劍，裝備（wield tie jian）後再來找我（ask lao about ok）。\n"
        ]);
*/
mixed ask_here()
{
        object me;
        mixed n_quest;
        string msg;

        me = this_player();

        n_quest=query("newbie_quest", me);

        // 檢查是否是任務狀態
        if (mapp(n_quest))
        {
             tell_object(me, HIR "老村長對你説道：" + n_quest["msg"] + "\n如果已經完成請輸入ask lao about ok" NOR);
             return 1;
        }

        msg =  HIM "你可以在我這裏瞭解以下信息：\n" NOR;
        msg += HIY "編號         信    息\n" NOR;
        msg += HIY "------------------------------------------\n" NOR;
        msg += HIC " 1        什麼是文字MUD遊戲\n"
                   " 2        簡單介紹一下這個遊戲的玩法\n"
                   " 3        我在遊戲裏能做些什麼\n"
                   " 4        我自己是誰\n"
                   " 5        我在哪裏\n"
                   " 6        如何移動\n"
                   " 7        如何跟其他朋友交流\n"
                   " 8        我可以扮演哪些角色\n"
                   " 9        如何生存\n"
                   "10        如何練功和使用兵器\n"
                   "11        如何戰鬥\n"
                   "12        如何得到更多幫助\n"
                   "13        如何離開這裏到外面的世界去\n" NOR;
        msg += HIY "------------------------------------------\n" NOR;
        msg += HIR "要了解的信息可以輸入指令 ask lao about <編號>\n" NOR;
        msg += HIR "如要了解 <如何移動> 的信息，則輸入 ask lao about 6\n\n" NOR;
        msg += HIY "如果你是位老玩家，你也可以直接ask lao about 出村，去闖蕩江湖，當然這樣的話你可能會錯失了某種機緣。\n" NOR;

        tell_object(me, msg);

        return 1;
}

mixed ask_chucun()
{
        object me;
        string msg;

        me = this_player();

        // 判斷幾個條件
        //1、是否學會了移動
        /*
        if( !query("newbie_quest_completed/move", me) )
        {
                tell_object(me, "老村長告訴你：你還沒有學會如何移動呢！請 ask lao about 61\n");
                return 1;
        }        

        // 2、是否學會裝備兵器
        if( !query("newbie_quest_completed/move", me) )
        {
                tell_object(me, "老村長告訴你：你還沒學會如何裝備兵器呢！請 ask lao about 106\n");
                return 1;
        }

        //3、是否掌握如何拜師
        if( !query("newbie_quest_completed/baishi", me) )
        {
                tell_object(me, "老村長告訴你：你還沒掌握如何拜師呢！請 ask lao about 107\n");
                return 1;
        }

        //4、是否掌握如何激發武功
        if( !query("newbie_quest_completed/jifa", me) )
        {
                tell_object(me, "伯告訴你：你還沒學會如何激發武功呢！請 ask lao about 112\n");
                return 1;
        }

        //5、是否掌握如何施展外功
        if( !query("newbie_quest_completed/perform", me) )
        {
                tell_object(me, "老村長告訴你：你還沒掌握如何施展外功呢！請 ask lao about 115\n");
                return 1;
        }
        */

        set("newbie_quest_completed/can_out", 1, me);

        
        msg = HIY "不錯，不錯，看來你已經決定出去闖蕩江湖了！在你臨走前，我將送你一件\n"
                  "禮物，你先把你的眼睛閉上（指令 closeeye ）吧。\n\n" NOR;

        if( !query("gift_xinshoucun", me)) tell_object(me,msg);

        else
                tell_object(me, HIY "不錯，不錯，看來你已經可以出去闖蕩江湖了！\n\n" NOR);

        return 1;        
}

void init()
{
        object me;

        me = this_player();

        call_out("do_hello", 5, me);

        add_action("do_closeeye", "closeeye");

        return;
        
}

void do_hello(object me)
{
        if (! objectp(me))return;

        if (environment(me) != environment(this_object()))return;
                
        tell_object(me, HIG "\n老村長對你説道：這位" + RANK_D->query_respect(me) +
                "，如果需要幫助請輸入指令 " HIR "ask lao about here \n\n" NOR);
}

int do_closeeye(string arg)
{
        object me;
        string msg;
        int point, myexp;
        string mapsk;
        int exp, pot, score;
        
        int can_exp = 1;

        me = this_player();

        if( !query("newbie_quest_completed/can_out", me) )
                return 0;

        myexp=query("combat_exp", me);

        if (myexp >= 3500)can_exp = 0;

        if( query("gift_xinshoucun", me) )
                return notify_fail(HIG "\n老村長説到：咦，你怎麼……又來了！？\n" NOR);

        set("gift_xinshoucun", 1, me);

        msg = HIM "你閉上雙目，只感覺有一隻熾熱的手按在你天靈蓋上，一股暖暖的真氣緩緩流入你的體內。\n"
                  "你凝神閉氣，將真氣慢慢吸收，感覺全身舒暢之極！\n\n" NOR;

        tell_object(me, msg);

        mapsk = me->query_skill_mapped("force");
        //if (me->can_improve_skill("force")) 
               me->improve_skill("force", 1500000); 
        if (stringp(mapsk) && me->can_improve_skill(mapsk)) 
               me->improve_skill(mapsk, 1500000);

        mapsk = me->query_skill_mapped("sword");
        //if (me->can_improve_skill("sword")) 
               me->improve_skill("sword", 1500000); 
        if (stringp(mapsk) && me->can_improve_skill(mapsk)) 
               me->improve_skill(mapsk, 1500000);

        mapsk = me->query_skill_mapped("parry");
        //if (me->can_improve_skill("parry")) 
               me->improve_skill("parry", 1500000); 
        if (stringp(mapsk) && me->can_improve_skill(mapsk)) 
               me->improve_skill(mapsk, 1500000);

        mapsk = me->query_skill_mapped("dodge");
        //if (me->can_improve_skill("dodge")) 
               me->improve_skill("dodge", 1500000); 
        if (stringp(mapsk) && me->can_improve_skill(mapsk)) 
               me->improve_skill(mapsk, 1500000);

        mapsk = me->query_skill_mapped("blade");
        //if (me->can_improve_skill("blade")) 
               me->improve_skill("blade", 1500000); 
        if (stringp(mapsk) && me->can_improve_skill(mapsk)) 
               me->improve_skill(mapsk, 1500000);        

        mapsk = me->query_skill_mapped("unarmed");
        //if (me->can_improve_skill("unarmed")) 
               me->improve_skill("unarmed", 1500000); 
        if (stringp(mapsk) && me->can_improve_skill(mapsk)) 
               me->improve_skill(mapsk, 1500000);        
               
        point = 3500 - myexp;
        if (point <= 0)point = 400 + random(400);
        exp = can_exp * point / 2 + can_exp * random(point / 2);
        pot = point / 3 + random(point / 2);
        score = 120 + random(100);

        addn("combat_exp", exp, me);
        addn("potential", pot, me);
        addn("max_neili", 200, me);
        addn("max_jingli", 200, me);
        addn("max_jing", 200, me);
        addn("max_qi", 300, me);
        addn("score", score, me);

        msg  = HIY "\n你得到了" + chinese_number(exp) + "點實戰經驗、" + chinese_number(pot) + "點潛能，" + 
                   chinese_number(score) + "點江湖閲歷，並且\n你的內力修為、氣血、精力都有了提高！\n\n" NOR;

        me->save();

        msg+= HIG "老村長説道：你現在到村口找花伯（指令 ask lao about 出村）吧，他會告訴你怎麼出古村！\n";
        msg+= HIC "老村長囑咐道：以後行走江湖你就得多加小心了！切記，凡事需忍讓，不可與人多起爭端！\n\n" NOR;
        
        tell_object(me, msg);

        return 1;
}
