// Room: /d/songshan/chaotian.c
// Last Modified by Winder on Jul. 15 2001

inherit ROOM;

void create()
{
        set("short", "朝天門");
        set("long", @LONG
陡見雙峰中斷，天然出現一個門戶，疾風從斷絕處吹出，雲霧隨風
撲面而至，這裡就是朝天門了。天門望去，便見箕山。路人到此，感受
山風送爽，亦不讓“箕陰避暑”(jing)之處了。
LONG );
        set("item_desc", ([
                "jing" : "
    箕山背險坡上，樹林茂密，林蔭濃厚。龍潭泉處，山凋深長。兩崖
石壁如劍，石洞陰潤整潔，芳草苔蔓如毯，溪水淙淙似琴。炎夏仲秋之
時，此處環境幽雅，景色秀美，空氣濕潤，閔爽無比。因而，人們常常
雲集于此覺勝避暑。箕山之陰的山間崖壁上，摩刻有許多遊人題記，如
“幽谷”、“潛龍潭”、“溪溪凋冷”、“箕陰避暑處”等。字大如鬥，
惹人注目。相傳上古時代，高士許由不受堯讓帝位，隱居于此。許由、
巢父在箕山隱居，勞累之余，便來箕陰乘涼避暑。
    西漢元封元年，武帝遊歷中岳，獵于箕山，正是炎夏酷暑季節，天
當午時，武帝收弓，汗流浹背，揮之不盡。來到箕陰避暑勝地，坐息片
刻，即有暑收入秋之感。武帝不禁哈哈大笑，顧從曰：“涯暑收矣！”。
古往今來，每到暑夏，常有遊人到此消夏避暑，故稱“箕陰避暑勝地”。
    時付梅《箕陰避暑》詩日：
                  獨愛雲林境界幽，綠蔭蔽日翠光浮。
                  棄標崖畔排煩熱，洗耳溪邊枕細流。
                  每有涼風來樹底，更無塵事到心頭。
                  許由巢父今何在，千古箕山五月秋。
",
        ]));
        set("exits", ([
                "northup"   : __DIR__"shandao6",
                "southdown" : __DIR__"shandao5",
        ]));
        set("objects", ([
                __DIR__"npc/wan": 1,
        ]));
        set("outdoors", "songshan");
        set("no_clean_up", 0);
        set("coor/x", -20);
        set("coor/y", 830);
        set("coor/z", 60);
        setup();
        replace_program(ROOM);
}