string *surname = ({
"趙","錢","孫","李","周","吳","鄭","王","宋","盧","公孫","關","林","呼延",
"楊","馬","牛","呂","親","花","柴","朱","魯","武","張","董","徐","索","戴",
"史","劉","穆","雷","阮","燕","解","黃","單","韓","郝","彭","魏","齊","蕭",
"歐陽","鄧","凌","安","郭","蔣","薛","高","鮑","孔","金","項","童","孟",
"侯","陳","樑","鄭","龔","陶","範","包","樊","石","時","段","左","辛","於",
"餘","尉遲","曹","姬","崔","賈","顧","杜","毛","何","費","施","潘","嚴",
"喻","方","顏","唐","廉","單","霍",
});
string *manname1 = ({
"盡忠","報國","金剛","霸天","天趣","天賜","先務","對口","鐵嘴","四海",
"阿四","棄耕","福祿","兒郎","二愣","八郎","九郎","十郎","十一郎","狗兒",
"阿牛","富貴","百萬","生菜","鐵牛","金彩","萬福","萬貴","常貴","根福",
"明","貴","虎","豹","慶","順","雲","飛","堅","獅","龍","寶生","得子",
"金貴","萬年","大年","勝","橫","平","弘","天洪","保生",
});
string *nickname1 =({
"長白","太行","中條","西山","飛鳳","白虎","青龍","河洛","黃河","長江",
"華山","武當","惡","大力","柔情","別離良","殺人","伏牛","崆峒","揚州一",
"京城一","傷心","相見","屠龍","霸王","温柔","憐香","惜玉","碎玉","多情",
"燕子","舞柳","隨風","八仙","八卦","落英","伏虎","絕殺","不空回","天馬行空",
"有來無回","詩意","殺人如麻",
});
string *nickname2 =({
"刀","劍","槍","戟","錘","斧","鞭",
});

string comm_man_name()
{
        return surname[ random ( sizeof ( surname ) ) ] +
        manname1[ random ( sizeof(manname1 ) ) ];
}

string comm_man_nick()
{
        return nickname1[ random( sizeof( nickname1 ) ) ] +
        nickname2[ random (sizeof ( nickname2 ) ) ];
}

