#include <ansi.h>
inherit ITEM;
void create()
{
        set_name(YEL "手信" NOR, ({"letter"}));
        set("long",@LONG
這是一張已經發黃的草紙，上面寫道...
給我的後人：
    看完這封信，不要震驚哦，我花了畢生的精力，但是，很遺憾，
我沒有留下太多的東西給你們了。現在，我把我的經歷告訴你們，希
望我的後人能有機會揭開這個多年的迷團。
    某日，我雲遊到一個地方，也不記得是什麼地方了，當時很混亂
，只見一羣武林中人在那廝殺了幾百回合，真是天昏地暗，日月無光
我躲在一旁看了很久，就在這時，有個人被一掌打下了懸崖，我想，
那人也凶多吉少了，但我突然就心生憐憫，決定下崖去救他，就是這
個怪異的想法，奠定了我一生的遺憾。
    我費盡心思，終於下到崖底，見那人還在，只是躺在地上，看來
身受重傷，已經奄奄一息了，我想把他揹回家去，但發現已經沒有回
去的退路了，好在出門時帶備了乾糧和一些在荒野採摘的草藥，就在
那地方留了下來，待到那人恢復元氣，我們才商量怎樣離開這裏，後
來，先是那人在崖底發現了一個洞口，然後我們就走了進去，那裏面
似乎是個迷宮，但根本畫不出地圖來，每次我們走出了迷宮，就開始
畫地圖，但畫了上百幅，但一幅也沒用，就這樣，我推算，在迷宮裏
我們也呆了有半月左右，在往裏走，真是處處機關，冒了幾次的生命
危險，終於給我們發現了一個巨大的地下宮殿，聽那人説，這裏是什
麼秦什麼的陵墓，唉，管他呢，我可沒學什麼文化，我只知道那裏到
處是金銀財寶，享不盡用不完的寶藏。
    但我沒能帶出來呀，好幾次都是那人相救，才得這條狗命回來呀
，那人似乎發現了他更感興趣的東西，他告訴我，那裏存放了世間所
有的武林絕學，但他未能參透其中的奧妙，就留在那裏的，我們找到
了回來的出口，但......
(下面已經看不清楚了，也許是年代太久遠了的緣故。)
LONG
);
        set("unit", "張");
        set("weight", 10);
}
