#include <ansi.h> 
inherit ROOM;

void create()
{
        set("short", HIY "秦陵內宮" NOR);
        set("long", @LONG
發現自己站在長長的白玉石階之底，石階直通向上方那六丈來高、十裡
來寬的巨大平台。仰頭望去，廣闊的黑色頂穹綴滿了千萬顆寶石、明珠，
光彩奪目，璀璨似星河，浩瀚如夜空，將四周照得一片皎皎明亮。在那
瑰麗的頂穹下方，赫然竟是一座拔地而起、連天入穹的雄偉宮城。那巍
峨壯麗的城樓殿宇，鉤心鬥角的流檐飛瓦，綿延雄矗于白玉石台上，如
泰山壓頂，竟比長安城樓還要氣勢磅礡、雄奇瑰麗！石階兩邊的廣場上，
密密麻麻竟全是列成方陣的兵俑。銅人、陶俑、石雕……交相陳雜，少
說也有幾萬之眾，軍姿雄壯，威風凜凜。廣場上，一條條銀帶蜿蜒交錯，
閃耀著炫目的光澤，就像是江河匯集，一齊朝東面一個白光閃閃的水池
流去。
LONG);
        
        set("maze", 1);
        set("no_magic", 1);
        set("virtual_room", 1);
        set("no_clean_up", 1);       
        set("objects",([
                "/maze/mausoleum/npc/goldman": 1,  
        ]));
        setup();
}
