// 本文件被兩個文件調用
// 分別是同目錄的  obj_copy.h
// 以及上級目錄的 幻境結束遊戲時的統計成績 的房間文件


/******************************************************************************
 價格定製經嚴格測試，請勿隨意更改； 及，各物品之效能等亦有關聯，亦勿隨意更改。
各物品價格如下：

<奇特>類

定向水晶 10  飛翔之石 20  脱離水晶 50  迴歸之鏡 10
祈禱之石 50  召喚之盒 20  發呆之旗 50  驅逐之旗 88
尋人水晶 10  窺探水晶 10  定位之儀 30

<果品類>

無名果 1  仙人果 5  淘氣果 3  毒龍果 5  野生果實 1
試煉之果 30

<兵器類>

青銅之劍 10  靈氣之劍 20  白銀之劍 15  盈動之劍 20
黃金之劍 20  耐力之劍 30  迅隱之劍 50  奪魂之劍 30  必勝之劍 50
狂風水晶 20  暴雨水晶 20  落雷水晶 20  引電水晶 20
滾石水晶 10  飛火水晶 10  奪魂水晶 30

<神祕>類

呼風之石 20  喚雨之石 20  落雷之石 20  引電之石 20
滾石之石 10  飛火之石 10  奪魂之石 30  復活之石 50

********************************************************************************/

mapping all_values=([
"dx":10,"fx":20,"tl":50,"hg":10,
"qd":50,"zh":20,"fd":50,"qz":88,
"xr":10,"kt":10,"dw":30,

"wmg":1,"xrg":5,"tqg":3,"dlg":5,"ysg":1,
"slg":30,

"qtj":10,"lqj":20,"byj":15,"ydj":20,
"hjj":20,"nlj":30,"xyj":50,"dhj":30,"bsj":50,
"kfsj":20,"bysj":20,"llsj":20,"ydsj":20,
"gssj":10,"fhsj":10,"dhsj":30,

"hfzs":20,"hyzs":20,"llzs":20,"ydzs":20,
"gszs":10,"fhs":10,"dhzs":30,"fhzs":50

    ]);

