// Room: /d/yueyang/yueyanglou2.c
// Last Modifyed by Winder on Dec. 4 2001

inherit ROOM;

void create()
{
        set("short", "岳陽樓二樓");
        set("long", @LONG
岳陽樓二樓內嵌有一幅《岳陽樓記》(ji)雕屏，此雕屏為清代大書
法家張照所寫，字形方正，筆力雄渾技術法多變，獅人匠心、為傳世極
品。
    岳陽地方山重水闊，文淵靈毓，竟成了貶官們的鐘愛之地。上自屈
原，涉足岳陽的各朝名家大都仕途坎坷，累有貶跡。無論去國懷鄉，憂
饞畏譏也好；心曠神怡，寵辱皆忘也好，只要貶官們踏上岳陽這塊土地，
總是文思泉湧，佳作迭出。
LONG );
        set("no_clean_up", 0);
        set("exits", ([
                "up"   : __DIR__"yueyanglou3",
                "down" : __DIR__"yueyanglou1",
        ]));
        set("item_desc", ([
                "ji" : "
                    岳陽樓記
                    　　　　　　　　　范仲淹
　
　　慶歷四年春，滕子京謫守巴陵郡。越明年，政通人和，百廢俱興，
乃重修岳陽樓，增其舊制，刻唐賢今人之詩賦于其上，屬予作文以記之。

　　予觀夫巴陵勝狀，在洞庭一湖。銜遠山，吞長江，浩浩盪盪，橫無
際涯，朝暉夕陰，氣象萬千。此則岳陽樓之大觀也，前人之述備矣。然
則北通巫峽，南極瀟湘，遷客騷人，多會于此。覽物之情，得無異乎？

　　若夫霪雨霏霏，連月不開；陰風怒號，濁浪排空；日星隱曜，山岳
潛形；商旅不行，檣傾楫摧；薄暮冥冥，虎嘯猿啼；登斯樓也，則有去
國懷鄉，憂讒畏譏，滿目蕭然，感極而悲者矣。

　　至若春和景明，波瀾不驚；上下天光，一碧萬頃；沙鷗翔集，錦麟
遊泳；岸芷汀蘭，鬱鬱青青。而或長煙一空，皓月千裡；浮光耀金，靜
影沉璧；漁歌互答，此樂何極。登斯樓也，則有心曠神怡，寵辱皆忘，
把酒臨風，其喜洋洋者矣。

　　嗟夫！予嘗求古仁人之心，或異二者之為何哉？不以物喜，不以己
悲。居廟堂之高，則憂其民；處江湖之遠，則憂其君。是進亦憂，退亦
憂，然則何時而樂耶？其必曰：先天下之憂而憂，天下之樂而樂歟。噫，
微斯人，吾誰與歸。\n"
        ]));
	set("coor/x", -6240);
	set("coor/y", -3000);
	set("coor/z", 30);
	setup();
        replace_program(ROOM);
}