#include <ansi.h>
inherit ITEM;

void create()
{
        set_name(HIC "「扇賞」" NOR, ({ "shanshang book", "shanshang", "book" }));
        set_weight(200);
        if (clonep())
                set_default_object(__FILE__);
        else {
                set("unit", "本");
                set("long", HIC "這是一本介紹扇的小冊，沒事可以"
                            "看看(read)。\n" NOR);
                set("value", 50);
                set("material", "paper");
        }
        setup();
}

void init()
{
        add_action("do_read", "read");

}

int do_read(string arg)
{
        if (arg == "shanshang book"
           || arg == "shanshang"
           || arg == "book")
                return notify_fail(HIC "\n"
"----------------------------------------------------------\n\n"
NOR + WHT "                         羽毛扇\n\n"
"  羽扇始於周昭王時，有盂夏取鵲翅為扇之説，則羽毛扇已經有\n"
"  着三千年的歷史了。羽毛扇製作的主要原料是大型禽鳥的羽毛。\n\n"
"                         團  扇\n\n"
"  絹宮扇又叫紈扇、團扇、羅扇，它出現於羽扇之後、摺扇以前。\n"
"  西漢成帝的妃嬪班婕妤寫過一首有名的團扇歌：「新制齊紈素\n"
"  皎潔如霜雪。裁為合歡扇，團團似明月。出入君懷袖，動搖微\n"
"  風發。常恐秋節至，涼飆奪炎熱。棄捐篋笥中，恩情中道絕。」\n\n"
"                         折  扇\n\n"
"  摺扇收折自如，扇形小巧玲瓏，攜帶方便，是為很普通的扇品。\n\n"
"                         玉版扇\n\n"
"  浙之括蒼山多巨竹，有圍至二尺外者。碧湖之民能夠截而剖之\n"
"  取其裏。闊五六寸、長尺許，熨之使平，其形上寬下稍殺，用\n"
"  紅木或明角、玳瑁，雕刻為柄，色白潤如玉，因題為‘玉版扇。\n\n"
"                         檀香扇\n\n"
"  檀香扇乃是取檀木製成，扇又輕又小，芳香四溢，是蘇州名產。\n\n"
"                         綢舞扇\n\n"
"  綢舞扇多為舞蹈用扇，有半綢全綢之分，扇骨以竹為主，也有\n"
"  用檀香木或牛骨的。扇面採用各式絲綢，印上或繪上花草圖案，\n"
"  有的還加上閃光鋁片，舞動時絢麗多彩金光熠熠。\n\n"
"                         芭蕉扇\n\n"
"  芭蕉扇，又叫蒲扇、葵扇、蒲葵扇。採下陰乾，以重物鎮之使\n"
"  平，剪成圓形，削細篾絲，雜錦線緣其邊，即仍其柄以為柄是\n"
"  為粗者。有截其柄以名竹、文木、洋漆、象牙、玳瑁為之，飾\n"
"  以翠蝶銀花，緣以錦邊，是為細者。扇輕便風大且價格低廉。\n\n"
HIC "----------------------------------------------------------\n"
"\n\n" NOR);
}