#include <ansi.h>

string *action_msg = ({
        "葵花太監低頭沉思了一會，突然驚訝的説：“",
        "葵花太監跺了跺腳：“",
        "葵花太監悠悠的説：“",        
        "葵花太監翻出一本冊子：“",
        "葵花太監懶懶的伸了一下腰：“",
        "葵花太監目光盯向遙遠的遠方，若有所思的説：“",
        "葵花太監冷冷一笑：“",
        "葵花太監咬着牙惡狠狠的説：“",
        "葵花太監隨意看看了四周，對你説：“",
        "葵花太監皺着眉頭慢慢説：“",
        "葵花太監一字一字的説：“",
        "葵花太監頭也不抬，隨口説道：“",
        "葵花太監看了你一眼，冷笑着説：“",
        "葵花太監怒氣衝衝的説：“",
        "葵花太監憂心忡忡的説：“",
        "葵花太監按着指關節，狠狠的説：“",
});

string *say_msg = ({
        "我怎麼還沒有name呢？你幫我type它一個來。”",
        "你跟着我也有一陣了，難道還不知道我現在需要什麼？name！快去給我type來！”",
        "東西嘛，我基本都有了，不過name還沒有，你能去type來麼？”",
        "聽説有一樣東西叫name，你去給我type來看看！”",
        "人人都説name這個東西最近很緊缺，你快去給我type來備用！”",
        "name是不是很難找？怎麼我最近老見不到，你去type一個來給我看看！”",
        "大內李總管最近需要name，你趕快去type來給我。”",
        "我本來不想要name，可是小皇帝卻想看看這樣東西，這個任務就交給你了。”",
        "稀奇的東西看多了，我想看看name，能type來吧？”",
        "如果連你都type不回來name，看來下次只有我親自出馬了，別讓我失望！”",
        "金山銀山再多，缺了name也不行，快去type吧。”",
        "不怕缺金少銀，就怕沒有name，你明白我的意思了？”",
        "劉娘娘也真是貴人多事，什麼不好要，偏偏要name，你就去type一個來吧。”",
        "天下大部分東西我都有了，不過少了一樣name，快去快回，type來了有賞！”",
        "name！我現在急需！快去type，type不到不要回來見我！”",
        "name這個東西很好玩麼？怎麼人人都想要？我倒是想看看！”",
        "怎麼人人都不喜歡name，我覺得挺好的啊，你去type來給我，有賞！”",
});

string *kill_msg = ({
        "name這個人不聽從我的號令，你去type了吧，利索點！”",
        "我很想念name吶，好久不見了，不知道是否還健在，你把頭給我弄來看看血色如何就成！”",
        "聽説name現在又長胖了，眼睛都眯成一條縫了，把頭給我弄來看看。”",
        "人人都説name是個高手，我想也不見得就是，你能殺掉他吧？”",
        "name的骨頭硬麼？不知道是不是比刀硬，你去砍砍他得脖子看能不能砍斷！”",
        "不見得人人都不怕死，像name這樣的人是很少得，不過他還是得死！”",
        "name竟然説我不是男人，這種人還能活在世上麼？”",
        "我聽説有人在散佈不利於我的留言，name嫌疑最大，寧可錯殺一千，不可放過一個！”",
        "有些人活着還不如死了的好，比如name，就是一個光吃飯不幹活的飯桶！”",
        "朝廷最近忙着清查叛賊，name這個人平時就不老實，該收拾他了！”",
        "聽説name平時最吝嗇，其實東西放我這裏最安全，我就幫name保管一下頭顱吧！”",
        "該死去的人，永遠也不該活下去，name就不該活下去，明白我的意思吧？”",
        "現在江湖宵小越來越多，不把name這樣的人殺幾個，震不住別人！”",
});


string query_khmsg(string type,string name)
{
        string msg,msg1;
        msg = "";
        msg1 = "";
        msg += action_msg[random(sizeof(action_msg))];
        if (type == "尋") {
                msg1 = say_msg[random(sizeof(say_msg))];
                msg1 = replace_string(msg1,"name"," " + name + " ");
                msg1 = replace_string(msg1,"type","找");
        } else
        {
                msg1 = kill_msg[random(sizeof(kill_msg))];
                msg1 = replace_string(msg1,"name"," " + name + " ");
                msg1 = replace_string(msg1,"type","殺");
        }
        msg += msg1;
        return msg;
}
