mapping *allqiuqian = ({
([
        "id":1,
        "title"        :"姜公封相",
        "doc"        :"靈 籤 求 得 第 一 枝 , 龍 虎 風 雲 際 會 時\n一 旦 凌 霄 揚 自 樂 , 任 君 來 往 赴 瑤 池",
        "type"        :"上上籤",
        "love_fate"        :"愛 情 生 活 幸 福 ， 適 婚 人 士 要 把 握 時 機 。" 
]),
([
        "id":2,
        "title"        :"誤入桃源",
        "doc"        :"桃 源 競 鬥 千 紅 紫 , 一 葉 漁 舟 誤 入 津\n枯 木 逢 春 盡 發 新 , 花 香 葉 茂 蝶 來 頻",  
        "type"        :"上吉籤",
        "love_fate"        :"未 婚 者 可 望 遇 到 心 上 人 ， 已 婚 者 亦 生 活 和 諧 ， 但 要 防 婚 外 情 。" 
]),
([
        "id":3,
        "title"        :"魯班開山",
        "doc"        :"牛 山 之 木 皆 常 美 , 獨 惜 斧 工 盡 伐 他\n大 器 大 材 無 足 用 , 規 矩 不 準 怎 為 槎",
        "type"        :"中平籤",
        "love_fate"        :"不 宜 嫁 娶。" 
]),
([
        "id":4,
        "title"        :"董永遇仙",
        "doc"        :"調 雛 紫 燕 在 檐 前 , 對 語 呢 喃 近 午 天\n或 往 或 來 低 復 起 , 有 時 剪 破 綠 楊 煙",
        "type"        :"中吉籤",
        "love_fate"        :"愛 情 尚 算 如 意 ， 婚 姻 亦 美 滿 。" 
]),
([
        "id":5,
        "title"        :"韓氏惜花",
        "doc"        :"東 園 昨 夜 狂 風 急 , 萬 紫 千 紅 亦 盡 傾\n幸 有 惜 花 人 早 起 , 培 回 根 本 復 栽 生",
        "type"        :"中吉籤",
        "love_fate"        :"愛 情 尚 算 如 意 ， 婚 姻 亦 美 滿 。" 
]),
([
        "id":6,
        "title"        :"遊滕王閣",
        "doc"        :"一 片 孤 帆 萬 裏 回 , 管 弦 嘔 啞 且 停 杯\n如 雲 勝 友 談 風 月 , 暢 敍 幽 情 極 樂 哉",
        "type"        :"上吉籤",
        "love_fate"        :"夫 妻 恩 愛 ， 未 婚 者 年 底 有 機 會 遇 上 意 中 人 。" 
]),
([
        "id":7,
        "title"        :"仁貴歸家",
        "doc"        :"秋 來 徵 雁 向 南 歸 , 紅 葉 紛 紛 滿 院 飛\n碪 搗 城 頭 聲 切 耳 , 江 楓 如 火 在 漁 磯",
        "type"        :"中吉籤",
        "love_fate"        :"夫 妻 間 會 有 衝 撞 ， 未 婚 者 不 易 在 今 年 結 婚  。" 
]),
([
        "id":8,
        "title"        :"崔子弒君",
        "doc"        :"鳴 鳩 爭 奪 鵲 巢 居 , 賓 主 參 差 意 不 舒\n滿 嶺 喬 鬆 蘿 蔦 附 , 且 猜 詩 語 是 何 如",
        "type"        :"下下籤",
        "love_fate"        :"婚 姻 與 愛 情 皆 受 盡 考 驗 ， 還 要 提 防 第 三 者 出 現 。" 
]),
([
        "id":9,
        "title"        :"陶潛賞菊",
        "doc"        :"瑤 琴 一 曲 奏 新 腔 , 明 月 清 風 枕 簟 涼\n鹹 集 嘉 賓 同 賞 菊 , 或 歌 或 舞 或 飛 觴",
        "type"        :"上吉籤",
        "love_fate"        :"有 情 人 終 成 眷 屬 ； 已 婚 者 夫 唱 婦 隨 。" 
]),
([
        "id":10,
        "title"        :"蘇秦不笫",
        "doc"        :"一 輪 月 鏡 掛 空 中 , 偶 被 浮 雲 障 灄 重\n玉 匣 何 時 光 氣 吐 , 誰 人 借 我 一 狂 風",
        "type"        :"中平籤",
        "love_fate"        :"夫 妻 會 有 小 磨 擦 ， 萬 事 要 以 和 為 貴 ； 有 情 人 今 年 則 不 宜 結 婚 。" 
]),
([
        "id":11,
        "title"        :"漢帝賞柳",
        "doc"        :"楊 柳 垂 堤 鎖 綠 煙 , 日 長 三 起 又 三 眠\n往 來 紫 燕 紛 飛 舞 , 嬝 娜 迎 風 倩 我 憐",
        "type"        :"上吉籤",
        "love_fate"        :"夫 妻 感 情 和 洽 ， 未 婚 者 則 宜 今 年 多 加 留 心 意 中 人 的 出 現 。" 
]),
([
        "id":12,
        "title"        :"太白撈月",
        "doc"        :"蜃 樓 海 市 幻 無 邊 , 萬 丈 擎 空 接 上 天\n或 被 狂 風 忽 吹 散 , 有 時 仍 聚 結 青 煙",
        "type"        :"下下籤",
        "love_fate"        :"夫 妻 間 會 經 常 發 生 磨 擦 ， 最 緊 要 互 相 信 任 。" 
]),
([
        "id":13,
        "title"        :"踏雪尋梅",
        "doc"        :"嶺 南 初 放 一 枝 梅 , 片 片 晶 瑩 入 酒 杯\n卻 遇 騎 驢 人 早 至 , 兒 童 背 負 佔 春 魁",
        "type"        :"中平籤",
        "love_fate"        :"可 能 有 第 三 者 介 入 ， 因 此 要 留 心 小 人 ； 未 婚 者 宜 於 秋 冬 結 婚 。" 
]),
([
        "id":14,
        "title"        :"陶潛醉酒",
        "doc"        :"為 愛 幽 閒 多 種 竹 , 買 春 賞 雨 在 茅 屋\n醉 時 卧 倒 杏 花 邊 , 怕 聽 鶯 兒 驚 夢 熟",
        "type"        :"中吉籤",
        "love_fate"        :"不 論 夫 妻 或 情 侶 ， 總 會 有 一 些 小 磨 擦 ， 但 無 礙 於 雙 方 感 情 。" 
]),
([
        "id":15,
        "title"        :"明皇遊月",
        "doc"        :"仙 槎 一 葉 泛 中 流 , 月 殿 蟾 宮 任 爾 遊\n盈 耳 霓 裳 聲 漸 歇 , 酒 詩 吟 飲 幾 時 休",
        "type"        :"上吉籤",
        "love_fate"        :"夫 妻 生 活 協 調 ， 可 望 得 到 昇 華 ； 情 侶 是 時 間 拉 埋 天 窗 ， 尤 其 在 秋 季 以 後 。" 
]),
([
        "id":16,
        "title"        :"皇叔遇賢",
        "doc"        :"天 邊 鴉 背 夕 陽 回 , 隴 外 兒 童 跨 犢 來\n羌 笛 頻 吹 聲 切 耳 , 短 長 腔 調 樂 何 哉",
        "type"        :"中吉籤",
        "love_fate"        :"夫 婦 間 只 要 隨 遇 而 安 ， 便 能 恩 愛 和 洽 ； 未 婚 情 侶 則 不 宜 太 早 結 婚 。" 
]),
([
        "id":17,
        "title"        :"月下追賢",
        "doc"        :"秋 水 蒹 葭 白 露 盈 , 盈 庭 月 色 浸 階 清\n清 風 吹 動 馬 鈴 響 , 響 接 晨 鍾 不 斷 聲",
        "type"        :"中吉籤",
        "love_fate"        :"可 能 因 第 三 者 之 出 現 而 生 醋 意 ， 切 記 彼 此 要 信 任 。" 
]),
([
        "id":18,
        "title"        :"杜鵑啼血",
        "doc"        :"杜 鵑 啼 血 淚 悲 聲 , 聲 怨 霜 寒 夢 乍 驚\n驚 動 異 鄉 為 異 客 , 客 心 更 觸 故 園 情",
        "type"        :"下下籤",
        "love_fate"        :"夫 妻 間 經 常 發 生 磨 擦 ， 爭 吵 越 頻 密 ， 惡 運 更 會 接 踵 而 來 ； 因 此 最 緊 要 忍 。" 
]),
([
        "id":19,
        "title"        :"伏羲畫卦",
        "doc"        :"乾 卦 三 連 號 太 陽 , 潛 龍 勿 用 第 一 章\n其 中 爻 象 能 參 透 , 百 福 駢 臻 大 吉 昌",
        "type"        :"中吉籤",
        "love_fate"        :"只 要 檢 點 個 人 言 行 ， 就 能 和 諧 共 處 。" 
]),
([
        "id":20,
        "title"        :"雪梅招親",
        "doc"        :"天 上 仙 花 難 問 種 , 人 間 塵 事 幾 多 更\n前 程 已 註 公 私 簿 , 罰 賞 分 明 濁 與 清",
        "type"        :"中平籤",
        "love_fate"        :"姻 緣 早 由 天 注 定 ， 只 要 大 家 以 禮 相 待 ， 定 能 融 洽 共 處 。" 
]),
([
        "id":21,
        "title"        :"則天賞花",
        "doc"        :"天 外 紅 霞 如 抹 錦 , 檻 邊 桃 杏 鬥 新 裝\n盈 眸 煙 熳 誰 居 首 , 美 酒 頻 斟 且 酌 量",
        "type"        :"中吉籤",
        "love_fate"        :"宜 趁 春 天 訂 婚 ， 明 年 初 冬 共 諧 連 理 。" 
]),
([
        "id":22,
        "title"        :"陳妙思春",
        "doc"        :"秋 水 依 人 各 一 方 , 天 南 地 北 恨 偏 長\n相 思 試 問 憑 誰 寄 , 不 盡 悽 涼 狂 斷 腸",
        "type"        :"下下籤",
        "love_fate"        :"與 情 人 有 分 手 的 危 機 ， 不 宜 嫁 娶 。" 
]),
([
        "id":23,
        "title"        :"盧 生 夢",
        "doc"        :"邯 鄲 一 夢 幻 無 邊 , 數 載 身 榮 是 熟 眠\n換 卻 錦 衣 歸 故 裏 , 睡 醒 還 記 在 心 田",
        "type"        :"中平籤",
        "love_fate"        :"他 ∕ 她 對 你 若 即 若 離 ， 端 端 的 也 會 無 緣 無 故 分 手 。" 
]),
([
        "id":24,
        "title"        :"居易歎情",
        "doc"        :"詩 酒 琴 棋 可 解 愁 , 座 中 無 客 樂 難 休\n或 彈 或 唱 誰 知 美 , 冷 飲 雖 多 亦 是 憂",
        "type"        :"下下籤",
        "love_fate"        :"你 的 陰 晴 不 定 ， 很 難 吸 引 異 性 。" 
]),
([
        "id":25,
        "title"        :"洪武登基",
        "doc"        :" 羣 山 擾 擾 朝 中 嶽 , 有 似 為 臣 列 鵠 班\n拱 立 兩 行 齊 整 肅 , 自 居 此 地 豈 無 歡",
        "type"        :"上吉籤",
        "love_fate"        :"夫 妻 和 睦 ， 生 育 大 計 可 實 現 。" 
]),
([
        "id":26,
        "title"        :"徐庶歸國",
        "doc"        :"花 影 遲 遲 侵 砌 上 , 遙 知 月 鏡 掛 長 空\n忽 聞 鶴 淚 聲 悽 切 , 早 買 歸 舟 返 裏 中",
        "type"        :"中平籤",
        "love_fate"        :"談 婚 論 嫁 盡 量 留 待 明 年 。" 
]),
([
        "id":27,
        "title"        :"越王復國",
        "doc"        :"天 晴 粉 蜨 翻 衣 曬 , 又 看 庭 前 蟻 陣 掛\n隊 伍 整 齊 趨 或 退 , 時 開 時 合 思 何 隹",
        "type"        :"中平籤",
        "love_fate"        :"千 挑 萬 選 ， 還 是 平 易 近 人 的 對 象 最 適 合 你 。" 
]),
([
        "id":28,
        "title"        :"江上琵琶",
        "doc"        :"船 泊 潯 陽 月 夜 天 , 琵 琶 一 曲 動 人 憐\n相 思 兩 地 憑 誰 寄 , 白 雪 摧 人 上 鬢 巔",
        "type"        :"中平籤",
        "love_fate"        :"其 貌 不 揚 的 人 ， 會 是 對 你 關 懷 備 至 的 伴 侶。" 
]),
([
        "id":29,
        "title"        :"張翰思鱸",
        "doc"        :" 鱸 魚 作 膾 菊 花 黃 , 美 酒 盈 樽 迎 晚 涼\n泛 棹 正 當 潮 上 候 , 這 般 佳 景 樂 無 央",
        "type"        :"中吉籤",
        "love_fate"        :"愛 情 突 飛 猛 進 。" 
]),
([
        "id":30,
        "title"        :"貴妃自縊",
        "doc"        :"傾 國 傾 城 媚 百 生 , 六 宮 粉 黛 盡 無 名\n馬 嵬 山 下 魂 飛 去 , 至 令 明 皇 長 恨 情",
        "type"        :"下下籤",
        "love_fate"        :"愛 情 要 受 過 考 驗 才 會 開 花 結 果 。" 
]),
([
        "id":31,
        "title"        :"中興遇險",
        "doc"        :"狂 風 驟 雨 打 船 篷 , 溪 泮 桃 花 盡 落 紅\n驚 醒 漁 翁 春 夢 熟 , 持 篙 撐 去 失 西 東",
        "type"        :"下下籤",
        "love_fate"        :"感 情 進 退 兩 難 。" 
]),
([
        "id":32,
        "title"        :"蘇武牧羊",
        "doc"        :"十 九 年 前 海 上 辛 , 節 旄 彫 敗 逐 沙 塵\n餐 毛 嚼 雪 誰 憐 我 , 惟 有 羊 兒 作 伴 羣",
        "type"        :"中平籤",
        "love_fate"        :"是 愛 情 備 受 考 驗 的 一 年 。 婚 事 過 了 這 個 冬 天 再 説 。" 
]),
([
        "id":33,
        "title"        :"孔明識曹",
        "doc"        :"曹 操 雖 有 深 謀 計 , 智 慧 難 瞞 諸 葛 候\n試 看 東 風 都 可 借 , 更 能 流 馬 木 成 牛",
        "type"        :"中平籤",
        "love_fate"        :"婚 事 最 好 延 遲 到 明 年 。" 
]),
([
        "id":34,
        "title"        :"大舜耕山",
        "doc"        :"大 舜 雖 耕 在 歷 山 , 心 常 孝 順 兩 囂 頑\n田 中 之 象 同 家 象 , 善 惡 分 明 即 此 間",
        "type"        :"中吉籤",
        "love_fate"        :"和 對 象 情 投 意 合 ， 宜 婚 嫁 。" 
]),
([
        "id":35,
        "title"        :"三藏取經",
        "doc"        :"天 將 降 任 此 其 人 , 筋 骨 先 勞 苦 彼 身\n莫 謂 隹 景 來 可 易 , 貧 窮 富 貴 有 前 因",
        "type"        :"中吉籤",
        "love_fate"        :"秋 後 可 能 締 結 好 姻 緣 。" 
]),
([
        "id":36,
        "title"        :"平貴回窯",
        "doc"        :"此 事 真 如 到 岸 船 , 何 憂 風 水 不 相 全\n舉 頭 便 見 前 村 落 , 屋 角 斜 陽 爨 已 煙",
        "type"        :"中吉籤",
        "love_fate"        :"擇 偶 不 應 計 較 其 家 勢 。" 
]),
([
        "id":37,
        "title"        :"暢遊赤壁",
        "doc"        :"月 夜 秋 江 下 釣 鰲 , 魚 形 恰 似 四 腮 鱸\n家 藏 舊 釀 堪 盈 鬥 , 與 友 飛 觴 盡 倒 壺",
        "type"        :"上吉籤",
        "love_fate"        :"秋 天 是 花 月 佳 期 。" 
]),
([
        "id":38,
        "title"        :"陱潛辭官",
        "doc"        :"歸 去 來 兮 仕 官 閒 , 室 堪 容 膝 亦 為 安\n南 窗 寄 傲 談 詩 酒 , 倚 杖 徘 徊 飽 看 山",
        "type"        :"中吉籤",
        "love_fate"        :"愛 情 順 其 自 然 ， 急 不 來 。" 
]),
([
        "id":39,
        "title"        :"夷齊讓國",
        "doc"        :"夷 齊 不 忍 食 周 粟 , 兄 弟 心 甘 採 蕨 餐\n讓 國 名 應 垂 萬 古 , 可 憐 餓 倒 首 陽 山",
        "type"        :"中吉籤",
        "love_fate"        :"今 年 最 好 打 消 結 婚 念 頭 。" 
]),
([
        "id":40,
        "title"        :"伯牙碎琴",
        "doc"        :"人 世 知 音 能 有 幾 , 碎 琴 都 為 子 期 忘\n墳 前 灑 盡 千 行 淚 , 隔 別 陰 陽 各 一 方",
        "type"        :"下下籤",
        "love_fate"        :"戀 愛 變 幻 無 常 ， 結 婚 還 是 太 早 。" 
]),
([
        "id":41,
        "title"        :"張騫獲寶",
        "doc"        :"浮 槎 月 夜 到 天 河 , 曾 見 天 姬 織 錦 梭\n石 得 支 機 人 罕 識 , 那 知 此 寶 出 雲 窩",
        "type"        :"中吉籤",
        "love_fate"        :"美 滿 姻 緣 垂 手 可 得 。" 
]),
([
        "id":42,
        "title"        :"計獻貂嬋",
        "doc"        :"月 明 散 步 到 花 欄 , 無 策 焉 能 勦 滅 奸\n幸 有 貂 嬋 思 定 國 , 英 雄 難 過 美 人 關",
        "type"        :"中吉籤",
        "love_fate"        :"「 男 追 女 隔 重 山 ， 女 追 男 隔 張 紙 」 是 今 年 寫 照 。" 
]),
([
        "id":43,
        "title"        :"韓公被貶",
        "doc"        :" 祗 因 直 諫 怒 天 顏 , 晝 夜 難 離 在 馬 鞍\n主 僕 奔 忙 神 亦 倦 , 更 加 雪 重 擁 藍 關",
        "type"        :"下下籤",
        "love_fate"        :"感 情 發 展 迂 回 。" 
]),
([
        "id":44,
        "title"        :"天寶評花",
        "doc"        :"滿 園 春 色 鬥 新 年 , 意 似 爭 姘 奪 國 香\n到 底 是 誰 居 麗 首 , 牡 丹 豔 冠 百 花 場",
        "type"        :"中吉籤",
        "love_fate"        :"愛 情 開 花 結 果 ， 成 就 一 段 好 姻 緣 。" 
]),
([
        "id":45,
        "title"        :"王質遇仙",
        "doc"        :"採 樵 不 意 到 雲 天 , 閒 看 敲 棋 二 老 仙\n柯 爛 方 思 歸 故 裏 , 山 中 七 日 世 千 年",
        "type"        :"中平籤",
        "love_fate"        :"沐 浴 在 愛 河 中 ， 不 知 時 光 流 逝 。" 
]),
([
        "id":46,
        "title"        :"左慈戲曹",
        "doc"        :"黃 金 數 盒 獻 曹 公 , 剖 看 原 來 肉 盡 空\n怒 動 奸 雄 揮 鐵 斧 , 奔 忙 身 入 萬 羊 中",
        "type"        :"下下籤",
        "love_fate"        :"戀 愛 變 幻 無 常 ， 結 婚 還 是 太 早 。" 
]),
([
        "id":47,
        "title"        :"魯肅索荊",
        "doc"        :"遙 遙 千 裏 來 西 蜀 , 欲 問 荊 州 那 日 還\n劉 備 不 言 聲 淚 下 , 自 思 無 策 轉 吳 間",
        "type"        :"下下籤",
        "love_fate"        :"常 有 小 爭 執 ， 伴 侶 可 能 失 信 於 你 。" 
]),
([
        "id":48,
        "title"        :"文君賣酒",
        "doc"        :"繡 閣 聽 琴 自 起 思 , 改 粧 夤 夜 最 歡 時\n可 憐 沽 酒 臨 邛 市 , 才 子 隹 人 兩 下 廚",
        "type"        :"中平籤",
        "love_fate"        :"美 滿 良 緣 就 在 眼 前 。" 
]),
([
        "id":49,
        "title"        :"相如題橋",
        "doc"        :"十 年 窗 下 苦 功 成 , 有 志 難 舒 願 不 輕\n試 看 題 橋 十 三 字 , 生 平 心 誓 碓 鍾 情",
        "type"        :"中吉籤",
        "love_fate"        :"找 到 志 同 道 合 的 對 象 ， 應 主 動 向 對 方 求 婚 。" 
]),
([
        "id":50,
        "title"        :"伍員出關",
        "doc"        :"記 得 當 年 伍 子 胥 , 潛 奔 難 渡 幸 逢 漁\n欲 將 寶 劍 相 持 贈 , 大 義 交 朋 卻 不 辭",
        "type"        :"中吉籤",
        "love_fate"        :"若 遇 上 投 緣 的 人 ， 便 拿 出 誠 意 。" 
]),
([
        "id":51,
        "title"        :"成王封弟",
        "doc"        :"剪 桐 雖 是 作 兒 嬉 , 封 弟 成 圭 語 不 移\n何 以 偽 為 成 實 事 , 言 因 無 戲 故 如 斯",
        "type"        :"中平籤",
        "love_fate"        :"情 人 可 能 愛 耍 小 性 子 ， 大 家 互 相 忍 讓 。" 
]),
([
        "id":52,
        "title"        :"盤古開天",
        "doc"        :"上 清 下 濁 成 天 地 , 清 濁 相 凝 便 作 人\n爾 欲 籤 求 明 白 事 , 且 將 三 等 細 分 明",
        "type"        :"中平籤",
        "love_fate"        :"約 會 談 情 無 妨 ， 訂 婚 、 結 婚 未 免 太 早 。" 
]),
([
        "id":53,
        "title"        :"煖客孟嘗",
        "doc"        :"珠 履 三 千 客 孟 嘗 , 誰 人 識 得 有 鷹 揚\n其 中 彈 鋏 歸 來 者 , 便 是 英 雄 志 莫 當",
        "type"        :"中吉籤",
        "love_fate"        :"婚 期 在 望 ， 秋 後 更 宜 嫁 娶 。" 
]),
([
        "id":54,
        "title"        :"莊周夢蝶",
        "doc"        :"莊 子 酣 眠 成 □ 夢 , 翩 翻 飛 入 百 花 叢\n天 香 採 得 歸 來 後 , 猶 在 高 牀 暖 枕 中",
        "type"        :"中平籤",
        "love_fate"        :"有 桃 花 運 ， 但 婚 期 猶 未 在 望 。" 
]),
([
        "id":55,
        "title"        :"隱之投扇",
        "doc"        :"浦 號 沈 香 遺 舊 恨 , 渡 江 猶 憶 古 人 心\n可 憐 當 日 辭 官 去 , 雖 有 馨 留 不 易 尋",
        "type"        :"中平籤",
        "love_fate"        :"緣 份 未 臨 ， 難 以 碰 到 愜 意 的 對 象 ， 遇 上 也 難 有 結 果 。" 
]),
([
        "id":56,
        "title"        :"呂祖飛劍",
        "doc"        :"安 知 此 劍 不 成 龍 , 見 水 都 應 出 袖 中\n他 日 飛 騰 千 萬 裏 , 上 空 妖 嬌 有 雲 從",
        "type"        :"中吉籤",
        "love_fate"        :"以 誠 相 待 ， 雙 方 感 情 踏 入 成 熟 的 階 段 ， 婚 期 將 近 。" 
]),
([
        "id":57,
        "title"        :"獨佔花魁",
        "doc"        :"小 樓 春 雨 聲 初 歇 , 彳 亍 街 頭 履 不 停\n忽 聽 賣 花 人 入 巷 , 一 枝 買 得 慢 慢 行",
        "type"        :"中吉籤",
        "love_fate"        :"邂 逅 意 中 人 ， 不 妨 主 動 進 求 ， 但 不 可 急 進 。" 
]),
([
        "id":58,
        "title"        :"蹇叔哭師",
        "doc"        :"秦 師 大 敗 在 餚 山 , 三 帥 皆 擒 盡 放 還\n蹇 叔 諫 言 因 不 聽 , 倒 戈 舍 甲 返 秦 間",
        "type"        :"下下籤",
        "love_fate"        :"小 病 容 易 變 大 病 ， 需 及 早 治 病 。" 
]),
([
        "id":59,
        "title"        :"西施澣紗",
        "doc"        :"涴 溪 紗 女 美 無 雙 , 媚 至 吳 王 國 破 亡\n最 惱 東 施 效 顰 笑 , 山 雞 豈 可 勝 鸞 凰",
        "type"        :"下下籤",
        "love_fate"        :"有 磨 擦 ， 愛 情 基 礎 不 穩 。" 
]),
([
        "id":60,
        "title"        :"醉辭和番",
        "doc"        :"和 番 醉 筆 似 雲 煙 , 日 在 長 安 酒 店 眠\n倘 遇 唐 皇 頒 令 召 , 重 呼 不 上 木 蘭 船",
        "type"        :"中平籤",
        "love_fate"        :"多 次 示 愛 ， 不 代 表 真 誠 ， 仍 需 考 驗 。" 
]),
([
        "id":61,
        "title"        :"金牌招將",
        "doc"        :" 十 二 金 牌 速 召 回 , 奸 雄 設 計 幾 時 灰\n可 憐 一 旦 功 勞 散 , 老 少 扶 車 不 斷 哀",
        "type"        :"下下籤",
        "love_fate"        :"愛 情 生 隙 嫌 ， 可 能 有 第 三 者 。" 
]),
([
        "id":62,
        "title"        :"孔子守道",
        "doc"        :"美 玉 於 斯 韞 匱 藏 , 休 求 善 價 費 商 量\n沽 之 亦 可 隨 相 待 , 此 物 何 需 自 看 常",
        "type"        :"中平籤",
        "love_fate"        :"感 情 更 進 一 步 ， 結 婚 還 未 是 時 候 。" 
]),
([
        "id":63,
        "title"        :"樂道安貧",
        "doc"        :"陋 巷 簞 瓢 不 足 愁 , 旁 人 見 此 甚 為 憂\n不 知 樂 道 忘 貧 乏 , 亞 聖 芳 名 萬 古 留",
        "type"        :"中吉籤",
        "love_fate"        :"有 情 人 終 成 眷 屬 ， 且 是 一 個 欣 賞 你 的 人 。" 
]),
([
        "id":64,
        "title"        :"之反殿師",
        "doc"        :"奔 殿 須 知 上 古 人 , 入 門 策 馬 不 誇 能\n敗 師 誰 肯 甘 從 後 , 託 謂 嗚 聰 畏 苦 辛",
        "type"        :"中吉籤",
        "love_fate"        :"愛 情 路 不 平 坦 ， 爭 吵 常 有 。" 
]),
([
        "id":65,
        "title"        :"井底藏妃",
        "doc"        :"隋 滅 陳 時 戟 伐 紛 , 都 因 妖 媚 閉 明 君\n東 奔 西 赴 無 藏 息 , 胭 脂 井 裏 隱 玉 人",
        "type"        :"下下籤",
        "love_fate"        :"異 性 朋 友 殷 勤 招 待 最 要 小 心 。" 
]),
([
        "id":66,
        "title"        :"羲之會賢",
        "doc"        :"蘭 亭 雅 會 眾 羣 賢 , 曲 水 流 觴 舍 箸 弦\n天 朗 氣 清 風 惠 暢 , 茂 林 修 竹 樂 怡 然",
        "type"        :"上吉籤",
        "love_fate"        :"終 身 對 像 出 現 ， 將 是 一 個 善 心 人 。" 
]),
([
        "id":67,
        "title"        :"四面楚歌",
        "doc"        :"人 雖 勇 力 不 能 當 , 莫 恃 英 雄 獨 冠 場\n可 挾 泰 山 超 北 海 , 身 心 猶 貴 重 存 亡",
        "type"        :"中平籤",
        "love_fate"        :"情 海 起 波 濤 ， 為 衝 動 而 結 婚 會 後 悔 。" 
]),
([
        "id":68,
        "title"        :"子牙得志",
        "doc"        :"久 抱 凌 雲 志 未 舒 , 荷 竿 渭 水 釣 遊 魚\n文 王 千 裏 求 賢 士 , 滅 紂 興 周 任 意 如",
        "type"        :"中吉籤",
        "love_fate"        :"情 比 金 堅 ， 結 婚 是 最 佳 選 擇 。" 
]),
([
        "id":69,
        "title"        :"韓愈祭魚",
        "doc"        :"忠 義 存 心 官 十 載 , 年 豐 民 槳 惠 難 忘\n鱷 魚 毒 害 都 能 息 , 禱 告 長 江 北 海 王",
        "type"        :"中吉籤",
        "love_fate"        :"誠 意 能 打 動 對 方 的 心 靈 ， 結 婚 是 時 候 了 。" 
]),
([
        "id":70,
        "title"        :"塞翁失馬",
        "doc"        :"可 比 當 年 一 塞 翁 , 雖 然 失 馬 半 途 中\n不 知 禍 福 真 何 事 , 到 底 方 明 事 始 終",
        "type"        :"中平籤",
        "love_fate"        :"姻 緣 由 天 定 ， 不 能 強 求 ， 得 可 能 是 失 ， 不 宜 結 婚 。" 
]),
([
        "id":71,
        "title"        :"莊周活鮒",
        "doc"        :"涸 轍 之 中 鮒 困 之 , 窮 通 自 可 卜 當 時\n若 能 引 得 西 江 水 , 他 日 成 龍 也 未 知",
        "type"        :"中下籤",
        "love_fate"        :"婚 姻 只 會 加 添 煩 惱 。" 
]),
([
        "id":72,
        "title"        :"守株待兔",
        "doc"        :"兔 兒 久 待 意 如 何 , 堪 歎 愚 人 獨 守 株\n算 是 無 能 令 我 笑 , 不 須 守 舊 自 拘 拘",
        "type"        :"中平籤",
        "love_fate"        :"情 仍 無 歸 處 ， 但 對 身 邊 的 異 性 積 極 點 ， 會 有 利 將 來 的 發 展 。" 
]),
([
        "id":73,
        "title"        :"孫霖及第",
        "doc"        :"夾 道 花 香 襯 馬 蹄 , 藍 袍 改 換 錦 衣 歸\n滿 街 紅 粉 皆 爭 羨 , 翹 首 芳 名 雁 塔 題",
        "type"        :"上上籤",
        "love_fate"        :"你 選 擇 有 很 多 ， 挑 一 個 合 心 意 的 ， 可 以 完 成 人 生 大 事 。" 
]),
([
        "id":74,
        "title"        :"覆水難收",
        "doc"        :"回 憶 當 年 運 蹇 時 , 夫 妻 反 目 兩 分 離\n名 題 雁 塔 歸 來 後 , 覆 水 馬 頭 時 否 悲",
        "type"        :"下下籤",
        "love_fate"        :"愛 情 不 是 一 條 平 坦 路 ， 感 情 有 危 機 。" 
]),
([
        "id":75,
        "title"        :"文敍戲妻",
        "doc"        :"婚 姻 豈 可 厭 家 貧 , 文 敍 夫 妻 兩 拆 分\n一 旦 首 登 龍 虎 榜 , 戲 妻 樓 墜 自 身 亡",
        "type"        :"下下籤",
        "love_fate"        :"愛 情 不 能 以 金 錢 衡 量 ， 別 以 金 錢 擇 偶 。" 
]),
([
        "id":76,
        "title"        :"顏回守困",
        "doc"        :"人 能 樂 道 自 修 身 , 疏 水 曲 肱 豈 厭 貧\n不 義 而 富 且 貴 者 , 我 心 都 作 是 浮 雲",
        "type"        :"中平籤",
        "love_fate"        :"誠 意 是 需 要 考 驗 ， 還 未 是 結 婚 時 。" 
]),
([
        "id":77,
        "title"        :"公冶入獄",
        "doc"        :"鳥 語 能 通 公 冶 長 , 南 山 有 個 虎 馱 羊\n其 身 雖 在 於 縲 □ , 到 底 非 關 自 己 殃",
        "type"        :"中平籤",
        "love_fate"        :"與 家 人 作 好 心 理 的 準 備 ， 家 中 滯 運 ， 要 攜 手 應 付 困 難 。" 
]),
([
        "id":78,
        "title"        :"曾點論志",
        "doc"        :"瑟 希 鏗 爾 尚 留 聲 , 春 暮 時 剛 春 服 成\n冠 五 六 人 童 六 七 , 無 雩 歸 詠 暢 幽 情",
        "type"        :"上吉籤",
        "love_fate"        :"開 朗 樂 觀 的 人 是 最 適 合 你 對 象 。" 
]),
([
        "id":79,
        "title"        :"鍾馗得道",
        "doc"        :"富 貴 有 如 春 夢 熟 , 世 人 何 苦 力 爭 求\n任 他 秉 笏 當 朝 立 , 到 死 惟 留 土 一 杯",
        "type"        :"中平籤",
        "love_fate"        :"面 前 的 只 是 短 暫 的 情 緣 ， 不 要 要 求 太 高 。" 
]),
([
        "id":80,
        "title"        :"樂廣釋疑",
        "doc"        :"飛 觴 對 舞 幾 時 賒 , 弓 影 橫 杯 誤 作 蛇\n猜 透 詩 中 元 妙 訣 , 泰 來 否 極 事 無 差",
        "type"        :"中吉籤",
        "love_fate"        :"第 三 者 來 在 兩 人 之 間 ， 消 失 之 後 ， 便 是 嫁 娶 時 。" 
]),
([
        "id":81,
        "title"        :"子路拱雉",
        "doc"        :"山 樑 雌 雉 得 其 時 , 上 下 飛 嗚 自 樂 之\n色 舉 須 知 翔 後 集 , 作 聲 三 嗅 過 山 欹",
        "type"        :"中吉籤",
        "love_fate"        :"愛 侶 的 諾 言 能 否 實 現 ， 還 有 待 時 間 考 驗 ， 不 能 輕 信 。" 
]),
([
        "id":82,
        "title"        :"孔子擊磬",
        "doc"        :"聖 人 擊 磬 在 於 衞 , 誰 料 過 門 有 荷 簣\n嗟 歎 有 心 挽 道 窮 , 可 憐 日 月 今 將 逝",
        "type"        :"中平籤",
        "love_fate"        :"情 路 崎 嶇 ， 容 易 分 手 。" 
]),
([
        "id":83,
        "title"        :"範丹問卜",
        "doc"        :"凡 塵 身 歷 幾 時 閒 , 世 事 渾 如 疊 疊 山\n既 富 尚 憂 無 貴 子 , 不 知 花 放 又 花 殘",
        "type"        :"中平籤",
        "love_fate"        :"外 表 不 是 重 要 ， 選 擇 對 象 要 重 視 內 心 。" 
]),
([
        "id":84,
        "title"        :"韓信歸漢",
        "doc"        :"滿 腹 奇 才 志 未 衝 , 鐵 雞 難 舉 意 無 容\n張 良 指 示 身 投 漢 , 項 羽 烏 江 命 自 窮",
        "type"        :"中吉籤",
        "love_fate"        :"不 用 吹 噓 自 己 的 能 力 ， 對 方 已 漸 漸 欣 賞 你 。" 
]),
([
        "id":85,
        "title"        :"劉向淂志",
        "doc"        :"太 乙 燃 藜 照 讀 書 , 十 年 窗 下 苦 功 舒\n揚 眉 吐 氣 袍 穿 錦 , 駟 馬 高 車 擁 道 隨",
        "type"        :"上吉籤",
        "love_fate"        :"今 年 內 結 婚 產 子 最 佳 ， 能 有 助 運 勢 。" 
]),
([
        "id":86,
        "title"        :"侃母迎賓",
        "doc"        :"截 發 迎 賓 否 也 貧 , 貧 中 賢 婦 更 何 人\n古 今 只 有 陶 侃 母 , 所 以 名 留 萬 代 聞",
        "type"        :"上吉籤",
        "love_fate"        :"權 貴 可 近 ， 婚 姻 自 然 會 美 滿 。" 
]),
([
        "id":87,
        "title"        :"士 龍 會 客",
        "doc"        :"會 談 華 座 逞 英 雄 , 究 竟 誰 人 秉 大 公\n一 雲 日 下 荀 嗚 鶴 , 一 説 雲 間 陸 士 龍",
        "type"        :"中平籤",
        "love_fate"        :"好 姻 緣 要 靠 互 相 遷 就 。" 
]),
([
        "id":88,
        "title"        :"木蘭從軍",
        "doc"        :"替 父 從 軍 膽 氣 雄 , 須 眉 巾 幗 幾 人 同\n以 身 報 國 忠 而 孝 , 笑 煞 當 時 眾 鉅 公",
        "type"        :"中吉籤",
        "love_fate"        :"秋 季 之 後 良 緣 將 至 。" 
]),
([
        "id":89,
        "title"        :"季子掛劍",
        "doc"        :"他 鄉 遠 歷 佩 魚 腸 , 誰 料 徐 君 意 欲 將\n既 返 願 為 相 贈 答 , 且 懸 樹 下 表 情 長",
        "type"        :"下下籤",
        "love_fate"        :"感 情 有 裂 縫 ， 要 盡 快 補 救 。" 
]),
([
        "id":90,
        "title"        :"紅拂私奔",
        "doc"        :"細 整 殘 □ 夜 欲 奔 , 座 中 李 靖 更 何 人\n那 知 虯 髯 情 鍾 處 , 拔 劍 三 回 未 敢 陳",
        "type"        :"中平籤",
        "love_fate"        :"第 三 者 出 現 了 ， 而 且 會 是 一 個 勁 敵 。" 
]),
([
        "id":91,
        "title"        :"月中仙子",
        "doc"        :"蟾 宮 月 殿 桂 飄 香 , 玉 篋 團 圓 萬 裏 光\n六 水 三 山 歸 鏡 裡 , 無 瑕 一 片 掛 窮 蒼",
        "type"        :"上上籤",
        "love_fate"        :"女 方 感 情 上 較 男 方 順 利 ， 而 且 秋 後 最 適 宜 結 婚 。" 
]),
([
        "id":92,
        "title"        :"孔子聞樂",
        "doc"        :"至 聖 周 遊 列 國 行 , 在 齊 得 聽 奏 韶 樂\n三 月 不 知 嘉 肉 味 , 善 哉 大 道 可 功 成",
        "type"        :"中吉籤",
        "love_fate"        :"經 過 多 年 來 的 了 解 ， 現 在 是 時 間 撮 合 一 起 。" 
]),
([
        "id":93,
        "title"        :"孔子聞衞樂",
        "doc"        :"鄭 衞 之 音 不 忍 聽 , 淫 風 敗 俗 國 將 傾\n令 人 深 入 迷 津 路 , 所 奏 全 非 古 樂 聲",
        "type"        :"下下籤",
        "love_fate"        :"記 緊 戴 眼 識 人 ， 尤 其 選 擇 對 象 ， 以 勤 奮 善 良 者 最 佳 。" 
]),
([
        "id":94,
        "title"        :"劉琦出奔",
        "doc"        :"一 窟 難 容 兩 虎 兒 , 乘 風 別 嶺 各 棲 之\n名 山 自 守 為 巢 穴 , 可 免 傷 殘 後 悔 遲",
        "type"        :"中平籤",
        "love_fate"        :"愛 情 會 有 阻 滯 ， 與 其 爭 風 呷 醋 ， 不 如 忍 氣 退 避 。" 
]),
([
        "id":95,
        "title"        :"女媧補天",
        "doc"        :"功 勤 一 簣 可 成 山 , 由 少 而 多 莫 憚 煩\n作 事 畏 辛 今 汝 畫 , 補 天 煉 石 亦 無 難",
        "type"        :"中平籤",
        "love_fate"        :"為 了 證 明 對 方 的 愛 意 ， 可 進 行 多 方 面 的 考 驗 ， 因 為 漫 漫 長 路 尚 在 面 前 。" 
]),
([
        "id":96,
        "title"        :"文姬思漢",
        "doc"        :"羌 笛 頻 吹 韻 更 悲 , 異 鄉 作 客 觸 歸 期\n南 來 孤 雁 如 憐 我 , 煩 寄 家 書 轉 達 知",
        "type"        :"中平籤",
        "love_fate"        :"現 在 並 非 談 婚 論 嫁 的 時 候 ， 而 且 愛 情 會 遇 上 考 驗 。" 
]),
([
        "id":97,
        "title"        :"康順釣魚",
        "doc"        :"憑 欄 晚 眺 倚 南 樓 , 滿 目 風 光 景 色 幽\n一 葉 小 舟 頻 下 餌 , 漁 翁 釣 得 有 魚 不",
        "type"        :"中平籤",
        "love_fate"        :"夫 妻 間 小 磨 擦 能 促 進 感 情 ， 但 適 可 而 止 ； 情 侶 間 爭 執 卻 弄 得 分 手 下 場 。" 
]),
([
        "id":98,
        "title"        :"管鮑分金",
        "doc"        :" 入 山 種 玉 嫌 田 狹 , 掘 地 尋 金 厭 客 多\n富 貴 貧 窮 天 注 定 , 世 人 何 苦 力 奔 波",
        "type"        :"中平籤",
        "love_fate"        :"只 要 心 境 平 靜 ， 看 淡 世 情 ， 自 然 會 身 體 健 康 。" 
]),
([
        "id":99,
        "title"        :"文公遇雪",
        "doc"        :"雪 擁 橋 頭 馬 不 前 , 風 狂 漁 父 莫 開 船\n水 流 花 謝 人 誰 惜 , 早 立 堅 心 志 勿 偏",
        "type"        :"中平籤",
        "love_fate"        :"若 相 方 不 肯 忍 讓 ， 感 情 可 會 亮 起 紅 燈 ； 談 婚 論 嫁 ， 最 好 待 冬 天 才 計 劃 。" 
]),
([
        "id":100,
        "title"        :"擊鼓催花",
        "doc"        :"百 花 兢 放 賀 陽 春 , 萬 物 從 今 盡 轉 新\n末 數 莫 言 窮 運 至 , 不 知 否 極 泰 來 頻",
        "type"        :"中吉籤",
        "love_fate"        :"患 難 見 真 情 ， 留 意 身 邊 那 位 有 情 人 ， 彼 此 會 有 更 進 一 步 發 展 。" 
])
});

varargs mapping get_qian(string arg)
{
        int i;
        if (!arg)
                return allqiuqian[random(sizeof(allqiuqian))];
        for (i = 0;i < sizeof(allqiuqian);i++)
        {
                if (allqiuqian[i]["id"] == arg)
                        return allqiuqian[i];
        }
        return allqiuqian[random(sizeof(allqiuqian))];
}