// shibi.c 石壁

inherit ROOM;

void create()
{
        set("short", "石壁");
        set("long", @LONG
你的面前是塊打磨光滑的大石壁(shibi)。 石壁邊上點燃着八根
大火把，照耀明亮。石室中已有十多人，有的注目凝思，有的打坐練
功，有的畢目喃喃自語，更有幾人在大聲爭辯。
LONG );
        set("item_desc",([
                "shibi"  :
"\n\t\石壁上有首詩：\n\n\n"
"\t∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷\n"
"\t∷∷∷　　　　　　　　　　　　　　　　　　　　　　　　　　∷∷∷\n"
"\t∷∷∷　　　　　　　　　　　俠客行　　　　　　　　　　　　∷∷∷\n"
"\t∷∷∷　　　　　　　　　　　　　　　　　　　　　　　　　　∷∷∷\n"
"\t∷∷∷　趙客縵胡纓，吳鈎霜雪明。銀鞍照白馬，颯沓如流星。　∷∷∷\n"
"\t∷∷∷　　　　　　　　　　　　　　　　　　　　　　　　　　∷∷∷\n"
"\t∷∷∷　十步殺一人，千里不留行，事了拂衣去，深藏身與名。　∷∷∷\n"
"\t∷∷∷　　　　　　　　　　　　　　　　　　　　　　　　　　∷∷∷\n"
"\t∷∷∷　閒過信陵飲，脱劍膝前橫。將炙啖朱亥，持觴勸侯嬴。　∷∷∷\n"
"\t∷∷∷　　　　　　　　　　　　　　　　　　　　　　　　　　∷∷∷\n"
"\t∷∷∷　三杯吐然諾，五嶽倒為輕。眼花耳熱後，意氣素霓生。　∷∷∷\n"
"\t∷∷∷　　　　　　　　　　　　　　　　　　　　　　　　　　∷∷∷\n"
"\t∷∷∷　救趙揮金錘，邯鄲先震驚，千秋二壯士，煊赫大梁城。　∷∷∷\n"
"\t∷∷∷　　　　　　　　　　　　　　　　　　　　　　　　　　∷∷∷\n"
"\t∷∷∷　縱死俠骨香，不慚世上英，誰能書閣下，白首太玄經。　∷∷∷\n"
"\t∷∷∷　　　　　　　　　　　　　　　　　　　　　　　　　　∷∷∷\n"
"\t∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷∷\n",
        ]));
        set("exits", ([
                "west" : __DIR__"neiting",
                "out"  : __DIR__"shimen",
                "east" : __DIR__"wuchang",
                "south" : __DIR__"xiaowu",
        ]));
        set("no_clean_up", 0);
        set("coor/x", -3080);
        set("coor/y", -25000);
        set("coor/z", 0);
        setup();
        replace_program(ROOM);
}