// /d/xiakedao/shiroom02.c 俠客島 石室2

inherit ROOM;

int do_study(string arg);
void create()
{
        set("short", "石室");
        set("long", @LONG
進入第二間石室，只覺眼前一花，端的是劍氣縱橫。數人各持長
劍，正在捉對較量，兵刃撞擊，錚錚不絕。地上遺棄着幾柄長短不一
的斷劍，牆上也有些兵器劈砍的斑痕。旁邊有兩位老者正在爭論着什
麼。石壁(wall)上有若干字跡。
LONG );
        set("exits", ([
                "north" : __DIR__"shihole1",
        ]));
        set("item_desc", ([
                "wall" : @WALL
牆的正上方刻着「吳鈎霜雪明」幾個大字。大字的下方又密密麻麻地
刻滿了數千小字，筆劃各異，大小不同。第一行是：鮑照樂府：“錦
帶配吳鈎”。又有一行寫的是：白居易詩云：“勿輕直折劍，猶勝曲
全鈎”。
WALL
        ]));
        set("objects", ([
                __DIR__"master/zhang" : 1,
                __DIR__"master/feng"  : 1,
        ]));
/*
風清揚説道：非也，非也，這招應該劍意曲而劍勢直

風清揚劍勢忽緩而不疏，劍意有餘而不盡，化恆山劍法為一劍，向張三丰慢慢推去！
但是張三丰身子一側，用手中兵刃格開。

風清揚神聲凝重，長劍上劈下切左右橫掃，挾雷霆萬鈞之勢逼往張三丰，「伏摩劍」劍意表
露無遺！
“哈哈哈……”張三丰一陣狂笑，輕輕一躍，輕描淡寫地避開了風清揚的攻擊，「豪氣干雲
」！
張三丰説道：這招好像應該這樣，直中有曲，曲中有直

張三丰提起左腿轉身墊步，右腳跟進，一招「黃峯入洞」，竹劍中宮直進，刺向風清揚的左
腿！
結果「噗」地一聲刺進風清揚的左腿，使風清揚不由自主地退了幾步！
( 風清揚似乎有些疲憊，但是仍然十分有活力。 )

張三丰向前連跳兩步，一招「野馬跳澗」，竹劍向前平刺風清揚的右臉！
卻見風清揚踏前一步，劍式斜指張三丰的右臉，想要使張三丰閃身而退。
*/
        set("no_clean_up", 0);
        set("no_fight", 1);
        set("no_beg", 1);
        set("coor/x", -3090);
        set("coor/y", -25110);
        set("coor/z", 0);
        setup();
}

#include "/d/xiakedao/shiroom.h"