//  Room:  /d/luoyang/youshe1.c
#include <ansi.h>;
inherit  ROOM;

void  create  ()
{
        set("short",  "右舍");
        set("long",  @LONG
走進小舍，見桌椅幾榻，無一而非竹制，牆上懸著一幅墨竹，筆勢
縱橫，墨跡淋漓，頗有森森之意。桌上放著一具瑤琴 (qin)，一管洞簫
(xiao)。
LONG);
        set("exits",  ([  /*  sizeof()  ==  2  */
                "southwest"  :  __DIR__"xiaoshe",
        ]));
        set("item_desc",  ([
                "qin" : 
"這就是著名的古琴：“焦尾桐琴”。據說是稽康在看到一個
農夫焚燒桐木時，搶出來後調制成的名器。你若有興，不妨
撫(fu)琴一曲如何？\n",
                "xiao" : 
"這是一只"HIG"綠玉長簫"NOR"，尤為難得的是，近口處一點"HIR"殷紅如血"NOR"，
襯托著這支簫管格外精神。\n",
        ]));
        set("no_clean_up", 0);
	set("coor/x", -6940);
	set("coor/y", 2160);
	set("coor/z", 0);
	setup();
}

void init()
{
        add_action("do_fu", "fu");
}

int do_fu(string arg)
{
        object me = this_player();

        if (!arg || arg != "qin")
                return notify_fail("你只能撫琴(qin)，別的撫不得。\n");
        switch( random(4) )
        {
                case 0:
                        message_vision("$N坐了下來，手指輕捻，一首節奏婉轉的漢時古曲《"HIY"有所思"NOR"》如流水般響起。\n\n", me);
                        break;
                case 1:
                        message_vision("$N盤膝坐下，彈了一首《"HIC"碧霄吟"NOR"》，洋洋然頗有青天一碧、萬裡無雲的空闊氣象。\n\n", me);
                        break;
                case 2:
                        message_vision("$N走到幾前，端正坐下，《"HIG"清心普善咒"NOR"》琴韻輕輕響起。曲調卻是柔和之至，宛如一人輕輕嘆息，又似是朝露暗潤花瓣，曉風低拂柳梢。旁人聽不多時，眼皮便越來越沉重，雖竭力凝神，卻終是難以抗拒睡魔，不久眼皮合攏，再也睜不開來，身子軟倒在地，便即睡著了。睡夢之中，仍隱隱約約聽到柔和的琴聲，似有一只溫柔的手在撫摸自己頭發，像是回到了童年，在媽媽的懷抱之中，受她親熱憐惜一般。過了良久良久，琴聲方才止歇。\n\n", me);
                        break;
                case 3:
                        message_vision("$N走到幾前，手指輕撥幾下琴弦，就彈奏起來。這一曲時而慷慨激昂，時而溫柔雅致，間或有熱血如沸的激奮。奏了良久，琴韻漸緩，似乎樂音在不住遠去，倒像奏琴之人走出了數十丈之遙，又走到數裡之外，細微幾不可再聞。琴音似止未止之際，卻有一二下極低極細的簫聲在琴音旁響了起來。回旋婉轉，簫聲漸響，恰似吹簫人一面吹，一面慢慢走近，簫聲清麗，忽高忽低，忽輕忽響，低到極處之際，幾個盤旋之後，又再低沉下去，雖極低極細，每個音節仍清晰可聞。漸漸低音中偶有珠玉跳躍，清脆短促，此伏彼起，繁音漸增，先如鳴泉飛濺，繼而如群卉爭艷，花團錦簇，更夾著間關鳥語，彼鳴我和，漸漸的百鳥離去，春殘花落，但聞雨聲蕭蕭，一片凄涼肅殺之象，細雨綿綿，若有若無，終于萬籟俱寂。這正是《"HIM"笑傲江湖之曲"NOR"》。\n\n", me);
                        break;
        }
        return 1;
}