// This program is a part of NT MudLIB
// zhoutiand.c

#pragma optimize
#pragma save_binary

#include <ansi.h>

inherit F_CLEAN_UP;

nosave mapping data = ([
        "attack" : 1640,
        "neili" : 74160,
        "da_damage" : 10,
        "reduce_damage" : 10,
        "avoid_poison" : 7,
        "research_times" : 100,
        "derive_effect" : 205,
        "jing" : 4540,
        "research_effect" : 193,
        "food" : 1620,
        "jingli" : 45800,
        "dex" : 172,
        "int" : 144,
        "mar" : 108370,
        "armor" : 990,
        "damage" : 1840,
        "water" : 1410,
        "con" : 162,
        "kar" : 11,
        "practice_effect" : 180,
        "reflect" : 12,
        "jiali" : 4440,
        "pot" : 210910,
        "str" : 216,
        "finish" : 1,
        "magic_find" : 11,
        "weapon" : 30,
        "qi" : 125630,
        "defense" : 150,
]);

int query_jingmai_effect(string key)
{
        return data[key];
}
string *x_zhoutian = ({
        "秝欂闕", "栠欂闕", "秝峎闕", "栠峎闕", "湍闕", "喳闕", "俋闕", "飭俋闕", "冪俋闕",
});

string *d_zhoutian = ({
        "忒怮秝闕", "忒怮栠闕", "逋怮秝闕", "逋怮栠闕", "忒屾栠闕", "忒屾秝闕", "逋屾秝闕",
        "逋屾栠闕", "忒栠隴闕", "逋栠隴闕", "忒婽秝闕", "逋婽秝闕",
});

string *zhoutian = ({
        "秝欂闕", "栠欂闕", "秝峎闕", "栠峎闕", "湍闕", "喳闕", "俋闕", "飭俋闕", "冪俋闕",
        "忒怮秝闕", "忒怮栠闕", "逋怮秝闕", "逋怮栠闕", "忒屾栠闕", "忒屾秝闕", "逋屾秝闕",
        "逋屾栠闕", "忒栠隴闕", "逋栠隴闕", "忒婽秝闕", "逋婽秝闕",
});


/*  喳悃虴彆測鎢蹈桶
QI:N                   悛奻癹+N       /adm/daemons/race/human.c  jingmai/qi
NEI:N                  囀薯奻癹+N       /clone/user/user.c         jingmai/neili
ATK:N                  韜笢脹撰+N       combatd.c                  jingmai/attack
DMG:N                  夼漲脹撰+N       power.c combatd.c          jingmai/damage
AMR:N                  滅誘脹撰+N       power.c combatd.c          jingmai/armor
WEAPON:N               條哏薯+N%      power.c & combatd.c        jingmai/weapon
JIALI:N                樓薯奻癹+N       /cmds/.. /jiali.c          jingmai/jiali
JING:N                 儕薯奻癹+N       /clone/user/user.c         jingmai/jingli
MAR:N                  极頗奻癹+N       /clone/user/user.c         jingmai/mar
POT:N                  夔奻癹+N       /clone/user/user.c         jingmai/pot
MINGSI:N               琱佷虴彆+N%      /cmds/.../reflect.c        jingmai/reflect
FOOD:N                 妘昜奻癹+N       /feature/damage.c          jingmai/food
WATER:N                窊阨奻癹+N       /feature/damage.c          jingmai/water
KANGDU:N               蕨馮枑汔+N%      /feature/condition.c       jingmai/avoid_poison
_STR:N                 綴毞旋薯+N       /feature/attribute.c       jingmai/str
_DEX:N                 綴毞旯楊+N       /feature/attribute.c       jingmai/dex
_INT:N                 綴毞昳俶+N       /feature/attribute.c       jingmai/int
_CON:N                 綴毞跦嘎+N       /feature/attribute.c       jingmai/con
STR:N                  珂毞旋薯+N       眻諉崝樓
DEX:N                  珂毞旯楊+N       眻諉崝樓
INT:N                  珂毞昳俶+N       眻諉崝樓
CON:N                  珂毞旋薯+N       眻諉崝樓
ADDPOT:N               崝樓夔+N       眻諉崝樓
                       崝樓蛹笭
                       崝樓腦埽         power.c combatd.c          jingmai/kar
                       崝樓堍         power.c combatd.c          jingmai/magic_find
                       崝樓旃噶棒杅     /cmds/skill/yanjiu.c       jingmai/research_times
                       崝樓旃噶虴薹     /cmds/skill/yanjiu.c       jingmai/research_effect   %
                       枑詢撲虴薹     /cmds/skill/jiqu.c         jingmai/derive_effect     %

*/

mapping tongren_list = ([
                     //({ 冪闕靡, 悃弇靡ㄛ喳悃虴彆ㄛ秏瘧囀薯})
        // 秝欂闕
        "tongren a1"    :  ({"秝欂闕","嗷悃", "QI:50","100"}),
        "tongren a2"    :  ({"秝欂闕","桽漆悃", "NEI:20","150"}),
        "tongren a3"    :  ({"秝欂闕","蝠陓悃", "ATK:10","200"}),
        "tongren a4"    :  ({"秝欂闕","秝嗷悃", "DMG:10","200"}),
        "tongren a5"    :  ({"秝欂闕","筵嗷悃", "AMR:10","200"}),
        "tongren a6"    :  ({"秝欂闕","喳悃", "JIALI:50","200"}),
        "tongren a7"    :  ({"秝欂闕","跦悃", "QI:30","100"}),
        "tongren a8"    :  ({"秝欂闕","髓悃", "JING:20","200"}),
        "tongren a9"    :  ({"秝欂闕","茩悃", "MAR:10","100"}),
        "tongren a10"   :  ({"秝欂闕","隴悃", "QI:10","100"}),
        "tongren a11"   :  ({"秝欂闕","祥悃", "AMR:10","100"}),
        "tongren a12"   :  ({"秝欂闕","褽藷悃", "QI:10","100"}),
        "tongren a13"   :  ({"秝欂闕","筵掏悃", "QI:20","100"}),
        "tongren a14"   :  ({"秝欂闕","逋爵悃", "QI:30","100"}),
        "tongren a15"   :  ({"秝欂闕","猿癒悃", "QI:40","100"}),
        "tongren a16"   :  ({"秝欂闕","賤洈悃", "POT:20","100"}),
        "tongren a17"   :  ({"秝欂闕","喳栠悃", "NEI:10","100"}),
        "tongren a18"   :  ({"秝欂闕","扽募悃", "NEI:20","150"}),

        // 栠欂闕
        "tongren b1"    :  ({"栠欂闕","扠闕悃", "QI:500","300"}),
        "tongren b2"    :  ({"栠欂闕","統悃", "QI:600","300"}),
        "tongren b3"    :  ({"栠欂闕","嚾栠悃", "QI:700","500"}),
        "tongren b4"    :  ({"栠欂闕","懈鏀悃", "QI:800:AMR:10","900"}),
        "tongren b5"    :  ({"栠欂闕","貤悃", "QI:500:MAR:50","800"}),
        "tongren b6"    :  ({"栠欂闕","潛鏦悃", "QI:300","300"}),
        "tongren b7"    :  ({"栠欂闕","華嗷悃", "QI:600","300"}),
        "tongren b8"    :  ({"栠欂闕","操累悃", "QI:100","300"}),
        "tongren b9"    :  ({"栠欂闕","操鏀悃", "QI:100:ATK:10","400"}),
        "tongren b10"   :  ({"栠欂闕","創悃", "QI:400:NEI:40","400"}),
        "tongren b11"   :  ({"栠欂闕","瑞喀悃", "QI:600","300"}),
        "tongren b12"   :  ({"栠欂闕","婗罣悃", "QI:200","300"}),
        "tongren b13"   :  ({"栠欂闕","羹喳悃", "QI:400","300"}),
        "tongren b14"   :  ({"栠欂闕","船悃", "QI:700:DMG:10","1200"}),
        "tongren b15"   :  ({"栠欂闕","拻揭悃", "QI:200:DMG:10","1200"}),
        "tongren b16"   :  ({"栠欂闕","創嫖悃", "QI:800:AMR:20","2000"}),
        "tongren b17"   :  ({"栠欂闕","籵毞悃", "QI:1200","1000"}),
        "tongren b18"   :  ({"栠欂闕","釐悃", "QI:500:MAR:100","1100"}),
        "tongren b19"   :  ({"栠欂闕","迶淠悃", "QI:400:POT:200","1200"}),
        "tongren b20"   :  ({"栠欂闕","毞翐悃", "QI:800","500"}),
        "tongren b21"   :  ({"栠欂闕","創刓悃", "QI:200","200"}),
        "tongren b22"   :  ({"栠欂闕","壎贅悃", "QI:500","300"}),
        "tongren b23"   :  ({"栠欂闕","滄栨悃", "QI:400","300"}),

        // 秝峎闕
        "tongren c1"    :  ({"秝峎闕","葬忔悃", "NEI:120","800"}),
        "tongren c2"    :  ({"秝峎闕","湮筵悃", "NEI:300:QI:50","800"}),
        "tongren c3"    :  ({"秝峎闕","栠蝠悃", "NEI:100","800"}),
        "tongren c4"    :  ({"秝峎闕","號迉悃", "NEI:150","800"}),
        "tongren c5"    :  ({"秝峎闕","藷悃", "NEI:400","800"}),
        "tongren c6"    :  ({"秝峎闕","螳悃", "NEI:300","800"}),
        "tongren c7"    :  ({"秝峎闕","憤悃", "NEI:200","800"}),
        "tongren c8"    :  ({"秝峎闕","鍾悃", "NEI:800:ATK:20","4000"}),
        "tongren c9"    :  ({"秝峎闕","屾漆悃", "NEI:700:DMG:10","3400"}),
        "tongren c10"   :  ({"秝峎闕","鍾耋悃", "NEI:100:QI:100","800"}),
        "tongren c11"   :  ({"秝峎闕","籵爵悃", "NEI:200","800"}),
        "tongren c12"   :  ({"秝峎闕","秝菃悃", "NEI:700","1500"}),
        "tongren c13"   :  ({"秝峎闕","朸藷悃", "NEI:200","800"}),
        "tongren c14"   :  ({"秝峎闕","屾葬悃", "NEI:500","800"}),
        "tongren c15"   :  ({"秝峎闕","屾喳悃", "NEI:500","800"}),
        "tongren c16"   :  ({"秝峎闕","耟梅悃", "NEI:300","800"}),

        // 栠峎闕
        "tongren d1"    :  ({"栠峎闕","毞鏀悃", "POT:200","600"}),
        "tongren d2"    :  ({"栠峎闕","貤悃", "POT:100","600"}),
        "tongren d3"    :  ({"栠峎闕","潛凝悃", "POT:200:MAR:200","2000"}),
        "tongren d4"    :  ({"栠峎闕","栠蝠悃", "POT:600","600"}),
        "tongren d5"    :  ({"栠峎闕","芛峎悃", "POT:400:JING:200","3000"}),
        "tongren d6"    :  ({"栠峎闕","踢藷悃", "POT:400:NEI:200","1200"}),
        "tongren d7"    :  ({"栠峎闕","栠啞悃", "POT:300:QI:100","1000"}),
        "tongren d8"    :  ({"栠峎闕","掛朸悃", "POT:200:JING:300","2200"}),
        "tongren d9"    :  ({"栠峎闕","芛還悃", "POT:200","600"}),
        "tongren d10"   :  ({"栠峎闕","醴敦悃", "POT:500:MINGSI:1","5500"}),
        "tongren d11"   :  ({"栠峎闕","淏茠悃", "POT:500","600"}),
        "tongren d12"   :  ({"栠峎闕","齟諾悃", "POT:700:AMR:20","3500"}),
        "tongren d13"   :  ({"栠峎闕","創鍾悃", "POT:200","600"}),
        "tongren d14"   :  ({"栠峎闕","瑞喀悃", "POT:300:ATK:10","2200"}),
        "tongren d15"   :  ({"栠峎闕","瑞葬悃", "POT:500","600"}),
        "tongren d16"   :  ({"栠峎闕","挳藷悃", "POT:300","600"}),
        "tongren d17"   :  ({"栠峎闕","堁藷悃", "POT:100:NEI:200","1200"}),
        "tongren d18"   :  ({"栠峎闕","喜屙悃", "POT:100","600"}),
        "tongren d19"   :  ({"栠峎闕","謂郔悃", "POT:400:JING:200","2000"}),
        "tongren d20"   :  ({"栠峎闕","蹈悃", "POT:300","600"}),
        "tongren d21"   :  ({"栠峎闕","冪悃", "POT:600","600"}),
        "tongren d22"   :  ({"栠峎闕","怮唻悃", "POT:100:MINGSI:2","12000"}),
        "tongren d23"   :  ({"栠峎闕","赶暱悃", "POT:400","600"}),
        "tongren d24"   :  ({"栠峎闕","屾妀悃", "POT:300","600"}),

        // 湍闕
        "tongren e1"    :  ({"湍闕","湍闕悃", "QI:200:NEI:50","1000"}),
        "tongren e2"    :  ({"湍闕","拻忺悃", "ATK:20","1200"}),
        "tongren e3"    :  ({"湍闕","峎耋悃", "JIALI:50","1200"}),
        "tongren e4"    :  ({"湍闕","毞喳悃", "AMR:10","1200"}),
        "tongren e5"    :  ({"湍闕","腹啞悃", "WEAPON:10","6000"}),
        "tongren e6"    :  ({"湍闕","芛秝悃", "_INT:2","4000"}),
        "tongren e7"    :  ({"湍闕","俇嘎悃", "NEI:100","1000"}),
        "tongren e8"    :  ({"湍闕","掛朸悃", "JIALI:20","1200"}),
        "tongren e9"    :  ({"湍闕","栠啞悃", "QI:50","1000"}),
        "tongren e10"   :  ({"湍闕","芛還悃", "JIALI:20","1800"}),
        "tongren e11"   :  ({"湍闕","醴敦悃", "JIALI:30","1800"}),
        "tongren e12"   :  ({"湍闕","淏茠悃", "JIALI:40","1800"}),
        "tongren e13"   :  ({"湍闕","創鍾悃", "JIALI:10","1800"}),
        "tongren e14"   :  ({"湍闕","齟諾悃", "JIALI:60","1800"}),
        "tongren e15"   :  ({"湍闕","俋悃", "JIALI:30","1800"}),
        "tongren e16"   :  ({"湍闕","嫖隴悃", "JIALI:30","1800"}),
        "tongren e17"   :  ({"湍闕","栠落悃", "JIALI:80","1800"}),
        "tongren e18"   :  ({"湍闕","唑笘悃", "JIALI:10","1800"}),
        "tongren e19"   :  ({"湍闕","剡悃", "JIALI:40","1800"}),

        // 喳闕
        "tongren f1"    :  ({"喳闕","頗秝悃", "QI:200","1000"}),
        "tongren f2"    :  ({"喳闕","秝蝠悃", "AMR:10","1000"}),
        "tongren f3"    :  ({"喳闕","喳悃", "AMR:10","1000"}),
        "tongren f4"    :  ({"喳闕","筵嘎悃", "ATK:20","1000"}),
        "tongren f5"    :  ({"喳闕","湮禎悃", "JIALI:50","1000"}),
        "tongren f6"    :  ({"喳闕","悃", "JING:20","1000"}),
        "tongren f7"    :  ({"喳闕","侐雛悃", "JING:30","1000"}),
        "tongren f8"    :  ({"喳闕","笢蛁悃", "AMR:20","2000"}),
        "tongren f9"    :  ({"喳闕","瓣貤悃", "AMR:30","3000"}),
        "tongren f10"   :  ({"喳闕","妀悃", "AMR:40","4000"}),
        "tongren f11"   :  ({"喳闕","坒壽悃", "NEI:50","1000"}),
        "tongren f12"   :  ({"喳闕","秝飲悃", "QI:100","1000"}),
        "tongren f13"   :  ({"喳闕","籵嗷悃", "FOOD:100","1000"}),
        "tongren f14"   :  ({"喳闕","蚅藷悃", "FOOD:200","1000"}),
        "tongren f15"   :  ({"喳闕","壽藷悃", "WATER:100","1000"}),
        "tongren f16"   :  ({"喳闕","怮眣悃", "WATER:200","1000"}),
        "tongren f17"   :  ({"喳闕","寥懂悃", "ADDPOT:600000","1000"}),
        "tongren f18"   :  ({"喳闕","湮操悃", "KANGDU:1","4000"}),
        "tongren f19"   :  ({"喳闕","毞忺悃", "KANGDU:2","10000"}),
        "tongren f20"   :  ({"喳闕","忔悃", "QI:20","1000"}),
        "tongren f21"   :  ({"喳闕","阨芼悃", "AMR:40","4000"}),
        "tongren f22"   :  ({"喳闕","阨耋悃", "DMG:10","4000"}),
        "tongren f23"   :  ({"喳闕","俋鍬悃", "DMG:30","22000"}),
        "tongren f24"   :  ({"喳闕","賑藷悃", "_DEX:6","8000"}),

        // 飭俋闕
        "tongren g1"    :  ({"飭俋闕","酗悃", "JIALI:60","4000"}),
        "tongren g2"    :  ({"飭俋闕","殈貤悃", "JIALI:20","4000"}),
        "tongren g3"    :  ({"飭俋闕","栠壽韜藷悃", "JIALI:30","4000"}),
        "tongren g4"    :  ({"飭俋闕","奻俴唑忺悃", "JIALI:40","4000"}),
        "tongren g5"    :  ({"飭俋闕","撕笢悃", "JIALI:100","4000"}),
        "tongren g6"    :  ({"飭俋闕","祫笢忺悃", "JIALI:20","4000"}),
        "tongren g7"    :  ({"飭俋闕","踐坫悃", "JIALI:10","4000"}),
        "tongren g8"    :  ({"飭俋闕","祫栠寥鍾怢悃", "JIALI:40","4000"}),
        "tongren g9"    :  ({"飭俋闕","朸耋悃", "JIALI:20","4000"}),
        "tongren g10"   :  ({"飭俋闕","旯翐悃", "JIALI:30","4000"}),
        "tongren g11"   :  ({"飭俋闕","枎耋羲悃", "JIALI:40","4000"}),
        "tongren g12"   :  ({"飭俋闕","湮袢悃", "JIALI:50","4000"}),
        "tongren g13"   :  ({"飭俋闕","挳藷蟀瑞葬悃", "JIALI:60","4000"}),
        "tongren g14"   :  ({"飭俋闕","齟誧悃", "JIALI:10","4000"}),
        "tongren g15"   :  ({"飭俋闕","潔悃", "JIALI:5:DMG:10","12000"}),
        "tongren g16"   :  ({"飭俋闕","綴階齬悃", "JIALI:10","4000"}),
        "tongren g17"   :  ({"飭俋闕","啃磁悃", "JIALI:80","4000"}),
        "tongren g18"   :  ({"飭俋闕","階籵媔頗悃", "JIALI:120","4000"}),
        "tongren g19"   :  ({"飭俋闕","奻陎悃", "JIALI:30","4000"}),
        "tongren g20"   :  ({"飭俋闕","朸穸悃", "JIALI:20","4000"}),
        "tongren g21"   :  ({"飭俋闕","匼悃", "JIALI:20","4000"}),
        "tongren g22"   :  ({"飭俋闕","阨僱悃", "JIALI:10","4000"}),
        "tongren g23"   :  ({"飭俋闕","募傷悃", "JIALI:20","4000"}),
        "tongren g24"   :  ({"飭俋闕","鷏蝠悃", "JIALI:15","4000"}),

        // 俋闕
        "tongren h1"    :  ({"俋闕","嘎悃", "QI:20:_CON:2","6000"}),
        "tongren h2"    :  ({"俋闕","笢憤悃", "QI:20:_STR:2","9000"}),
        "tongren h3"    :  ({"俋闕","壽啋悃", "QI:20:_STR:1","6000"}),
        "tongren h4"    :  ({"俋闕","狟錸悃", "QI:20:_DEX:4","6000"}),
        "tongren h5"    :  ({"俋闕","笢錸悃", "NEI:20:_DEX:1","6000"}),
        "tongren h6"    :  ({"俋闕","奻錸悃", "NEI:20:_INT:2","12000"}),
        "tongren h7"    :  ({"俋闕","毞芼悃", "NEI:20:_INT:1","9000"}),
        "tongren h8"    :  ({"俋闕","螳悃", "NEI:20:_CON:4","6000"}),
        "tongren h9"    :  ({"俋闕","創蓮悃", "NEI:20:_INT:1","9000"}),
        "tongren h10"   :  ({"俋闕","湮笘悃", "JING:20:_DEX:2","6000"}),
        "tongren h11"   :  ({"俋闕","阨悃", "JING:20:_STR:5","25000"}),
        "tongren h12"   :  ({"俋闕","湮禎悃", "JING:20:_CON:1","6000"}),
        "tongren h13"   :  ({"俋闕","鍾剡悃", "JING:20:_CON:2","6000"}),
        "tongren h14"   :  ({"俋闕","凜藷悃", "MAR:20:_STR:1","6000"}),
        "tongren h15"   :  ({"俋闕","蚇悃", "MAR:20:_INT:1","9000"}),
        "tongren h16"   :  ({"俋闕","朸猾悃", "MAR:20:_DEX:2","6000"}),
        "tongren h17"   :  ({"俋闕","華儂悃", "MAR:20:_DEX:3","6000"}),
        "tongren h18"   :  ({"俋闕","悛漆悃", "POT:20:_INT:1","9000"}),
        "tongren h19"   :  ({"俋闕","號籵嗷悃", "POT:20:_STR:1","6000"}),
        "tongren h20"   :  ({"俋闕","祭檀悃", "POT:20:_DEX:2","6000"}),
        "tongren h21"   :  ({"俋闕","朸紲悃", "POT:20:_INT:1","9000"}),
        "tongren h22"   :  ({"俋闕","貤葬悃", "JIALI:20:_INT:4","18000"}),
        "tongren h23"   :  ({"俋闕","號闊悃", "JIALI:20:_CON:4","6000"}),
        "tongren h24"   :  ({"俋闕","秝鍬悃", "JIALI:20:_STR:4","18000"}),

        // 冪俋闕
        "tongren i1"    :  ({"冪俋闕","朸棲悃", "JING:20","8000"}),
        "tongren i2"    :  ({"冪俋闕","荂斻悃", "JING:30","8000"}),
        "tongren i3"    :  ({"冪俋闕","赶殈悃", "JING:40","8000"}),
        "tongren i4"    :  ({"冪俋闕","怮栠悃", "JING:500","30000"}),
        "tongren i5"    :  ({"冪俋闕","嫉潑悃", "JING:60","8000"}),
        "tongren i6"    :  ({"冪俋闕","綴悃", "NEI:30","8000"}),
        "tongren i7"    :  ({"冪俋闕","踢踩悃", "NEI:30","8000"}),
        "tongren i8"    :  ({"冪俋闕","迶珘悃", "NEI:30","8000"}),
        "tongren i9"    :  ({"冪俋闕","匐訄悃", "NEI:30","8000"}),
        "tongren i10"   :  ({"冪俋闕","侐瑜悃", "NEI:30","8000"}),
        "tongren i11"   :  ({"冪俋闕","鐓隴悃", "QI:50","8000"}),
        "tongren i12"   :  ({"冪俋闕","隅揚悃", "QI:60","8000"}),
        "tongren i13"   :  ({"冪俋闕","坋哫悃", "QI:70","8000"}),
        "tongren i14"   :  ({"冪俋闕","殈悃", "QI:80","8000"}),
        "tongren i15"   :  ({"冪俋闕","標撕悃", "QI:90","8000"}),
        "tongren i16"   :  ({"冪俋闕","媼啞悃", "QI:100","8000"}),
        "tongren i17"   :  ({"冪俋闕","殈芫萸悃", "MAR:10","8000"}),
        "tongren i18"   :  ({"冪俋闕","禍階悃", "MAR:20","8000"}),
        "tongren i19"   :  ({"冪俋闕","啃單恮悃", "MAR:30","8000"}),
        "tongren i20"   :  ({"冪俋闕","洏桉悃", "MAR:40","8000"}),
        "tongren i21"   :  ({"冪俋闕","筐黨悃", "DMG:10","30000"}),
        "tongren i22"   :  ({"冪俋闕","擊帣悃", "AMR:40","30000"}),
        "tongren i23"   :  ({"冪俋闕","匐瑞悃", "ATK:10","30000"}),

/////////////////////////////////////////////////////////////////////////

                     //({ 冪闕靡, 悃弇靡ㄛ喳悃虴彆ㄛ秏瘧囀薯})
        // 忒怮秝闕
        "tongren j1"    :  ({"忒怮秝闕","屾妀悃", "QI:50","100"}),
        "tongren j2"    :  ({"忒怮秝闕","怮唻悃", "QI:30","150"}),
        "tongren j3"    :  ({"忒怮秝闕","笢葬悃", "QI:20","200"}),
        "tongren j4"    :  ({"忒怮秝闕","赶暱悃", "NEI:10","200"}),
        "tongren j5"    :  ({"忒怮秝闕","堁藷悃", "NEI:30","200"}),
        "tongren j6"    :  ({"忒怮秝闕","毞葬悃", "QI:10","200"}),
        "tongren j7"    :  ({"忒怮秝闕","冪悃", "NEI:20","100"}),
        "tongren j8"    :  ({"忒怮秝闕","喜屙悃", "JING:10","200"}),
        "tongren j9"    :  ({"忒怮秝闕","狨啞悃", "JING:10","100"}),
        "tongren j10"   :  ({"忒怮秝闕","蹈悃", "POT:100","100"}),


        // 忒怮栠闕
        "tongren k1"    :  ({"忒怮栠闕","屾屙悃", "JING:20:_INT:1","300"}),
        "tongren k2"    :  ({"忒怮栠闕","嗷悃", "JING:30","300"}),
        "tongren k3"    :  ({"忒怮栠闕","鏀悃", "JING:40","500"}),
        "tongren k4"    :  ({"忒怮栠闕","綴洈悃", "JING:80:ATK:10","900"}),
        "tongren k5"    :  ({"忒怮栠闕","勂嘎悃", "JING:60","800"}),
        "tongren k6"    :  ({"忒怮栠闕","潛鏦悃", "NEI:30","300"}),
        "tongren k7"    :  ({"忒怮栠闕","毞悃", "NEI:30:AMR:10","300"}),
        "tongren k8"    :  ({"忒怮栠闕","梂瑞悃", "NEI:30","300"}),
        "tongren k9"    :  ({"忒怮栠闕","泭僧悃", "NEI:30","400"}),
        "tongren k10"   :  ({"忒怮栠闕","潛笢貤悃", "NEI:30:JING:20","400"}),
        "tongren k11"   :  ({"忒怮栠闕","毞跁悃", "JING:20","300"}),
        "tongren k12"   :  ({"忒怮栠闕","潛俋貤悃", "JING:30","300"}),
        "tongren k13"   :  ({"忒怮栠闕","欱橾悃", "JING:40:NEI:30","300"}),
        "tongren k14"   :  ({"忒怮栠闕","栠嘎悃", "JING:50","1200"}),
        "tongren k15"   :  ({"忒怮栠闕","圊悃", "JING:60:_DEX:1","1200"}),
        "tongren k16"   :  ({"忒怮栠闕","毞敦悃", "NEI:30","2000"}),
        "tongren k17"   :  ({"忒怮栠闕","盓淏悃", "NEI:30","1000"}),
        "tongren k18"   :  ({"忒怮栠闕","貤悃", "NEI:30:_CON:1","1100"}),
        "tongren k19"   :  ({"忒怮栠闕","苤漆悃", "NEI:30","1200"}),
        "tongren k20"   :  ({"忒怮栠闕","潛淔悃", "NEI:30","500"}),


        // 逋怮秝闕
        "tongren l1"    :  ({"逋怮秝闕","悛漆悃", "QI:20:NEI:20","800"}),
        "tongren l2"    :  ({"逋怮秝闕","秝鍬悃", "QI:30:JING:10","800"}),
        "tongren l3"    :  ({"逋怮秝闕","華儂悃", "QI:40","800"}),
        "tongren l4"    :  ({"逋怮秝闕","凜藷悃", "QI:50:_DEX:1","800"}),
        "tongren l5"    :  ({"逋怮秝闕","妀悃", "QI:60","800"}),
        "tongren l6"    :  ({"逋怮秝闕","鼠呤悃", "NEI:30:POT:100","800"}),
        "tongren l7"    :  ({"逋怮秝闕","笐啞悃", "NEI:30","800"}),
        "tongren l8"    :  ({"逋怮秝闕","湮飲悃", "NEI:30:MAR:50","4000"}),
        "tongren l9"    :  ({"逋怮秝闕","怮啞悃", "NEI:30","3400"}),
        "tongren l10"   :  ({"逋怮秝闕","穢嘎悃", "NEI:30","800"}),
        "tongren l11"   :  ({"逋怮秝闕","喳藷悃", "JING:20","800"}),
        "tongren l12"   :  ({"逋怮秝闕","葬忔悃", "QI:30:DMG:10","1500"}),
        "tongren l13"   :  ({"逋怮秝闕","秝蝠悃", "JING:40","800"}),
        "tongren l14"   :  ({"逋怮秝闕","號賦悃", "QI:50","800"}),
        "tongren l15"   :  ({"逋怮秝闕","湮筵悃", "JING:60:_STR:2","800"}),
        "tongren l16"   :  ({"逋怮秝闕","號飢悃", "QI:30","800"}),
        "tongren l17"   :  ({"逋怮秝闕","妘鬄悃", "QI:30","800"}),
        "tongren l18"   :  ({"逋怮秝闕","倠盺悃", "NEI:30:AMR:10","800"}),
        "tongren l19"   :  ({"逋怮秝闕","湮婦悃", "NEI:30","1500"}),
        "tongren l20"   :  ({"逋怮秝闕","笚悃", "NEI:30","800"}),
        "tongren l21"   :  ({"逋怮秝闕","毞洈悃", "NEI:30:DMG:10","800"}),


        // 逋怮栠闕
        "tongren m1"    :  ({"逋怮栠闕","嚾栠悃", "JING:20:QI:40","600"}),
        "tongren m2"    :  ({"逋怮栠闕","壎贅悃", "JING:30:JIALI:10","600"}),
        "tongren m3"    :  ({"逋怮栠闕","隴悃", "JING:40","2000"}),
        "tongren m4"    :  ({"逋怮栠闕","滄栨悃", "JING:50","600"}),
        "tongren m5"    :  ({"逋怮栠闕","婗罣悃", "JING:60:JIALI:10","3000"}),
        "tongren m6"    :  ({"逋怮栠闕","瑞藷悃", "NEI:30","1200"}),
        "tongren m7"    :  ({"逋怮栠闕","扠悃", "NEI:30:ATK:10","1000"}),
        "tongren m8"    :  ({"逋怮栠闕","扠闕悃", "NEI:30","2200"}),
        "tongren m9"    :  ({"逋怮栠闕","船悃", "NEI:30","600"}),
        "tongren m10"   :  ({"逋怮栠闕","羹喳悃", "NEI:30:JIALI:20","5500"}),
        "tongren m11"   :  ({"逋怮栠闕","拻揭悃", "QI:20","600"}),
        "tongren m12"   :  ({"逋怮栠闕","煎貤悃", "QI:30","3500"}),
        "tongren m13"   :  ({"逋怮栠闕","踢藷悃", "QI:40","600"}),
        "tongren m14"   :  ({"逋怮栠闕","儔嘎悃", "QI:50:ATK:10","2200"}),
        "tongren m15"   :  ({"逋怮栠闕","籵毞悃", "QI:60","600"}),
        "tongren m16"   :  ({"逋怮栠闕","創嫖悃", "NEI:30","600"}),
        "tongren m17"   :  ({"逋怮栠闕","釐悃", "NEI:30","1200"}),
        "tongren m18"   :  ({"逋怮栠闕","婽秝貤悃", "NEI:30:JIALI:30","600"}),
        "tongren m19"   :  ({"逋怮栠闕","旰嘎悃", "NEI:30","2000"}),
        "tongren m20"   :  ({"逋怮栠闕","逋籵嘎悃", "NEI:30","600"}),
        "tongren m21"   :  ({"逋怮栠闕","毞翐悃", "NEI:20","600"}),
        "tongren m22"   :  ({"逋怮栠闕","迶淠悃", "POT:20","12000"}),
        "tongren m23"   :  ({"逋怮栠闕","湮蝤悃", "POT:30:AMR:10","600"}),
        "tongren m24"   :  ({"逋怮栠闕","陑貤悃", "POT:20","600"}),
        "tongren m25"   :  ({"逋怮栠闕","飭貤悃", "POT:10:DMG:10","600"}),
        "tongren m26"   :  ({"逋怮栠闕","貤悃", "POT:60","2000"}),
        "tongren m27"   :  ({"逋怮栠闕","創刓悃", "POT:10","600"}),
        "tongren m28"   :  ({"逋怮栠闕","庛貤悃", "NEI:30","600"}),
        "tongren m29"   :  ({"逋怮栠闕","奻鏀悃", "NEI:30:JIALI:20","12000"}),
        "tongren m30"   :  ({"逋怮栠闕","錴貤悃", "NEI:30","600"}),
        "tongren m31"   :  ({"逋怮栠闕","蝴貤悃", "NEI:20","600"}),
        "tongren m32"   :  ({"逋怮栠闕","漆貤悃", "JING:20","2000"}),
        "tongren m33"   :  ({"逋怮栠闕","朳貤悃", "JING:30","600"}),
        "tongren m34"   :  ({"逋怮栠闕","棒鏀悃", "JING:20","600"}),
        "tongren m35"   :  ({"逋怮栠闕","裕貤悃", "JING:10","12000"}),
        "tongren m36"   :  ({"逋怮栠闕","壽啋貤悃", "JING:60","600"}),
        "tongren m37"   :  ({"逋怮栠闕","湮釵貤悃", "NEI:30","600"}),
        "tongren m38"   :  ({"逋怮栠闕","苤釵貤悃", "NEI:30","600"}),
        "tongren m39"   :  ({"逋怮栠闕","笢鏀悃", "NEI:30:JIALI:20","2000"}),
        "tongren m40"   :  ({"逋怮栠闕","基鄶貤悃", "POT:30","600"}),
        "tongren m41"   :  ({"逋怮栠闕","啞遠貤悃", "POT:30","600"}),
        "tongren m42"   :  ({"逋怮栠闕","狟鏀悃", "POT:30","12000"}),
        "tongren m43"   :  ({"逋怮栠闕","頗栠悃", "POT:20","600"}),
        "tongren m44"   :  ({"逋怮栠闕","巹栠悃", "JING:30:DMG:10","600"}),
        "tongren m45"   :  ({"逋怮栠闕","磁栠悃", "JING:40:ATK:20","2000"}),
        "tongren m46"   :  ({"逋怮栠闕","巹笢悃", "JING:10","600"}),
        "tongren m47"   :  ({"逋怮栠闕","蜇煦悃", "JING:30","600"}),
        "tongren m48"   :  ({"逋怮栠闕","創痴悃", "NEI:30","12000"}),
        "tongren m49"   :  ({"逋怮栠闕","詮蹅悃", "NEI:30:_STR:2","600"}),
        "tongren m50"   :  ({"逋怮栠闕","誧悃", "NEI:30","600"}),
        "tongren m51"   :  ({"逋怮栠闕","蹅藷悃", "NEI:30","600"}),
        "tongren m52"   :  ({"逋怮栠闕","朸斻悃", "NEI:30","2000"}),
        "tongren m53"   :  ({"逋怮栠闕","秜藷悃", "JING:20:JIALI:40","600"}),
        "tongren m54"   :  ({"逋怮栠闕","錴壽悃", "JING:30","600"}),
        "tongren m55"   :  ({"逋怮栠闕","祩弅悃", "JING:20","12000"}),
        "tongren m56"   :  ({"逋怮栠闕","骯藷悃", "JING:50","600"}),
        "tongren m57"   :  ({"逋怮栠闕","砩忔悃", "JING:60:_INT:2","600"}),
        "tongren m58"   :  ({"逋怮栠闕","栠試悃", "NEI:30:JING:50","2000"}),

        // 忒屾秝闕
        "tongren n1"    :  ({"忒屾秝闕","秝菢悃", "JING:20:_DEX:3","1000"}),
        "tongren n2"    :  ({"忒屾秝闕","籵爵悃", "JING:30","1200"}),
        "tongren n3"    :  ({"忒屾秝闕","屾葬悃", "JING:40","1200"}),
        "tongren n4"    :  ({"忒屾秝闕","屾喳悃", "JING:50:NEI:30","1200"}),
        "tongren n5"    :  ({"忒屾秝闕","鍾耋悃", "JING:60","6000"}),
        "tongren n6"    :  ({"忒屾秝闕","朸藷悃", "NEI:30","4000"}),
        "tongren n7"    :  ({"忒屾秝闕","鍾悃", "NEI:30:_INT:2","1000"}),
        "tongren n8"    :  ({"忒屾秝闕","屾漆悃", "NEI:30","1200"}),
        "tongren n9"    :  ({"忒屾秝闕","憤悃", "NEI:30:_STR:2","1000"}),


        // 忒屾栠闕
        "tongren o1"    :  ({"忒屾栠闕","鐓瑞悃", "NEI:20:JING:20","1000"}),
        "tongren o2"    :  ({"忒屾栠闕","佪罣諾悃", "NEI:30:ATK:10","1000"}),
        "tongren o3"    :  ({"忒屾栠闕","嫉藷悃", "NEI:40","1000"}),
        "tongren o4"    :  ({"忒屾栠闕","嫉藷鏀悃", "JING:20:AMR:10","1000"}),
        "tongren o5"    :  ({"忒屾栠闕","毞鏀悃", "JING:30","1000"}),
        "tongren o6"    :  ({"忒屾栠闕","盓僱悃", "JING:40:JIALI:20","1000"}),
        "tongren o7"    :  ({"忒屾栠闕","壽喳悃", "JING:50:JIALI:30","1000"}),
        "tongren o8"    :  ({"忒屾栠闕","珘藷悃", "JING:60","2000"}),
        "tongren o9"    :  ({"忒屾栠闕","毞凝悃", "NEI:30","3000"}),
        "tongren o10"   :  ({"忒屾栠闕","濮唻悃", "NEI:30:MAR:50","4000"}),
        "tongren o11"   :  ({"忒屾栠闕","簫洘悃", "NEI:30","1000"}),
        "tongren o12"   :  ({"忒屾栠闕","褒呤悃", "NEI:30:DMG:10","1000"}),
        "tongren o13"   :  ({"忒屾栠闕","潛鏀悃", "QI:20","1000"}),
        "tongren o14"   :  ({"忒屾栠闕","俋壽悃", "QI:30","1000"}),
        "tongren o15"   :  ({"忒屾栠闕","侐鞃悃", "QI:40","1000"}),
        "tongren o16"   :  ({"忒屾栠闕","秏裲悃", "QI:50:_STR:1","1000"}),
        "tongren o17"   :  ({"忒屾栠闕","頗悃", "QI:60","1000"}),
        "tongren o18"   :  ({"忒屾栠闕","栠喀悃", "QI:30","4000"}),
        "tongren o19"   :  ({"忒屾栠闕","笢屙悃", "QI:30:DMG:10","10000"}),
        "tongren o20"   :  ({"忒屾栠闕","頗跁悃", "NEI:30","1000"}),
        "tongren o21"   :  ({"忒屾栠闕","栠釐悃", "NEI:30:JING:20","4000"}),


        // 逋屾秝闕
        "tongren p1"    :  ({"逋屾秝闕","湮笘悃", "POT:50:WEAPON:10","4000"}),
        "tongren p2"    :  ({"逋屾秝闕","怮洈悃", "POT:30","4000"}),
        "tongren p3"    :  ({"逋屾秝闕","嗷悃", "POT:40","4000"}),
        "tongren p4"    :  ({"逋屾秝闕","蚇悃", "POT:20:JIALI:10","4000"}),
        "tongren p5"    :  ({"逋屾秝闕","蝠陓悃", "POT:30","4000"}),
        "tongren p6"    :  ({"逋屾秝闕","桽漆悃", "POT:40","4000"}),
        "tongren p7"    :  ({"逋屾秝闕","阨悃", "POT:50:ATK:30","4000"}),
        "tongren p8"    :  ({"逋屾秝闕","筵嘎悃", "POT:60","4000"}),
        "tongren p9"    :  ({"逋屾秝闕","妀悃", "NEI:30:JIALI:20","4000"}),
        "tongren p10"   :  ({"逋屾秝闕","坒壽悃", "NEI:30","4000"}),
        "tongren p11"   :  ({"逋屾秝闕","秝飲悃", "NEI:30","4000"}),
        "tongren p12"   :  ({"逋屾秝闕","號籵嗷悃", "NEI:30:MINGSI:1","4000"}),
        "tongren p13"   :  ({"逋屾秝闕","蚅藷悃", "JING:20","4000"}),
        "tongren p14"   :  ({"逋屾秝闕","蹅貤悃", "JING:30","4000"}),
        "tongren p15"   :  ({"逋屾秝闕","笢蛁悃", "JING:40:DMG:20","12000"}),
        "tongren p16"   :  ({"逋屾秝闕","悃", "JING:20","4000"}),
        "tongren p17"   :  ({"逋屾秝闕","葩闊悃", "JING:30","4000"}),
        "tongren p18"   :  ({"逋屾秝闕","湮禎悃", "QI:10:JIALI:20","4000"}),
        "tongren p19"   :  ({"逋屾秝闕","秝嗷悃", "QI:10","4000"}),
        "tongren p20"   :  ({"逋屾秝闕","耟梅悃", "QI:10:JIALI:20","4000"}),
        "tongren p21"   :  ({"逋屾秝闕","侐雛悃", "QI:10","4000"}),
        "tongren p22"   :  ({"逋屾秝闕","朸猾悃", "QI:10","4000"}),
        "tongren p23"   :  ({"逋屾秝闕","鍾剡悃", "QI:10:WEAPON:10","4000"}),
        "tongren p24"   :  ({"逋屾秝闕","貤葬悃", "NEI:30","4000"}),
        "tongren p25"   :  ({"逋屾秝闕","朸紲悃", "NEI:30:JIALI:30","4000"}),

        // 逋屾栠闕
        "tongren q1"    :  ({"逋屾栠闕","瑞喀悃", "NEI:320:KANGDU:1","6000"}),
        "tongren q2"    :  ({"逋屾栠闕","齟諾悃", "NEI:130:FOOD:100","9000"}),
        "tongren q3"    :  ({"逋屾栠闕","芛秝悃", "NEI:340:_CON:1","6000"}),
        "tongren q4"    :  ({"逋屾栠闕","潛凝悃", "NEI:120","6000"}),
        "tongren q5"    :  ({"逋屾栠闕","栠鍬悃", "NEI:130:KANGDU:1","6000"}),
        "tongren q6"    :  ({"逋屾栠闕","腹啞悃", "NEI:130:FOOD:100","12000"}),
        "tongren q7"    :  ({"逋屾栠闕","毞喳悃", "NEI:150:WATER:100","9000"}),
        "tongren q8"    :  ({"逋屾栠闕","俇嘎悃", "NEI:160","6000"}),
        "tongren q9"    :  ({"逋屾栠闕","淏茠悃", "NEI:130:_STR:1","9000"}),
        "tongren q10"   :  ({"逋屾栠闕","醴敦悃", "NEI:130","6000"}),
        "tongren q11"   :  ({"逋屾栠闕","芛還悃", "NEI:130","25000"}),
        "tongren q12"   :  ({"逋屾栠闕","栠啞悃", "NEI:130:_STR:1","6000"}),
        "tongren q13"   :  ({"逋屾栠闕","掛朸悃", "NEI:120","6000"}),
        "tongren q14"   :  ({"逋屾栠闕","遠泐悃", "NEI:130:_CON:1","6000"}),
        "tongren q15"   :  ({"逋屾栠闕","儔藷悃", "NEI:140","9000"}),
        "tongren q16"   :  ({"逋屾栠闕","懈鏀悃", "NEI:120:_STR:1","6000"}),
        "tongren q17"   :  ({"逋屾栠闕","唻珚悃", "NEI:130","6000"}),
        "tongren q18"   :  ({"逋屾栠闕","奻壽悃", "NEI:140","9000"}),
        "tongren q19"   :  ({"逋屾栠闕","唑簫悃", "NEI:120:WATER:100","6000"}),
        "tongren q20"   :  ({"逋屾栠闕","泭頗悃", "NEI:130","6000"}),
        "tongren q21"   :  ({"逋屾栠闕","拻忺悃", "NEI:140","9000"}),
        "tongren q22"   :  ({"逋屾栠闕","逋秝悃", "NEI:150:KANGDU:1","18000"}),
        "tongren q23"   :  ({"逋屾栠闕","斖悃", "NEI:160","6000"}),
        "tongren q24"   :  ({"逋屾栠闕","唑濰悃", "NEI:130:FOOD:100","18000"}),
        "tongren q25"   :  ({"逋屾栠闕","肏赽鏀悃", "NEI:130","6000"}),
        "tongren q26"   :  ({"逋屾栠闕","湍闕悃", "NEI:120:KANGDU:1","6000"}),
        "tongren q27"   :  ({"逋屾栠闕","薹嗷悃", "NEI:130","9000"}),
        "tongren q28"   :  ({"逋屾栠闕","瑞庈悃", "NEI:140","6000"}),
        "tongren q29"   :  ({"逋屾栠闕","栠蝠悃", "NEI:120:_STR:1","6000"}),
        "tongren q30"   :  ({"逋屾栠闕","俋悃", "NEI:130","9000"}),
        "tongren q31"   :  ({"逋屾栠闕","峎耋悃", "NEI:140:FOOD:100","6000"}),
        "tongren q32"   :  ({"逋屾栠闕","堎悃", "NEI:120:WATER:100","6000"}),
        "tongren q33"   :  ({"逋屾栠闕","華拻頗悃", "NEI:130","9000"}),
        "tongren q34"   :  ({"逋屾栠闕","狨洈悃", "NEI:210:_CON:1","18000"}),
        "tongren q35"   :  ({"逋屾栠闕","剡悃", "NEI:150","6000"}),
        "tongren q36"   :  ({"逋屾栠闕","唑笘悃", "NEI:160:_STR:1","18000"}),
        "tongren q37"   :  ({"逋屾栠闕","嫖隴悃", "NEI:230","6000"}),
        "tongren q38"   :  ({"逋屾栠闕","栠落悃", "NEI:330:_CON:1","18000"}),

        // 忒栠隴闕
        "tongren r1"    :  ({"忒栠隴闕","紵鏀悃", "QI:20:ADDPOT:1000000","8000"}),
        "tongren r2"    :  ({"忒栠隴闕","忒拻爵悃", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r3"    :  ({"忒栠隴闕","喀悃", "QI:40:ADDPOT:1000000","8000"}),
        "tongren r4"    :  ({"忒栠隴闕","茩眅悃", "QI:20:ADDPOT:1000000","30000"}),
        "tongren r5"    :  ({"忒栠隴闕","旋悃", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r6"    :  ({"忒栠隴闕","操嘎悃", "QI:40:ADDPOT:1000000","8000"}),
        "tongren r7"    :  ({"忒栠隴闕","毞隋悃", "QI:50:ADDPOT:1000000","8000"}),
        "tongren r8"    :  ({"忒栠隴闕","痴芼悃", "QI:60:ADDPOT:1000000","8000"}),
        "tongren r9"    :  ({"忒栠隴闕","諳睽鏀悃", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r10"   :  ({"忒栠隴闕","磁嗷悃", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r11"   :  ({"忒栠隴闕","媼潔悃", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r12"   :  ({"忒栠隴闕","潔悃", "FOOD:30:ADDPOT:1000000","8000"}),
        "tongren r13"   :  ({"忒栠隴闕","妀栠悃", "FOOD:20:ADDPOT:1000000","8000"}),
        "tongren r14"   :  ({"忒栠隴闕","栠洈悃", "FOOD:30:ADDPOT:1000000","8000"}),
        "tongren r15"   :  ({"忒栠隴闕","忒爵悃", "FOOD:40:ADDPOT:1000000","8000"}),
        "tongren r16"   :  ({"忒栠隴闕","奻螳悃", "WATER:20:ADDPOT:1000000","8000"}),
        "tongren r17"   :  ({"忒栠隴闕","狟螳悃", "WATER:30:ADDPOT:1000000","8000"}),
        "tongren r18"   :  ({"忒栠隴闕","恲闊悃", "WATER:40:ADDPOT:1000000","8000"}),
        "tongren r19"   :  ({"忒栠隴闕","盪悃", "WATER:20:ADDPOT:1000000","8000"}),

        // 逋栠隴闕
        "tongren s1"    :  ({"逋栠隴闕","創悃", "MAR:20:FOOD:100","8000"}),
        "tongren s2"    :  ({"逋栠隴闕","侐啞悃", "MAR:30:FOOD:100","8000"}),
        "tongren s3"    :  ({"逋栠隴闕","操鏀悃", "MAR:40:FOOD:100","8000"}),
        "tongren s4"    :  ({"逋栠隴闕","華累悃", "MAR:20:FOOD:100","30000"}),
        "tongren s5"    :  ({"逋栠隴闕","狟壽悃", "MAR:30:FOOD:100","8000"}),
        "tongren s6"    :  ({"逋栠隴闕","芛峎悃", "MAR:40:FOOD:100","8000"}),
        "tongren s7"    :  ({"逋栠隴闕","茩悃", "MAR:50:FOOD:100","8000"}),
        "tongren s8"    :  ({"逋栠隴闕","阨芼悃", "MAR:60:FOOD:100","8000"}),
        "tongren s9"    :  ({"逋栠隴闕","忔悃", "NEI:30:WATER:100","8000"}),
        "tongren s10"   :  ({"逋栠隴闕","髓悃", "NEI:30:WATER:100","8000"}),
        "tongren s11"   :  ({"逋栠隴闕","誧悃", "NEI:30:WATER:100","8000"}),
        "tongren s12"   :  ({"逋栠隴闕","踱滇悃", "NEI:30:WATER:100","8000"}),
        "tongren s13"   :  ({"逋栠隴闕","湮茩悃", "JING:20:WATER:100","8000"}),
        "tongren s14"   :  ({"逋栠隴闕","挌鐓悃", "JING:30:WATER:100","8000"}),
        "tongren s15"   :  ({"逋栠隴闕","褽藷悃", "POT:40:WATER:100","8000"}),
        "tongren s16"   :  ({"逋栠隴闕","笢悃", "POT:20:ATK:10","8000"}),
        "tongren s17"   :  ({"逋栠隴闕","跦悃", "POT:30","8000"}),
        "tongren s18"   :  ({"逋栠隴闕","祥悃", "POT:40:_DEX:2","8000"}),
        "tongren s19"   :  ({"逋栠隴闕","創雛悃", "POT:20:ATK:10","8000"}),
        "tongren s20"   :  ({"逋栠隴闕","壽藷悃", "POT:30","8000"}),
        "tongren s21"   :  ({"逋栠隴闕","怮眣悃", "POT:40:DMG:10","8000"}),
        "tongren s22"   :  ({"逋栠隴闕","賑藷悃", "POT:50:JIALI:30","8000"}),
        "tongren s23"   :  ({"逋栠隴闕","毞忺悃", "POT:60","30000"}),
        "tongren s24"   :  ({"逋栠隴闕","俋鍬悃", "NEI:30:ATK:30","8000"}),
        "tongren s25"   :  ({"逋栠隴闕","湮操悃", "NEI:30","8000"}),
        "tongren s26"   :  ({"逋栠隴闕","阨耋悃", "JING:20:JIALI:50","8000"}),
        "tongren s27"   :  ({"逋栠隴闕","寥懂悃", "JING:30","8000"}),
        "tongren s28"   :  ({"逋栠隴闕","喳悃", "JING:40:AMR:10","8000"}),
        "tongren s29"   :  ({"逋栠隴闕","睦芤悃", "JING:20","8000"}),
        "tongren s30"   :  ({"逋栠隴闕","秝庈悃", "JING:30:ATK:10","8000"}),
        "tongren s31"   :  ({"逋栠隴闕","褽悃", "JING:40","8000"}),
        "tongren s32"   :  ({"逋栠隴闕","馭掏悃", "QI:20:NEI:10","8000"}),
        "tongren s33"   :  ({"逋栠隴闕","奻操剞悃", "QI:30:ATK:10","8000"}),
        "tongren s34"   :  ({"逋栠隴闕","狟操剞悃", "QI:40","8000"}),
        "tongren s35"   :  ({"逋栠隴闕","猿癒悃", "QI:50","8000"}),
        "tongren s36"   :  ({"逋栠隴闕","賤洈悃", "QI:60:JIALI:10","8000"}),
        "tongren s37"   :  ({"逋栠隴闕","喳栠悃", "QI:30","8000"}),
        "tongren s38"   :  ({"逋栠隴闕","疪嘎悃", "QI:30:ATK:10","8000"}),
        "tongren s39"    :  ({"逋栠隴闕","囀穸悃", "NEI:30:JIALI:10","8000"}),
        "tongren s40"    :  ({"逋栠隴闕","盪募悃", "NEI:30:AMR:10","8000"}),

        // 忒婽秝闕
        "tongren t1"    :  ({"忒婽秝闕","囀壽悃", "JING:50:NEI:50","8000"}),
        "tongren t2"    :  ({"忒婽秝闕","湮鍬悃", "JING:50:NEI:50","8000"}),
        "tongren t3"    :  ({"忒婽秝闕","毞悃", "JING:50:NEI:50","8000"}),
        "tongren t4"    :  ({"忒婽秝闕","潔妏悃", "JING:50:_DEX:1","30000"}),
        "tongren t5"    :  ({"忒婽秝闕","櫛僧悃", "JING:50:_DEX:1","8000"}),
        "tongren t6"    :  ({"忒婽秝闕","毞喀悃", "JING:50:_DEX:1","8000"}),
        "tongren t7"    :  ({"忒婽秝闕","屙悃", "JING:50:_DEX:1","8000"}),
        "tongren t8"    :  ({"忒婽秝闕","纇藷悃", "JING:50:MAR:50","8000"}),
        "tongren t9"    :  ({"忒婽秝闕","笢喳悃", "JING:50:MAR:50","8000"}),

        // 逋婽秝闕
        "tongren u1"    :  ({"逋婽秝闕","怮喳悃", "JING:50:DMG:20","8000"}),
        "tongren u2"    :  ({"逋婽秝闕","湮嗟悃", "JING:30:_CON:3","8000"}),
        "tongren u3"    :  ({"逋婽秝闕","俴潔悃", "JING:40","8000"}),
        "tongren u4"    :  ({"逋婽秝闕","笢飲悃", "JING:20:QI:20","30000"}),
        "tongren u5"    :  ({"逋婽秝闕","旋僱悃", "JING:30:ATK:20","8000"}),
        "tongren u6"    :  ({"逋婽秝闕","笢猾悃", "JING:40","8000"}),
        "tongren u7"    :  ({"逋婽秝闕","梒藷悃", "JING:50:_DEX:2","8000"}),
        "tongren u8"    :  ({"逋婽秝闕","逋拻爵悃", "JING:60:NEI:50","8000"}),
        "tongren u9"    :  ({"逋婽秝闕","洏壽悃", "NEI:30:_DEX:1","8000"}),
        "tongren u10"   :  ({"逋婽秝闕","悃", "JING:30:_CON:3","8000"}),
        "tongren u11"   :  ({"逋婽秝闕","摹闕悃", "JING:40:_STR:2","8000"}),
        "tongren u12"   :  ({"逋婽秝闕","秝婦悃", "JING:50","8000"}),
        "tongren u13"   :  ({"逋婽秝闕","藷悃", "JING:60:QI:20","8000"}),
        "tongren u14"   :  ({"逋婽秝闕","秝螳悃", "NEI:40:_STR:2","8000"}),
]);

// 拸靡肣牖隅堤腔苤笚毞肣蹈桶
mapping tongren_list1 = ([
                     //({ 冪闕靡, 悃弇靡ㄛ喳悃虴彆ㄛ秏瘧囀薯})
        // 秝欂闕
        "tongren a1"    :  ({"秝欂闕","嗷悃", "QI:50","100"}),
        "tongren a2"    :  ({"秝欂闕","桽漆悃", "NEI:20","150"}),
        "tongren a3"    :  ({"秝欂闕","蝠陓悃", "ATK:10","200"}),
        "tongren a4"    :  ({"秝欂闕","秝嗷悃", "DMG:10","200"}),
        "tongren a5"    :  ({"秝欂闕","筵嗷悃", "AMR:10","200"}),
        "tongren a6"    :  ({"秝欂闕","喳悃", "JIALI:50","200"}),
        "tongren a7"    :  ({"秝欂闕","跦悃", "QI:30","100"}),
        "tongren a8"    :  ({"秝欂闕","髓悃", "JING:20","200"}),
        "tongren a9"    :  ({"秝欂闕","茩悃", "MAR:10","100"}),
        "tongren a10"   :  ({"秝欂闕","隴悃", "QI:10","100"}),
        "tongren a11"   :  ({"秝欂闕","祥悃", "AMR:10","100"}),
        "tongren a12"   :  ({"秝欂闕","褽藷悃", "QI:10","100"}),
        "tongren a13"   :  ({"秝欂闕","筵掏悃", "QI:20","100"}),
        "tongren a14"   :  ({"秝欂闕","逋爵悃", "QI:30","100"}),
        "tongren a15"   :  ({"秝欂闕","猿癒悃", "QI:40","100"}),
        "tongren a16"   :  ({"秝欂闕","賤洈悃", "POT:20","100"}),
        "tongren a17"   :  ({"秝欂闕","喳栠悃", "NEI:10","100"}),
        "tongren a18"   :  ({"秝欂闕","扽募悃", "NEI:20","150"}),

        // 栠欂闕
        "tongren b1"    :  ({"栠欂闕","扠闕悃", "QI:500","300"}),
        "tongren b2"    :  ({"栠欂闕","統悃", "QI:600","300"}),
        "tongren b3"    :  ({"栠欂闕","嚾栠悃", "QI:700","500"}),
        "tongren b4"    :  ({"栠欂闕","懈鏀悃", "QI:800:AMR:10","900"}),
        "tongren b5"    :  ({"栠欂闕","貤悃", "QI:500:MAR:50","800"}),
        "tongren b6"    :  ({"栠欂闕","潛鏦悃", "QI:300","300"}),
        "tongren b7"    :  ({"栠欂闕","華嗷悃", "QI:600","300"}),
        "tongren b8"    :  ({"栠欂闕","操累悃", "QI:100","300"}),
        "tongren b9"    :  ({"栠欂闕","操鏀悃", "QI:100:ATK:10","400"}),
        "tongren b10"   :  ({"栠欂闕","創悃", "QI:400:NEI:40","400"}),
        "tongren b11"   :  ({"栠欂闕","瑞喀悃", "QI:600","300"}),
        "tongren b12"   :  ({"栠欂闕","婗罣悃", "QI:200","300"}),
        "tongren b13"   :  ({"栠欂闕","羹喳悃", "QI:400","300"}),
        "tongren b14"   :  ({"栠欂闕","船悃", "QI:700:DMG:10","1200"}),
        "tongren b15"   :  ({"栠欂闕","拻揭悃", "QI:200:DMG:10","1200"}),
        "tongren b16"   :  ({"栠欂闕","創嫖悃", "QI:800:AMR:20","2000"}),
        "tongren b17"   :  ({"栠欂闕","籵毞悃", "QI:1200","1000"}),
        "tongren b18"   :  ({"栠欂闕","釐悃", "QI:500:MAR:100","1100"}),
        "tongren b19"   :  ({"栠欂闕","迶淠悃", "QI:400:POT:200","1200"}),
        "tongren b20"   :  ({"栠欂闕","毞翐悃", "QI:800","500"}),
        "tongren b21"   :  ({"栠欂闕","創刓悃", "QI:200","200"}),
        "tongren b22"   :  ({"栠欂闕","壎贅悃", "QI:500","300"}),
        "tongren b23"   :  ({"栠欂闕","滄栨悃", "QI:400","300"}),

        // 秝峎闕
        "tongren c1"    :  ({"秝峎闕","葬忔悃", "NEI:120","800"}),
        "tongren c2"    :  ({"秝峎闕","湮筵悃", "NEI:300:QI:50","800"}),
        "tongren c3"    :  ({"秝峎闕","栠蝠悃", "NEI:100","800"}),
        "tongren c4"    :  ({"秝峎闕","號迉悃", "NEI:150","800"}),
        "tongren c5"    :  ({"秝峎闕","藷悃", "NEI:400","800"}),
        "tongren c6"    :  ({"秝峎闕","螳悃", "NEI:300","800"}),
        "tongren c7"    :  ({"秝峎闕","憤悃", "NEI:200","800"}),
        "tongren c8"    :  ({"秝峎闕","鍾悃", "NEI:800:ATK:20","4000"}),
        "tongren c9"    :  ({"秝峎闕","屾漆悃", "NEI:700:DMG:10","3400"}),
        "tongren c10"   :  ({"秝峎闕","鍾耋悃", "NEI:100:QI:100","800"}),
        "tongren c11"   :  ({"秝峎闕","籵爵悃", "NEI:200","800"}),
        "tongren c12"   :  ({"秝峎闕","秝菃悃", "NEI:700","1500"}),
        "tongren c13"   :  ({"秝峎闕","朸藷悃", "NEI:200","800"}),
        "tongren c14"   :  ({"秝峎闕","屾葬悃", "NEI:500","800"}),
        "tongren c15"   :  ({"秝峎闕","屾喳悃", "NEI:500","800"}),
        "tongren c16"   :  ({"秝峎闕","耟梅悃", "NEI:300","800"}),

        // 栠峎闕
        "tongren d1"    :  ({"栠峎闕","毞鏀悃", "POT:200","600"}),
        "tongren d2"    :  ({"栠峎闕","貤悃", "POT:100","600"}),
        "tongren d3"    :  ({"栠峎闕","潛凝悃", "POT:200:MAR:200","2000"}),
        "tongren d4"    :  ({"栠峎闕","栠蝠悃", "POT:600","600"}),
        "tongren d5"    :  ({"栠峎闕","芛峎悃", "POT:400:JING:200","3000"}),
        "tongren d6"    :  ({"栠峎闕","踢藷悃", "POT:400:NEI:200","1200"}),
        "tongren d7"    :  ({"栠峎闕","栠啞悃", "POT:300:QI:100","1000"}),
        "tongren d8"    :  ({"栠峎闕","掛朸悃", "POT:200:JING:300","2200"}),
        "tongren d9"    :  ({"栠峎闕","芛還悃", "POT:200","600"}),
        "tongren d10"   :  ({"栠峎闕","醴敦悃", "POT:500:MINGSI:1","5500"}),
        "tongren d11"   :  ({"栠峎闕","淏茠悃", "POT:500","600"}),
        "tongren d12"   :  ({"栠峎闕","齟諾悃", "POT:700:AMR:20","3500"}),
        "tongren d13"   :  ({"栠峎闕","創鍾悃", "POT:200","600"}),
        "tongren d14"   :  ({"栠峎闕","瑞喀悃", "POT:300:ATK:10","2200"}),
        "tongren d15"   :  ({"栠峎闕","瑞葬悃", "POT:500","600"}),
        "tongren d16"   :  ({"栠峎闕","挳藷悃", "POT:300","600"}),
        "tongren d17"   :  ({"栠峎闕","堁藷悃", "POT:100:NEI:200","1200"}),
        "tongren d18"   :  ({"栠峎闕","喜屙悃", "POT:100","600"}),
        "tongren d19"   :  ({"栠峎闕","謂郔悃", "POT:400:JING:200","2000"}),
        "tongren d20"   :  ({"栠峎闕","蹈悃", "POT:300","600"}),
        "tongren d21"   :  ({"栠峎闕","冪悃", "POT:600","600"}),
        "tongren d22"   :  ({"栠峎闕","怮唻悃", "POT:100:MINGSI:2","12000"}),
        "tongren d23"   :  ({"栠峎闕","赶暱悃", "POT:400","600"}),
        "tongren d24"   :  ({"栠峎闕","屾妀悃", "POT:300","600"}),

        // 湍闕
        "tongren e1"    :  ({"湍闕","湍闕悃", "QI:200:NEI:50","1000"}),
        "tongren e2"    :  ({"湍闕","拻忺悃", "ATK:20","1200"}),
        "tongren e3"    :  ({"湍闕","峎耋悃", "JIALI:50","1200"}),
        "tongren e4"    :  ({"湍闕","毞喳悃", "AMR:10","1200"}),
        "tongren e5"    :  ({"湍闕","腹啞悃", "WEAPON:10","6000"}),
        "tongren e6"    :  ({"湍闕","芛秝悃", "_INT:2","4000"}),
        "tongren e7"    :  ({"湍闕","俇嘎悃", "NEI:100","1000"}),
        "tongren e8"    :  ({"湍闕","掛朸悃", "JIALI:20","1200"}),
        "tongren e9"    :  ({"湍闕","栠啞悃", "QI:50","1000"}),
        "tongren e10"   :  ({"湍闕","芛還悃", "JIALI:20","1800"}),
        "tongren e11"   :  ({"湍闕","醴敦悃", "JIALI:30","1800"}),
        "tongren e12"   :  ({"湍闕","淏茠悃", "JIALI:40","1800"}),
        "tongren e13"   :  ({"湍闕","創鍾悃", "JIALI:10","1800"}),
        "tongren e14"   :  ({"湍闕","齟諾悃", "JIALI:60","1800"}),
        "tongren e15"   :  ({"湍闕","俋悃", "JIALI:30","1800"}),
        "tongren e16"   :  ({"湍闕","嫖隴悃", "JIALI:30","1800"}),
        "tongren e17"   :  ({"湍闕","栠落悃", "JIALI:80","1800"}),
        "tongren e18"   :  ({"湍闕","唑笘悃", "JIALI:10","1800"}),
        "tongren e19"   :  ({"湍闕","剡悃", "JIALI:40","1800"}),

        // 喳闕
        "tongren f1"    :  ({"喳闕","頗秝悃", "QI:200","1000"}),
        "tongren f2"    :  ({"喳闕","秝蝠悃", "AMR:10","1000"}),
        "tongren f3"    :  ({"喳闕","喳悃", "AMR:10","1000"}),
        "tongren f4"    :  ({"喳闕","筵嘎悃", "ATK:20","1000"}),
        "tongren f5"    :  ({"喳闕","湮禎悃", "JIALI:50","1000"}),
        "tongren f6"    :  ({"喳闕","悃", "JING:20","1000"}),
        "tongren f7"    :  ({"喳闕","侐雛悃", "JING:30","1000"}),
        "tongren f8"    :  ({"喳闕","笢蛁悃", "AMR:20","2000"}),
        "tongren f9"    :  ({"喳闕","瓣貤悃", "AMR:30","3000"}),
        "tongren f10"   :  ({"喳闕","妀悃", "AMR:40","4000"}),
        "tongren f11"   :  ({"喳闕","坒壽悃", "NEI:50","1000"}),
        "tongren f12"   :  ({"喳闕","秝飲悃", "QI:100","1000"}),
        "tongren f13"   :  ({"喳闕","籵嗷悃", "FOOD:100","1000"}),
        "tongren f14"   :  ({"喳闕","蚅藷悃", "FOOD:200","1000"}),
        "tongren f15"   :  ({"喳闕","壽藷悃", "WATER:100","1000"}),
        "tongren f16"   :  ({"喳闕","怮眣悃", "WATER:200","1000"}),
        "tongren f17"   :  ({"喳闕","寥懂悃", "ADDPOT:600000","1000"}),
        "tongren f18"   :  ({"喳闕","湮操悃", "KANGDU:1","4000"}),
        "tongren f19"   :  ({"喳闕","毞忺悃", "KANGDU:2","10000"}),
        "tongren f20"   :  ({"喳闕","忔悃", "QI:20","1000"}),
        "tongren f21"   :  ({"喳闕","阨芼悃", "AMR:40","4000"}),
        "tongren f22"   :  ({"喳闕","阨耋悃", "DMG:10","4000"}),
        "tongren f23"   :  ({"喳闕","俋鍬悃", "DMG:30","22000"}),
        "tongren f24"   :  ({"喳闕","賑藷悃", "_DEX:6","8000"}),

        // 飭俋闕
        "tongren g1"    :  ({"飭俋闕","酗悃", "JIALI:60","4000"}),
        "tongren g2"    :  ({"飭俋闕","殈貤悃", "JIALI:20","4000"}),
        "tongren g3"    :  ({"飭俋闕","栠壽韜藷悃", "JIALI:30","4000"}),
        "tongren g4"    :  ({"飭俋闕","奻俴唑忺悃", "JIALI:40","4000"}),
        "tongren g5"    :  ({"飭俋闕","撕笢悃", "JIALI:100","4000"}),
        "tongren g6"    :  ({"飭俋闕","祫笢忺悃", "JIALI:20","4000"}),
        "tongren g7"    :  ({"飭俋闕","踐坫悃", "JIALI:10","4000"}),
        "tongren g8"    :  ({"飭俋闕","祫栠寥鍾怢悃", "JIALI:40","4000"}),
        "tongren g9"    :  ({"飭俋闕","朸耋悃", "JIALI:20","4000"}),
        "tongren g10"   :  ({"飭俋闕","旯翐悃", "JIALI:30","4000"}),
        "tongren g11"   :  ({"飭俋闕","枎耋羲悃", "JIALI:40","4000"}),
        "tongren g12"   :  ({"飭俋闕","湮袢悃", "JIALI:50","4000"}),
        "tongren g13"   :  ({"飭俋闕","挳藷蟀瑞葬悃", "JIALI:60","4000"}),
        "tongren g14"   :  ({"飭俋闕","齟誧悃", "JIALI:10","4000"}),
        "tongren g15"   :  ({"飭俋闕","潔悃", "JIALI:5:DMG:10","12000"}),
        "tongren g16"   :  ({"飭俋闕","綴階齬悃", "JIALI:10","4000"}),
        "tongren g17"   :  ({"飭俋闕","啃磁悃", "JIALI:80","4000"}),
        "tongren g18"   :  ({"飭俋闕","階籵媔頗悃", "JIALI:120","4000"}),
        "tongren g19"   :  ({"飭俋闕","奻陎悃", "JIALI:30","4000"}),
        "tongren g20"   :  ({"飭俋闕","朸穸悃", "JIALI:20","4000"}),
        "tongren g21"   :  ({"飭俋闕","匼悃", "JIALI:20","4000"}),
        "tongren g22"   :  ({"飭俋闕","阨僱悃", "JIALI:10","4000"}),
        "tongren g23"   :  ({"飭俋闕","募傷悃", "JIALI:20","4000"}),
        "tongren g24"   :  ({"飭俋闕","鷏蝠悃", "JIALI:15","4000"}),

        // 俋闕
        "tongren h1"    :  ({"俋闕","嘎悃", "QI:20:_CON:2","6000"}),
        "tongren h2"    :  ({"俋闕","笢憤悃", "QI:20:_STR:2","9000"}),
        "tongren h3"    :  ({"俋闕","壽啋悃", "QI:20:_STR:1","6000"}),
        "tongren h4"    :  ({"俋闕","狟錸悃", "QI:20:_DEX:4","6000"}),
        "tongren h5"    :  ({"俋闕","笢錸悃", "NEI:20:_DEX:1","6000"}),
        "tongren h6"    :  ({"俋闕","奻錸悃", "NEI:20:_INT:2","12000"}),
        "tongren h7"    :  ({"俋闕","毞芼悃", "NEI:20:_INT:1","9000"}),
        "tongren h8"    :  ({"俋闕","螳悃", "NEI:20:_CON:4","6000"}),
        "tongren h9"    :  ({"俋闕","創蓮悃", "NEI:20:_INT:1","9000"}),
        "tongren h10"   :  ({"俋闕","湮笘悃", "JING:20:_DEX:2","6000"}),
        "tongren h11"   :  ({"俋闕","阨悃", "JING:20:_STR:5","25000"}),
        "tongren h12"   :  ({"俋闕","湮禎悃", "JING:20:_CON:1","6000"}),
        "tongren h13"   :  ({"俋闕","鍾剡悃", "JING:20:_CON:2","6000"}),
        "tongren h14"   :  ({"俋闕","凜藷悃", "MAR:20:_STR:1","6000"}),
        "tongren h15"   :  ({"俋闕","蚇悃", "MAR:20:_INT:1","9000"}),
        "tongren h16"   :  ({"俋闕","朸猾悃", "MAR:20:_DEX:2","6000"}),
        "tongren h17"   :  ({"俋闕","華儂悃", "MAR:20:_DEX:3","6000"}),
        "tongren h18"   :  ({"俋闕","悛漆悃", "POT:20:_INT:1","9000"}),
        "tongren h19"   :  ({"俋闕","號籵嗷悃", "POT:20:_STR:1","6000"}),
        "tongren h20"   :  ({"俋闕","祭檀悃", "POT:20:_DEX:2","6000"}),
        "tongren h21"   :  ({"俋闕","朸紲悃", "POT:20:_INT:1","9000"}),
        "tongren h22"   :  ({"俋闕","貤葬悃", "JIALI:20:_INT:4","18000"}),
        "tongren h23"   :  ({"俋闕","號闊悃", "JIALI:20:_CON:4","6000"}),
        "tongren h24"   :  ({"俋闕","秝鍬悃", "JIALI:20:_STR:4","18000"}),

        // 冪俋闕
        "tongren i1"    :  ({"冪俋闕","朸棲悃", "JING:20","8000"}),
        "tongren i2"    :  ({"冪俋闕","荂斻悃", "JING:30","8000"}),
        "tongren i3"    :  ({"冪俋闕","赶殈悃", "JING:40","8000"}),
        "tongren i4"    :  ({"冪俋闕","怮栠悃", "JING:500","30000"}),
        "tongren i5"    :  ({"冪俋闕","嫉潑悃", "JING:60","8000"}),
        "tongren i6"    :  ({"冪俋闕","綴悃", "NEI:30","8000"}),
        "tongren i7"    :  ({"冪俋闕","踢踩悃", "NEI:30","8000"}),
        "tongren i8"    :  ({"冪俋闕","迶珘悃", "NEI:30","8000"}),
        "tongren i9"    :  ({"冪俋闕","匐訄悃", "NEI:30","8000"}),
        "tongren i10"   :  ({"冪俋闕","侐瑜悃", "NEI:30","8000"}),
        "tongren i11"   :  ({"冪俋闕","鐓隴悃", "QI:50","8000"}),
        "tongren i12"   :  ({"冪俋闕","隅揚悃", "QI:60","8000"}),
        "tongren i13"   :  ({"冪俋闕","坋哫悃", "QI:70","8000"}),
        "tongren i14"   :  ({"冪俋闕","殈悃", "QI:80","8000"}),
        "tongren i15"   :  ({"冪俋闕","標撕悃", "QI:90","8000"}),
        "tongren i16"   :  ({"冪俋闕","媼啞悃", "QI:100","8000"}),
        "tongren i17"   :  ({"冪俋闕","殈芫萸悃", "MAR:10","8000"}),
        "tongren i18"   :  ({"冪俋闕","禍階悃", "MAR:20","8000"}),
        "tongren i19"   :  ({"冪俋闕","啃單恮悃", "MAR:30","8000"}),
        "tongren i20"   :  ({"冪俋闕","洏桉悃", "MAR:40","8000"}),
        "tongren i21"   :  ({"冪俋闕","筐黨悃", "DMG:10","30000"}),
        "tongren i22"   :  ({"冪俋闕","擊帣悃", "AMR:40","30000"}),
        "tongren i23"   :  ({"冪俋闕","匐瑞悃", "ATK:10","30000"}),
]);

// 拸靡肣牖隅堤腔湮笚毞肣蹈桶
mapping tongren_list2 = ([

                     //({ 冪闕靡, 悃弇靡ㄛ喳悃虴彆ㄛ秏瘧囀薯})
        // 忒怮秝闕
        "tongren j1"    :  ({"忒怮秝闕","屾妀悃", "QI:50","100"}),
        "tongren j2"    :  ({"忒怮秝闕","怮唻悃", "QI:30","150"}),
        "tongren j3"    :  ({"忒怮秝闕","笢葬悃", "QI:20","200"}),
        "tongren j4"    :  ({"忒怮秝闕","赶暱悃", "NEI:10","200"}),
        "tongren j5"    :  ({"忒怮秝闕","堁藷悃", "NEI:30","200"}),
        "tongren j6"    :  ({"忒怮秝闕","毞葬悃", "QI:10","200"}),
        "tongren j7"    :  ({"忒怮秝闕","冪悃", "NEI:20","100"}),
        "tongren j8"    :  ({"忒怮秝闕","喜屙悃", "JING:10","200"}),
        "tongren j9"    :  ({"忒怮秝闕","狨啞悃", "JING:10","100"}),
        "tongren j10"   :  ({"忒怮秝闕","蹈悃", "POT:100","100"}),


        // 忒怮栠闕
        "tongren k1"    :  ({"忒怮栠闕","屾屙悃", "JING:20:_INT:1","300"}),
        "tongren k2"    :  ({"忒怮栠闕","嗷悃", "JING:30","300"}),
        "tongren k3"    :  ({"忒怮栠闕","鏀悃", "JING:40","500"}),
        "tongren k4"    :  ({"忒怮栠闕","綴洈悃", "JING:80:ATK:10","900"}),
        "tongren k5"    :  ({"忒怮栠闕","勂嘎悃", "JING:60","800"}),
        "tongren k6"    :  ({"忒怮栠闕","潛鏦悃", "NEI:30","300"}),
        "tongren k7"    :  ({"忒怮栠闕","毞悃", "NEI:30:AMR:10","300"}),
        "tongren k8"    :  ({"忒怮栠闕","梂瑞悃", "NEI:30","300"}),
        "tongren k9"    :  ({"忒怮栠闕","泭僧悃", "NEI:30","400"}),
        "tongren k10"   :  ({"忒怮栠闕","潛笢貤悃", "NEI:30:JING:20","400"}),
        "tongren k11"   :  ({"忒怮栠闕","毞跁悃", "JING:20","300"}),
        "tongren k12"   :  ({"忒怮栠闕","潛俋貤悃", "JING:30","300"}),
        "tongren k13"   :  ({"忒怮栠闕","欱橾悃", "JING:40:NEI:30","300"}),
        "tongren k14"   :  ({"忒怮栠闕","栠嘎悃", "JING:50","1200"}),
        "tongren k15"   :  ({"忒怮栠闕","圊悃", "JING:60:_DEX:1","1200"}),
        "tongren k16"   :  ({"忒怮栠闕","毞敦悃", "NEI:30","2000"}),
        "tongren k17"   :  ({"忒怮栠闕","盓淏悃", "NEI:30","1000"}),
        "tongren k18"   :  ({"忒怮栠闕","貤悃", "NEI:30:_CON:1","1100"}),
        "tongren k19"   :  ({"忒怮栠闕","苤漆悃", "NEI:30","1200"}),
        "tongren k20"   :  ({"忒怮栠闕","潛淔悃", "NEI:30","500"}),


        // 逋怮秝闕
        "tongren l1"    :  ({"逋怮秝闕","悛漆悃", "QI:20:NEI:20","800"}),
        "tongren l2"    :  ({"逋怮秝闕","秝鍬悃", "QI:30:JING:10","800"}),
        "tongren l3"    :  ({"逋怮秝闕","華儂悃", "QI:40","800"}),
        "tongren l4"    :  ({"逋怮秝闕","凜藷悃", "QI:50:_DEX:1","800"}),
        "tongren l5"    :  ({"逋怮秝闕","妀悃", "QI:60","800"}),
        "tongren l6"    :  ({"逋怮秝闕","鼠呤悃", "NEI:30:POT:100","800"}),
        "tongren l7"    :  ({"逋怮秝闕","笐啞悃", "NEI:30","800"}),
        "tongren l8"    :  ({"逋怮秝闕","湮飲悃", "NEI:30:MAR:50","4000"}),
        "tongren l9"    :  ({"逋怮秝闕","怮啞悃", "NEI:30","3400"}),
        "tongren l10"   :  ({"逋怮秝闕","穢嘎悃", "NEI:30","800"}),
        "tongren l11"   :  ({"逋怮秝闕","喳藷悃", "JING:20","800"}),
        "tongren l12"   :  ({"逋怮秝闕","葬忔悃", "QI:30:DMG:10","1500"}),
        "tongren l13"   :  ({"逋怮秝闕","秝蝠悃", "JING:40","800"}),
        "tongren l14"   :  ({"逋怮秝闕","號賦悃", "QI:50","800"}),
        "tongren l15"   :  ({"逋怮秝闕","湮筵悃", "JING:60:_STR:2","800"}),
        "tongren l16"   :  ({"逋怮秝闕","號飢悃", "QI:30","800"}),
        "tongren l17"   :  ({"逋怮秝闕","妘鬄悃", "QI:30","800"}),
        "tongren l18"   :  ({"逋怮秝闕","倠盺悃", "NEI:30:AMR:10","800"}),
        "tongren l19"   :  ({"逋怮秝闕","湮婦悃", "NEI:30","1500"}),
        "tongren l20"   :  ({"逋怮秝闕","笚悃", "NEI:30","800"}),
        "tongren l21"   :  ({"逋怮秝闕","毞洈悃", "NEI:30:DMG:10","800"}),


        // 逋怮栠闕
        "tongren m1"    :  ({"逋怮栠闕","嚾栠悃", "JING:20:QI:40","600"}),
        "tongren m2"    :  ({"逋怮栠闕","壎贅悃", "JING:30:JIALI:10","600"}),
        "tongren m3"    :  ({"逋怮栠闕","隴悃", "JING:40","2000"}),
        "tongren m4"    :  ({"逋怮栠闕","滄栨悃", "JING:50","600"}),
        "tongren m5"    :  ({"逋怮栠闕","婗罣悃", "JING:60:JIALI:10","3000"}),
        "tongren m6"    :  ({"逋怮栠闕","瑞藷悃", "NEI:30","1200"}),
        "tongren m7"    :  ({"逋怮栠闕","扠悃", "NEI:30:ATK:10","1000"}),
        "tongren m8"    :  ({"逋怮栠闕","扠闕悃", "NEI:30","2200"}),
        "tongren m9"    :  ({"逋怮栠闕","船悃", "NEI:30","600"}),
        "tongren m10"   :  ({"逋怮栠闕","羹喳悃", "NEI:30:JIALI:20","5500"}),
        "tongren m11"   :  ({"逋怮栠闕","拻揭悃", "QI:20","600"}),
        "tongren m12"   :  ({"逋怮栠闕","煎貤悃", "QI:30","3500"}),
        "tongren m13"   :  ({"逋怮栠闕","踢藷悃", "QI:40","600"}),
        "tongren m14"   :  ({"逋怮栠闕","儔嘎悃", "QI:50:ATK:10","2200"}),
        "tongren m15"   :  ({"逋怮栠闕","籵毞悃", "QI:60","600"}),
        "tongren m16"   :  ({"逋怮栠闕","創嫖悃", "NEI:30","600"}),
        "tongren m17"   :  ({"逋怮栠闕","釐悃", "NEI:30","1200"}),
        "tongren m18"   :  ({"逋怮栠闕","婽秝貤悃", "NEI:30:JIALI:30","600"}),
        "tongren m19"   :  ({"逋怮栠闕","旰嘎悃", "NEI:30","2000"}),
        "tongren m20"   :  ({"逋怮栠闕","逋籵嘎悃", "NEI:30","600"}),
        "tongren m21"   :  ({"逋怮栠闕","毞翐悃", "NEI:20","600"}),
        "tongren m22"   :  ({"逋怮栠闕","迶淠悃", "POT:20","12000"}),
        "tongren m23"   :  ({"逋怮栠闕","湮蝤悃", "POT:30:AMR:10","600"}),
        "tongren m24"   :  ({"逋怮栠闕","陑貤悃", "POT:20","600"}),
        "tongren m25"   :  ({"逋怮栠闕","飭貤悃", "POT:10:DMG:10","600"}),
        "tongren m26"   :  ({"逋怮栠闕","貤悃", "POT:60","2000"}),
        "tongren m27"   :  ({"逋怮栠闕","創刓悃", "POT:10","600"}),
        "tongren m28"   :  ({"逋怮栠闕","庛貤悃", "NEI:30","600"}),
        "tongren m29"   :  ({"逋怮栠闕","奻鏀悃", "NEI:30:JIALI:20","12000"}),
        "tongren m30"   :  ({"逋怮栠闕","錴貤悃", "NEI:30","600"}),
        "tongren m31"   :  ({"逋怮栠闕","蝴貤悃", "NEI:20","600"}),
        "tongren m32"   :  ({"逋怮栠闕","漆貤悃", "JING:20","2000"}),
        "tongren m33"   :  ({"逋怮栠闕","朳貤悃", "JING:30","600"}),
        "tongren m34"   :  ({"逋怮栠闕","棒鏀悃", "JING:20","600"}),
        "tongren m35"   :  ({"逋怮栠闕","裕貤悃", "JING:10","12000"}),
        "tongren m36"   :  ({"逋怮栠闕","壽啋貤悃", "JING:60","600"}),
        "tongren m37"   :  ({"逋怮栠闕","湮釵貤悃", "NEI:30","600"}),
        "tongren m38"   :  ({"逋怮栠闕","苤釵貤悃", "NEI:30","600"}),
        "tongren m39"   :  ({"逋怮栠闕","笢鏀悃", "NEI:30:JIALI:20","2000"}),
        "tongren m40"   :  ({"逋怮栠闕","基鄶貤悃", "POT:30","600"}),
        "tongren m41"   :  ({"逋怮栠闕","啞遠貤悃", "POT:30","600"}),
        "tongren m42"   :  ({"逋怮栠闕","狟鏀悃", "POT:30","12000"}),
        "tongren m43"   :  ({"逋怮栠闕","頗栠悃", "POT:20","600"}),
        "tongren m44"   :  ({"逋怮栠闕","巹栠悃", "JING:30:DMG:10","600"}),
        "tongren m45"   :  ({"逋怮栠闕","磁栠悃", "JING:40:ATK:20","2000"}),
        "tongren m46"   :  ({"逋怮栠闕","巹笢悃", "JING:10","600"}),
        "tongren m47"   :  ({"逋怮栠闕","蜇煦悃", "JING:30","600"}),
        "tongren m48"   :  ({"逋怮栠闕","創痴悃", "NEI:30","12000"}),
        "tongren m49"   :  ({"逋怮栠闕","詮蹅悃", "NEI:30:_STR:2","600"}),
        "tongren m50"   :  ({"逋怮栠闕","誧悃", "NEI:30","600"}),
        "tongren m51"   :  ({"逋怮栠闕","蹅藷悃", "NEI:30","600"}),
        "tongren m52"   :  ({"逋怮栠闕","朸斻悃", "NEI:30","2000"}),
        "tongren m53"   :  ({"逋怮栠闕","秜藷悃", "JING:20:JIALI:40","600"}),
        "tongren m54"   :  ({"逋怮栠闕","錴壽悃", "JING:30","600"}),
        "tongren m55"   :  ({"逋怮栠闕","祩弅悃", "JING:20","12000"}),
        "tongren m56"   :  ({"逋怮栠闕","骯藷悃", "JING:50","600"}),
        "tongren m57"   :  ({"逋怮栠闕","砩忔悃", "JING:60:_INT:2","600"}),
        "tongren m58"   :  ({"逋怮栠闕","栠試悃", "NEI:30:JING:50","2000"}),

        // 忒屾秝闕
        "tongren n1"    :  ({"忒屾秝闕","秝菢悃", "JING:20:_DEX:3","1000"}),
        "tongren n2"    :  ({"忒屾秝闕","籵爵悃", "JING:30","1200"}),
        "tongren n3"    :  ({"忒屾秝闕","屾葬悃", "JING:40","1200"}),
        "tongren n4"    :  ({"忒屾秝闕","屾喳悃", "JING:50:NEI:30","1200"}),
        "tongren n5"    :  ({"忒屾秝闕","鍾耋悃", "JING:60","6000"}),
        "tongren n6"    :  ({"忒屾秝闕","朸藷悃", "NEI:30","4000"}),
        "tongren n7"    :  ({"忒屾秝闕","鍾悃", "NEI:30:_INT:2","1000"}),
        "tongren n8"    :  ({"忒屾秝闕","屾漆悃", "NEI:30","1200"}),
        "tongren n9"    :  ({"忒屾秝闕","憤悃", "NEI:30:_STR:2","1000"}),


        // 忒屾栠闕
        "tongren o1"    :  ({"忒屾栠闕","鐓瑞悃", "NEI:20:JING:20","1000"}),
        "tongren o2"    :  ({"忒屾栠闕","佪罣諾悃", "NEI:30:ATK:10","1000"}),
        "tongren o3"    :  ({"忒屾栠闕","嫉藷悃", "NEI:40","1000"}),
        "tongren o4"    :  ({"忒屾栠闕","嫉藷鏀悃", "JING:20:AMR:10","1000"}),
        "tongren o5"    :  ({"忒屾栠闕","毞鏀悃", "JING:30","1000"}),
        "tongren o6"    :  ({"忒屾栠闕","盓僱悃", "JING:40:JIALI:20","1000"}),
        "tongren o7"    :  ({"忒屾栠闕","壽喳悃", "JING:50:JIALI:30","1000"}),
        "tongren o8"    :  ({"忒屾栠闕","珘藷悃", "JING:60","2000"}),
        "tongren o9"    :  ({"忒屾栠闕","毞凝悃", "NEI:30","3000"}),
        "tongren o10"   :  ({"忒屾栠闕","濮唻悃", "NEI:30:MAR:50","4000"}),
        "tongren o11"   :  ({"忒屾栠闕","簫洘悃", "NEI:30","1000"}),
        "tongren o12"   :  ({"忒屾栠闕","褒呤悃", "NEI:30:DMG:10","1000"}),
        "tongren o13"   :  ({"忒屾栠闕","潛鏀悃", "QI:20","1000"}),
        "tongren o14"   :  ({"忒屾栠闕","俋壽悃", "QI:30","1000"}),
        "tongren o15"   :  ({"忒屾栠闕","侐鞃悃", "QI:40","1000"}),
        "tongren o16"   :  ({"忒屾栠闕","秏裲悃", "QI:50:_STR:1","1000"}),
        "tongren o17"   :  ({"忒屾栠闕","頗悃", "QI:60","1000"}),
        "tongren o18"   :  ({"忒屾栠闕","栠喀悃", "QI:30","4000"}),
        "tongren o19"   :  ({"忒屾栠闕","笢屙悃", "QI:30:DMG:10","10000"}),
        "tongren o20"   :  ({"忒屾栠闕","頗跁悃", "NEI:30","1000"}),
        "tongren o21"   :  ({"忒屾栠闕","栠釐悃", "NEI:30:JING:20","4000"}),


        // 逋屾秝闕
        "tongren p1"    :  ({"逋屾秝闕","湮笘悃", "POT:50:WEAPON:10","4000"}),
        "tongren p2"    :  ({"逋屾秝闕","怮洈悃", "POT:30","4000"}),
        "tongren p3"    :  ({"逋屾秝闕","嗷悃", "POT:40","4000"}),
        "tongren p4"    :  ({"逋屾秝闕","蚇悃", "POT:20:JIALI:10","4000"}),
        "tongren p5"    :  ({"逋屾秝闕","蝠陓悃", "POT:30","4000"}),
        "tongren p6"    :  ({"逋屾秝闕","桽漆悃", "POT:40","4000"}),
        "tongren p7"    :  ({"逋屾秝闕","阨悃", "POT:50:ATK:30","4000"}),
        "tongren p8"    :  ({"逋屾秝闕","筵嘎悃", "POT:60","4000"}),
        "tongren p9"    :  ({"逋屾秝闕","妀悃", "NEI:30:JIALI:20","4000"}),
        "tongren p10"   :  ({"逋屾秝闕","坒壽悃", "NEI:30","4000"}),
        "tongren p11"   :  ({"逋屾秝闕","秝飲悃", "NEI:30","4000"}),
        "tongren p12"   :  ({"逋屾秝闕","號籵嗷悃", "NEI:30:MINGSI:1","4000"}),
        "tongren p13"   :  ({"逋屾秝闕","蚅藷悃", "JING:20","4000"}),
        "tongren p14"   :  ({"逋屾秝闕","蹅貤悃", "JING:30","4000"}),
        "tongren p15"   :  ({"逋屾秝闕","笢蛁悃", "JING:40:DMG:20","12000"}),
        "tongren p16"   :  ({"逋屾秝闕","悃", "JING:20","4000"}),
        "tongren p17"   :  ({"逋屾秝闕","葩闊悃", "JING:30","4000"}),
        "tongren p18"   :  ({"逋屾秝闕","湮禎悃", "QI:10:JIALI:20","4000"}),
        "tongren p19"   :  ({"逋屾秝闕","秝嗷悃", "QI:10","4000"}),
        "tongren p20"   :  ({"逋屾秝闕","耟梅悃", "QI:10:JIALI:20","4000"}),
        "tongren p21"   :  ({"逋屾秝闕","侐雛悃", "QI:10","4000"}),
        "tongren p22"   :  ({"逋屾秝闕","朸猾悃", "QI:10","4000"}),
        "tongren p23"   :  ({"逋屾秝闕","鍾剡悃", "QI:10:WEAPON:10","4000"}),
        "tongren p24"   :  ({"逋屾秝闕","貤葬悃", "NEI:30","4000"}),
        "tongren p25"   :  ({"逋屾秝闕","朸紲悃", "NEI:30:JIALI:30","4000"}),

        // 逋屾栠闕
        "tongren q1"    :  ({"逋屾栠闕","瑞喀悃", "NEI:320:KANGDU:1","6000"}),
        "tongren q2"    :  ({"逋屾栠闕","齟諾悃", "NEI:130:FOOD:100","9000"}),
        "tongren q3"    :  ({"逋屾栠闕","芛秝悃", "NEI:340:_CON:1","6000"}),
        "tongren q4"    :  ({"逋屾栠闕","潛凝悃", "NEI:120","6000"}),
        "tongren q5"    :  ({"逋屾栠闕","栠鍬悃", "NEI:130:KANGDU:1","6000"}),
        "tongren q6"    :  ({"逋屾栠闕","腹啞悃", "NEI:130:FOOD:100","12000"}),
        "tongren q7"    :  ({"逋屾栠闕","毞喳悃", "NEI:150:WATER:100","9000"}),
        "tongren q8"    :  ({"逋屾栠闕","俇嘎悃", "NEI:160","6000"}),
        "tongren q9"    :  ({"逋屾栠闕","淏茠悃", "NEI:130:_STR:1","9000"}),
        "tongren q10"   :  ({"逋屾栠闕","醴敦悃", "NEI:130","6000"}),
        "tongren q11"   :  ({"逋屾栠闕","芛還悃", "NEI:130","25000"}),
        "tongren q12"   :  ({"逋屾栠闕","栠啞悃", "NEI:130:_STR:1","6000"}),
        "tongren q13"   :  ({"逋屾栠闕","掛朸悃", "NEI:120","6000"}),
        "tongren q14"   :  ({"逋屾栠闕","遠泐悃", "NEI:130:_CON:1","6000"}),
        "tongren q15"   :  ({"逋屾栠闕","儔藷悃", "NEI:140","9000"}),
        "tongren q16"   :  ({"逋屾栠闕","懈鏀悃", "NEI:120:_STR:1","6000"}),
        "tongren q17"   :  ({"逋屾栠闕","唻珚悃", "NEI:130","6000"}),
        "tongren q18"   :  ({"逋屾栠闕","奻壽悃", "NEI:140","9000"}),
        "tongren q19"   :  ({"逋屾栠闕","唑簫悃", "NEI:120:WATER:100","6000"}),
        "tongren q20"   :  ({"逋屾栠闕","泭頗悃", "NEI:130","6000"}),
        "tongren q21"   :  ({"逋屾栠闕","拻忺悃", "NEI:140","9000"}),
        "tongren q22"   :  ({"逋屾栠闕","逋秝悃", "NEI:150:KANGDU:1","18000"}),
        "tongren q23"   :  ({"逋屾栠闕","斖悃", "NEI:160","6000"}),
        "tongren q24"   :  ({"逋屾栠闕","唑濰悃", "NEI:130:FOOD:100","18000"}),
        "tongren q25"   :  ({"逋屾栠闕","肏赽鏀悃", "NEI:130","6000"}),
        "tongren q26"   :  ({"逋屾栠闕","湍闕悃", "NEI:120:KANGDU:1","6000"}),
        "tongren q27"   :  ({"逋屾栠闕","薹嗷悃", "NEI:130","9000"}),
        "tongren q28"   :  ({"逋屾栠闕","瑞庈悃", "NEI:140","6000"}),
        "tongren q29"   :  ({"逋屾栠闕","栠蝠悃", "NEI:120:_STR:1","6000"}),
        "tongren q30"   :  ({"逋屾栠闕","俋悃", "NEI:130","9000"}),
        "tongren q31"   :  ({"逋屾栠闕","峎耋悃", "NEI:140:FOOD:100","6000"}),
        "tongren q32"   :  ({"逋屾栠闕","堎悃", "NEI:120:WATER:100","6000"}),
        "tongren q33"   :  ({"逋屾栠闕","華拻頗悃", "NEI:130","9000"}),
        "tongren q34"   :  ({"逋屾栠闕","狨洈悃", "NEI:210:_CON:1","18000"}),
        "tongren q35"   :  ({"逋屾栠闕","剡悃", "NEI:150","6000"}),
        "tongren q36"   :  ({"逋屾栠闕","唑笘悃", "NEI:160:_STR:1","18000"}),
        "tongren q37"   :  ({"逋屾栠闕","嫖隴悃", "NEI:230","6000"}),
        "tongren q38"   :  ({"逋屾栠闕","栠落悃", "NEI:330:_CON:1","18000"}),

        // 忒栠隴闕
        "tongren r1"    :  ({"忒栠隴闕","紵鏀悃", "QI:20:ADDPOT:1000000","8000"}),
        "tongren r2"    :  ({"忒栠隴闕","忒拻爵悃", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r3"    :  ({"忒栠隴闕","喀悃", "QI:40:ADDPOT:1000000","8000"}),
        "tongren r4"    :  ({"忒栠隴闕","茩眅悃", "QI:20:ADDPOT:1000000","30000"}),
        "tongren r5"    :  ({"忒栠隴闕","旋悃", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r6"    :  ({"忒栠隴闕","操嘎悃", "QI:40:ADDPOT:1000000","8000"}),
        "tongren r7"    :  ({"忒栠隴闕","毞隋悃", "QI:50:ADDPOT:1000000","8000"}),
        "tongren r8"    :  ({"忒栠隴闕","痴芼悃", "QI:60:ADDPOT:1000000","8000"}),
        "tongren r9"    :  ({"忒栠隴闕","諳睽鏀悃", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r10"   :  ({"忒栠隴闕","磁嗷悃", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r11"   :  ({"忒栠隴闕","媼潔悃", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r12"   :  ({"忒栠隴闕","潔悃", "FOOD:30:ADDPOT:1000000","8000"}),
        "tongren r13"   :  ({"忒栠隴闕","妀栠悃", "FOOD:20:ADDPOT:1000000","8000"}),
        "tongren r14"   :  ({"忒栠隴闕","栠洈悃", "FOOD:30:ADDPOT:1000000","8000"}),
        "tongren r15"   :  ({"忒栠隴闕","忒爵悃", "FOOD:40:ADDPOT:1000000","8000"}),
        "tongren r16"   :  ({"忒栠隴闕","奻螳悃", "WATER:20:ADDPOT:1000000","8000"}),
        "tongren r17"   :  ({"忒栠隴闕","狟螳悃", "WATER:30:ADDPOT:1000000","8000"}),
        "tongren r18"   :  ({"忒栠隴闕","恲闊悃", "WATER:40:ADDPOT:1000000","8000"}),
        "tongren r19"   :  ({"忒栠隴闕","盪悃", "WATER:20:ADDPOT:1000000","8000"}),

        // 逋栠隴闕
        "tongren s1"    :  ({"逋栠隴闕","創悃", "MAR:20:FOOD:100","8000"}),
        "tongren s2"    :  ({"逋栠隴闕","侐啞悃", "MAR:30:FOOD:100","8000"}),
        "tongren s3"    :  ({"逋栠隴闕","操鏀悃", "MAR:40:FOOD:100","8000"}),
        "tongren s4"    :  ({"逋栠隴闕","華累悃", "MAR:20:FOOD:100","30000"}),
        "tongren s5"    :  ({"逋栠隴闕","狟壽悃", "MAR:30:FOOD:100","8000"}),
        "tongren s6"    :  ({"逋栠隴闕","芛峎悃", "MAR:40:FOOD:100","8000"}),
        "tongren s7"    :  ({"逋栠隴闕","茩悃", "MAR:50:FOOD:100","8000"}),
        "tongren s8"    :  ({"逋栠隴闕","阨芼悃", "MAR:60:FOOD:100","8000"}),
        "tongren s9"    :  ({"逋栠隴闕","忔悃", "NEI:30:WATER:100","8000"}),
        "tongren s10"   :  ({"逋栠隴闕","髓悃", "NEI:30:WATER:100","8000"}),
        "tongren s11"   :  ({"逋栠隴闕","誧悃", "NEI:30:WATER:100","8000"}),
        "tongren s12"   :  ({"逋栠隴闕","踱滇悃", "NEI:30:WATER:100","8000"}),
        "tongren s13"   :  ({"逋栠隴闕","湮茩悃", "JING:20:WATER:100","8000"}),
        "tongren s14"   :  ({"逋栠隴闕","挌鐓悃", "JING:30:WATER:100","8000"}),
        "tongren s15"   :  ({"逋栠隴闕","褽藷悃", "POT:40:WATER:100","8000"}),
        "tongren s16"   :  ({"逋栠隴闕","笢悃", "POT:20:ATK:10","8000"}),
        "tongren s17"   :  ({"逋栠隴闕","跦悃", "POT:30","8000"}),
        "tongren s18"   :  ({"逋栠隴闕","祥悃", "POT:40:_DEX:2","8000"}),
        "tongren s19"   :  ({"逋栠隴闕","創雛悃", "POT:20:ATK:10","8000"}),
        "tongren s20"   :  ({"逋栠隴闕","壽藷悃", "POT:30","8000"}),
        "tongren s21"   :  ({"逋栠隴闕","怮眣悃", "POT:40:DMG:10","8000"}),
        "tongren s22"   :  ({"逋栠隴闕","賑藷悃", "POT:50:JIALI:30","8000"}),
        "tongren s23"   :  ({"逋栠隴闕","毞忺悃", "POT:60","30000"}),
        "tongren s24"   :  ({"逋栠隴闕","俋鍬悃", "NEI:30:ATK:30","8000"}),
        "tongren s25"   :  ({"逋栠隴闕","湮操悃", "NEI:30","8000"}),
        "tongren s26"   :  ({"逋栠隴闕","阨耋悃", "JING:20:JIALI:50","8000"}),
        "tongren s27"   :  ({"逋栠隴闕","寥懂悃", "JING:30","8000"}),
        "tongren s28"   :  ({"逋栠隴闕","喳悃", "JING:40:AMR:10","8000"}),
        "tongren s29"   :  ({"逋栠隴闕","睦芤悃", "JING:20","8000"}),
        "tongren s30"   :  ({"逋栠隴闕","秝庈悃", "JING:30:ATK:10","8000"}),
        "tongren s31"   :  ({"逋栠隴闕","褽悃", "JING:40","8000"}),
        "tongren s32"   :  ({"逋栠隴闕","馭掏悃", "QI:20:NEI:10","8000"}),
        "tongren s33"   :  ({"逋栠隴闕","奻操剞悃", "QI:30:ATK:10","8000"}),
        "tongren s34"   :  ({"逋栠隴闕","狟操剞悃", "QI:40","8000"}),
        "tongren s35"   :  ({"逋栠隴闕","猿癒悃", "QI:50","8000"}),
        "tongren s36"   :  ({"逋栠隴闕","賤洈悃", "QI:60:JIALI:10","8000"}),
        "tongren s37"   :  ({"逋栠隴闕","喳栠悃", "QI:30","8000"}),
        "tongren s38"   :  ({"逋栠隴闕","疪嘎悃", "QI:30:ATK:10","8000"}),
        "tongren s39"    :  ({"逋栠隴闕","囀穸悃", "NEI:30:JIALI:10","8000"}),
        "tongren s40"    :  ({"逋栠隴闕","盪募悃", "NEI:30:AMR:10","8000"}),

        // 忒婽秝闕
        "tongren t1"    :  ({"忒婽秝闕","囀壽悃", "JING:50:NEI:50","8000"}),
        "tongren t2"    :  ({"忒婽秝闕","湮鍬悃", "JING:50:NEI:50","8000"}),
        "tongren t3"    :  ({"忒婽秝闕","毞悃", "JING:50:NEI:50","8000"}),
        "tongren t4"    :  ({"忒婽秝闕","潔妏悃", "JING:50:_DEX:1","30000"}),
        "tongren t5"    :  ({"忒婽秝闕","櫛僧悃", "JING:50:_DEX:1","8000"}),
        "tongren t6"    :  ({"忒婽秝闕","毞喀悃", "JING:50:_DEX:1","8000"}),
        "tongren t7"    :  ({"忒婽秝闕","屙悃", "JING:50:_DEX:1","8000"}),
        "tongren t8"    :  ({"忒婽秝闕","纇藷悃", "JING:50:MAR:50","8000"}),
        "tongren t9"    :  ({"忒婽秝闕","笢喳悃", "JING:50:MAR:50","8000"}),

        // 逋婽秝闕
        "tongren u1"    :  ({"逋婽秝闕","怮喳悃", "JING:50:DMG:20","8000"}),
        "tongren u2"    :  ({"逋婽秝闕","湮嗟悃", "JING:30:_CON:3","8000"}),
        "tongren u3"    :  ({"逋婽秝闕","俴潔悃", "JING:40","8000"}),
        "tongren u4"    :  ({"逋婽秝闕","笢飲悃", "JING:20:QI:20","30000"}),
        "tongren u5"    :  ({"逋婽秝闕","旋僱悃", "JING:30:ATK:20","8000"}),
        "tongren u6"    :  ({"逋婽秝闕","笢猾悃", "JING:40","8000"}),
        "tongren u7"    :  ({"逋婽秝闕","梒藷悃", "JING:50:_DEX:2","8000"}),
        "tongren u8"    :  ({"逋婽秝闕","逋拻爵悃", "JING:60:NEI:50","8000"}),
        "tongren u9"    :  ({"逋婽秝闕","洏壽悃", "NEI:30:_DEX:1","8000"}),
        "tongren u10"   :  ({"逋婽秝闕","悃", "JING:30:_CON:3","8000"}),
        "tongren u11"   :  ({"逋婽秝闕","摹闕悃", "JING:40:_STR:2","8000"}),
        "tongren u12"   :  ({"逋婽秝闕","秝婦悃", "JING:50","8000"}),
        "tongren u13"   :  ({"逋婽秝闕","藷悃", "JING:60:QI:20","8000"}),
        "tongren u14"   :  ({"逋婽秝闕","秝螳悃", "NEI:40:_STR:2","8000"}),
]);

string effect_desc(string effect)
{
        string *tmp;
        int n, i;
        string msg;

        msg = "";
        tmp = explode(effect, ":");
        n = sizeof(tmp);

        if( !n )return "帤隅砱";

        for( i = 1; i <= n;i += 2 )
        {
                switch(tmp[i-1])
                {
                        case "QI":
                                msg += "枑汔悛奻癹ㄩ" + tmp[i] + "萸﹜";
                                break;
                        case "NEI":
                                msg += "枑汔囀薯奻癹ㄩ" + tmp[i] + "萸﹜";
                                break;
                        case "ATK":
                                msg += "枑汔韜笢脹撰ㄩ+" + tmp[i];
                                break;
                        case "DMG":
                                msg += "枑汔夼漲脹撰ㄩ+" + tmp[i];
                                break;
                        case "AMR":
                                msg += "枑汔滅誘脹撰ㄩ+" + tmp[i] + "萸﹜";
                                break;
                        case "JIALI":
                                msg += "枑汔樓薯奻癹ㄩ" + tmp[i] + "萸﹜";
                                break;
                        case "JING":
                                msg += "枑汔儕薯奻癹ㄩ" + tmp[i] + "萸﹜";
                                break;
                        case "MAR":
                                msg += "枑汔极頗奻癹ㄩ" + tmp[i] + "萸﹜";
                                break;
                        case "POT":
                                msg += "枑汔夔奻癹ㄩ" + tmp[i] + "萸﹜";
                                break;
                        case "MINGSI":
                                msg += "枑汔琱佷虴薹ㄩ+" + tmp[i] + "%﹜";
                                break;
                        case "FOOD":
                                msg += "枑汔妘昜奻癹ㄩ" + tmp[i] + "萸﹜";
                                break;
                        case "WATER":
                                msg += "枑汔窊阨奻癹ㄩ" + tmp[i] + "萸﹜";
                                break;
                        case "KANGDU":
                                msg += "枑汔蕨馮夔薯ㄩ+" + tmp[i] + "%﹜";
                                break;
                        case "_STR":
                                msg += "枑汔綴毞旋薯ㄩ+" + tmp[i];
                                break;
                        case "_DEX":
                                msg += "枑汔綴毞旯楊ㄩ+" + tmp[i];
                                break;
                        case "_INT":
                                msg += "枑汔綴毞昳俶ㄩ+" + tmp[i];
                                break;
                        case "_CON":
                                msg += "枑汔綴毞跦嘎ㄩ+" + tmp[i];
                                break;
                        case "STR":
                                msg += "枑汔珂毞旋薯ㄩ+" + tmp[i];
                                break;
                        case "DEX":
                                msg += "枑汔珂毞旯楊ㄩ+" + tmp[i];
                                break;
                        case "INT":
                                msg += "枑汔珂毞昳俶ㄩ+" + tmp[i];
                                break;
                        case "CON":
                                msg += "枑汔珂毞跦嘎ㄩ+" + tmp[i];
                                break;
                        case "WEAPON":
                                msg += "枑汔條夼漲ㄩ+" + tmp[i] + "%﹜";
                                break;
                        case "ADDPOT":
                                msg += "喳悃綴鳳夔ㄩ" + tmp[i] + "萸﹜";
                                break;
                        default:
                                return "帤隅砱﹝";

                }
        }
        return msg;
}

void add_chongxue_effect(object me, string effect)
{
        string *tmp;
        int n, i, p;

        tmp = explode(effect, ":");
        n = sizeof(tmp);

        if( !n )
                return;

        // 藩喳羲珨悃鳳10勀ㄛ3勀极頗
        addn("potential", 100000, me);
        addn("experience", 30000, me);
        write(HIC "喳悃虴彆ㄩ" + effect_desc(effect) + "\n" NOR);
        write(HIY "喳悃蔣療ㄩ坋勀萸夔摯勀萸妗桵极頗﹝\n" NOR);

        // 崝樓虴彆
        for( i = 1; i <= n; i += 2 )
        {
                sscanf(tmp[i], "%d", p);

                switch(tmp[i-1])
                {
                        case "QI":
                                addn("jingmai/qi", p, me);
                                break;
                        case "NEI":
                                addn("jingmai/neili", p, me);
                                break;
                        case "ATK":
                                addn("jingmai/attack", p, me);
                                break;
                        case "DMG":
                                addn("jingmai/damage", p, me);
                                break;
                        case "AMR":
                                addn("jingmai/armor", p, me);
                                break;
                        case "JIALI":
                                addn("jingmai/jiali", p, me);
                                break;
                        case "JING":
                                addn("jingmai/jing", p, me);
                        case "MAR":
                                addn("jingmai/mar", p, me);
                                break;
                        case "POT":
                                addn("jingmai/pot", p, me);
                                break;
                        case "MINGSI":
                                addn("jingmai/reflect", p, me);
                                break;
                        case "FOOD":
                                addn("jingmai/food", p, me);
                                break;
                        case "WATER":
                                addn("jingmai/water", p, me);
                                break;
                        case "KANGDU":
                                addn("jingmai/avoid_poison", p, me);
                                break;
                        case "_STR":
                                addn("jingmai/str", p, me);
                                break;
                        case "_DEX":
                                addn("jingmai/dex", p, me);
                                break;
                        case "_INT":
                                addn("jingmai/int", p, me);
                                break;
                        case "_CON":
                                addn("jingmai/con", p, me);
                                break;
                        case "STR":
                                addn("str", p, me);
                                break;
                        case "DEX":
                                addn("dex", p, me);
                                break;
                        case "INT":
                                addn("int", p, me);
                                break;
                        case "CON":
                                addn("con", p, me);
                                break;
                        case "WEAPON":
                                addn("jingmai/weapon", p, me);
                                break;
                        case "ADDPOT":
                                addn("potential", p, me);
                                break;
                        default:
                                write("default error.\n");
                                return;
                }
        }
}

// 袚樓籵闕虴彆
void add_jingmai_effect(object me, string jing)
{
        switch( jing )
        {
                case "秝欂闕":
                        addn("jingmai/qi", 600, me);
                        addn("jingmai/neili", 200, me);
                        addn("jingmai/jingli", 200, me);
                        addn("jingmai/pot", 400, me);
                        addn("jingmai/damage", 20, me);
                        addn("jingmai/kar", 1, me);

                        MYGIFT_D->check_mygift(me, "newbie_mygift/yinqiaomai");
                        break;

                case "栠欂闕":
                        addn("jingmai/qi", 20000, me);
                        addn("jingmai/neili", 800, me);
                        addn("jingmai/jingli", 600, me);
                        addn("jingmai/pot", 1000, me);
                        addn("jingmai/mar", 200, me);
                        addn("jingmai/armor", 50, me);
                        addn("jingmai/damage", 40, me);
                        addn("jingmai/magic_find", 1, me);
                        break;

                case "秝峎闕":
                        addn("jingmai/qi", 1000, me);
                        addn("jingmai/neili", 5000, me);
                        addn("jingmai/mar", 1000, me);
                        addn("jingmai/attack", 40, me);
                        addn("jingmai/damage", 20, me);
                        break;

                case "栠峎闕":
                        addn("jingmai/qi", 500, me);
                        addn("jingmai/neili", 500, me);
                        addn("jingmai/mar", 4000, me);
                        addn("jingmai/pot", 10000, me);
                        addn("jingmai/research_times", 100, me);
                        addn("jingmai/research_effect", 5, me);
                        addn("jingmai/derive_effect", 10, me);
                        addn("jingmai/reflect", 3, me);
                        break;

                case "湍闕":
                        addn("jingmai/qi", 500, me);
                        addn("jingmai/neili", 500, me);
                        addn("jingmai/jingli", 500, me);
                        addn("jingmai/jiali", 400, me);
                        addn("jingmai/damage", 100, me);
                        addn("jingmai/armor", 120, me);
                        addn("jingmai/attack", 120, me);
                        addn("jingmai/magic_find", 1, me);
                        addn("jingmai/kar", 1, me);
                        break;

                case "喳闕":
                        addn("jingmai/qi", 4000, me);
                        addn("jingmai/neili", 200, me);
                        addn("jingmai/jingli", 600, me);
                        addn("jingmai/damage", 20, me);
                        addn("jingmai/armor", 200, me);
                        break;

                case "飭俋闕":
                        addn("jingmai/qi", 300, me);
                        addn("jingmai/neili", 200, me);
                        addn("jingmai/damage", 300, me);
                        addn("jingmai/attack", 300, me);
                        addn("jingmai/jiali", 1000, me);
                        break;

                case "俋闕":
                        addn("jingmai/qi", 200, me);
                        addn("jingmai/neili", 100, me);
                        addn("jingmai/jingli", 100, me);
                        addn("jingmai/mar", 600, me);
                        addn("jingmai/pot", 200, me);
                        addn("jingmai/str", 60, me);
                        addn("jingmai/dex", 60, me);
                        addn("jingmai/con", 60, me);
                        addn("jingmai/int", 60, me);
                        addn("add_max_encumbrance", 100000, me);
                        break;

                case "冪俋闕":
                        addn("jingmai/qi", 20000, me);
                        addn("jingmai/neili", 10000, me);
                        addn("jingmai/jingli", 5000, me);
                        addn("jingmai/mar", 5000, me);
                        addn("jingmai/damage", 100, me);
                        addn("jingmai/armor", 100, me);
                        addn("jingmai/attack", 100, me);
                        addn("jingmai/magic_find", 2, me);
                        addn("jingmai/kar", 2, me);
                        //me->add("str", 1);
                        //me->add("dex", 1);
                        //me->add("con", 1);
                        addn("int", 1, me);
                        break;

                case "忒怮秝闕":
                        addn("jingmai/qi", 800, me);
                        addn("jingmai/neili", 400, me);
                        addn("jingmai/jingli", 400, me);
                        addn("jingmai/pot", 10000, me);
                        addn("jingmai/damage", 30, me);
                        addn("jingmai/attack", 40, me);
                        addn("jingmai/armor", 40, me);
                        break;

                case "忒怮栠闕":
                        addn("jingmai/qi", 2000, me);
                        addn("jingmai/neili", 1000, me);
                        addn("jingmai/jingli", 1000, me);
                        addn("jingmai/pot", 10000, me);
                        addn("jingmai/magic_find", 2, me);
                        addn("jingmai/damage", 50, me);
                        addn("jingmai/str", 10, me);
                        addn("jingmai/dex", 12, me);

                        break;

                case "逋怮秝闕":
                        addn("jingmai/qi", 2000, me);
                        addn("jingmai/jingli", 1000, me);
                        addn("jingmai/neili", 2000, me);
                        addn("jingmai/pot", 30000, me);
                        addn("jingmai/damage", 50, me);
                        addn("jingmai/kar", 2, me);
                        addn("jingmai/str", 10, me);
                        addn("jingmai/con", 12, me);

                        break;

                case "逋怮栠闕":
                        addn("jingmai/qi", 20000, me);
                        addn("jingmai/jingli", 10000, me);
                        addn("jingmai/neili", 10000, me);
                        addn("jingmai/pot", 100000, me);
                        addn("jingmai/mar", 50000, me);
                        addn("jingmai/kar", 4, me);
                        addn("jingmai/magic_find", 4, me);
                        addn("jingmai/damage", 400, me);
                        addn("jingmai/attack", 200, me);
                        //me->add("int", 3);
                        //me->add("dex", 1);
                        addn("str", 1, me);
                        //me->add("con", 1);

                        break;

                case "忒屾秝闕":
                        addn("jingmai/qi", 1000, me);
                        addn("jingmai/neili", 400, me);
                        addn("jingmai/jingli", 400, me);
                        addn("jingmai/pot", 2000, me);
                        addn("jingmai/armor", 100, me);
                        addn("jingmai/str", 6, me);
                        addn("jingmai/int", 6, me);
                        addn("jingmai/dex", 6, me);
                        addn("jingmai/con", 6, me);

                        break;

                case "忒屾栠闕":
                        addn("jingmai/qi", 2000, me);
                        addn("jingmai/neili", 5000, me);
                        addn("jingmai/jingli", 5000, me);
                        addn("jingmai/pot", 5000, me);
                        addn("jingmai/mar", 3000, me);
                        addn("jingmai/research_effect", 8, me);
                        break;

                case "逋屾秝闕":
                        addn("jingmai/qi", 3000, me);
                        addn("jingmai/neili", 3000, me);
                        addn("jingmai/jingli", 2000, me);
                        addn("jingmai/pot", 1000, me);
                        addn("jingmai/mar", 10000, me);
                        addn("jingmai/derive_effect", 15, me);
                        addn("jingmai/reflect", 5, me);
                        addn("add_max_encumbrance", 200000, me);

                        break;

                case "逋屾栠闕":
                        addn("jingmai/qi", 10000, me);
                        addn("jingmai/neili", 5000, me);
                        addn("jingmai/jingli", 4000, me);
                        addn("jingmai/mar", 5000, me);
                        addn("jingmai/pot", 4000, me);
                        addn("jingmai/jiali", 500, me);
                        addn("jingmai/damage", 200, me);
                        addn("jingmai/attack", 150, me);
                        addn("jingmai/defense", 150, me);

                        break;

                case "忒栠隴闕":
                        addn("jingmai/qi", 2000, me);
                        addn("jingmai/neili", 2000, me);
                        addn("jingmai/jingli", 2000, me);
                        addn("jingmai/mar", 2000, me);
                        addn("jingmai/pot", 5000, me);
                        addn("jingmai/jiali", 200, me);
                        addn("jingmai/damage", 40, me);
                        addn("jingmai/attack", 40, me);
                        addn("jingmai/magic_find", 1, me);
                        addn("jingmai/kar", 1, me);

                        break;

                case "逋栠隴闕":
                        addn("jingmai/qi", 10000, me);
                        addn("jingmai/neili", 10000, me);
                        addn("jingmai/jingli", 10000, me);
                        addn("jingmai/mar", 20000, me);
                        addn("jingmai/pot", 20000, me);
                        addn("jingmai/jiali", 500, me);
                        addn("jingmai/damage", 200, me);
                        addn("jingmai/attack", 200, me);
                        addn("jingmai/str", 60, me);
                        addn("jingmai/dex", 60, me);
                        addn("jingmai/int", 60, me);
                        addn("jingmai/con", 60, me);

                        break;

                case "忒婽秝闕":
                        addn("jingmai/qi", 1000, me);
                        addn("jingmai/neili", 1000, me);
                        addn("jingmai/jingli", 1000, me);
                        addn("jingmai/pot", 1000, me);
                        addn("jingmai/armor", 50, me);
                        addn("jingmai/attack", 100, me);
                        addn("jingmai/str", 20, me);
                        break;

                case "逋婽秝闕":
                        addn("jingmai/qi", 10000, me);
                        addn("jingmai/neili", 2000, me);
                        addn("jingmai/jingli", 2000, me);
                        addn("jingmai/mar", 2000, me);
                        addn("jingmai/pot", 2000, me);
                        addn("jingmai/damage", 60, me);
                        addn("jingmai/attack", 60, me);
                        addn("jingmai/str", 20, me);
                        addn("add_max_encumbrance", 100000, me);
                        break;

                default:
                        write("冪闕渣昫ㄩ" + jing + "\n");
                        break;
        }

        write(HIR "鳩炰斕ㄛ湖籵賸" + HIY + jing + HIR "﹝\n" NOR);

        // 炵苀籵豢
        CHANNEL_D->do_channel(this_object(), "rumor", "鳩炰" + HIY + me->name() + HIM "湖籵賸" + HIR +
                                                      jing + HIM "﹝\n");
        return;
}

// 潰脤湮苤笚毞岆瘁掩湖籵
int check_zhoutian(object me, string jing)
{
        int i, flag = 0;

        if( !query("x_zhoutian", me) )
        {
                for( i=0; i<sizeof(x_zhoutian); i++ )
                        if( !query("jingmai/"+x_zhoutian[i]+"/chongxue_ok", me) )
                        {
                                flag = 1;
                                break;
                        }

                if( !flag )
                {
                        set("x_zhoutian", 1, me);
                        write(HIR "鳩炰斕ㄛ湖籵賸" + HIY + "苤笚毞冪闕" + HIR "﹝\n" NOR);
                        addn("potential", 1000000, me);
                        addn("experience", 300000, me);
                        addn("jingmai/research_effect", 30, me);
                        addn("jingmai/derive_effect", 30, me);
                        addn("jingmai/practice_effect", 30, me);
                        write(HIY "湖籵苤笚毞蔣療ㄩ珨啃勀萸夔摯坋勀萸妗桵极頗﹝\n" NOR);

                        // 炵苀籵豢
                        CHANNEL_D->do_channel(this_object(), "rumor", "鳩炰" + HIY + me->name() + HIM "湖籵賸" + HIR +
                                              "苤笚毞冪闕" + HIM "ㄛ髡薯芼滄襖輛﹝\n");
                }
        }

        flag = 0;
        if( !query("d_zhoutian", me) )
        {
                for( i=0; i<sizeof(d_zhoutian); i++ )
                        if( !query("jingmai/"+d_zhoutian[i]+"/chongxue_ok", me) )
                        {
                                flag = 1;
                                break;
                        }

                if( !flag )
                {
                        set("d_zhoutian", 1, me);
                        write(HIR "鳩炰斕ㄛ湖籵賸" + HIY + "湮笚毞冪闕" + HIR "﹝\n" NOR);

                        addn("potential", 2000000, me);
                        addn("experience", 600000, me);
                        addn("jingmai/research_effect", 50, me);
                        addn("jingmai/derive_effect", 50, me);
                        addn("jingmai/practice_effect", 50, me);
                        write(HIY "湖籵湮笚毞蔣療ㄩ媼啃勀萸夔摯鞠坋勀萸妗桵极頗﹝\n" NOR);

                        // 炵苀籵豢
                        CHANNEL_D->do_channel(this_object(), "rumor", "鳩炰" + HIY + me->name() + HIM "湖籵賸" + HIR +
                                              "湮笚毞冪闕" + HIM "ㄛ髡薯輛陔腔噫賜﹝\n");
                }
        }

        if( query("breakup", me))return 1;

        if( query("x_zhoutian", me) && query("d_zhoutian", me) )
        {
                set("breakup", 1, me);
                delete("jingmai", me);
                set("jingmai/finish", 1, me);
                write(HIR "鳩炰斕ㄛ湖籵賸" + HIY + "旯湮苤笚毞冪闕" + HIR "﹝\n" NOR);

                addn("potential", 10000000, me);
                addn("experience", 3000000, me);
                /*
                addn("jingmai/research_effect", 100, me);
                addn("jingmai/derive_effect", 100, me);
                addn("jingmai/practice_effect", 100, me);
                addn("jingmai/reduce_damage", 10, me);
                */
                write(HIY "湖籵湮苤笚毞蔣療ㄩ珨勀萸夔摯啃勀萸妗桵极頗﹝\n" NOR);

                // 炵苀籵豢
                CHANNEL_D->do_channel(this_object(), "rumor", "鳩炰" + HIY + me->name() + HIM "湖籵賸" + HIR +
                                      "旯湮苤笚毞冪闕" + HIM "ㄛ髡薯眒朸﹝\n");
                return 1;
        }

        return 0;
}

// 潰脤硌隅冪闕岆瘁掩湖籵
int check_jingmai(object me, string jing)
{
        int n;

        if( !query("jingmai/"+jing, me) )
                return 0;

        n=sizeof(keys(query("jingmai/"+jing, me)));

        switch( jing )
        {
                case "秝欂闕":
                        if( n < 18 ) return 0;
                        break;

                case "栠欂闕":
                        if( n < 23 ) return 0;
                        break;

                case "秝峎闕":
                        if( n < 16 ) return 0;
                        break;

                case "栠峎闕":
                        if( n < 24 ) return 0;
                        break;

                case "湍闕":
                        if( n < 19 ) return 0;
                        break;

                case "喳闕":
                        if( n < 24 ) return 0;
                        break;

                case "飭俋闕":
                        if( n < 24 ) return 0;
                        break;

                case "俋闕":
                        if( n < 24 ) return 0;
                        break;

                case "冪俋闕":
                        if( n < 23 ) return 0;
                        break;

                case "忒怮秝闕":
                        if( n < 10 ) return 0;
                        break;

                case "忒怮栠闕":
                        if( n < 20 ) return 0;
                        break;

                case "逋怮秝闕":
                        if( n < 21 ) return 0;
                        break;

                case "逋怮栠闕":
                        if( n < 58 ) return 0;
                        break;

                case "忒屾秝闕":
                        if( n < 9 )  return 0;
                        break;

                case "忒屾栠闕":
                        if( n < 21 ) return 0;
                        break;

                case "逋屾秝闕":
                        if( n < 25 ) return 0;
                        break;

                case "逋屾栠闕":
                        if( n < 38 ) return 0;
                        break;

                case "忒栠隴闕":
                        if( n < 19 ) return 0;
                        break;

                case "逋栠隴闕":
                        if( n < 40 ) return 0;
                        break;

                case "忒婽秝闕":
                        if( n < 9 )  return 0;
                        break;

                case "逋婽秝闕":
                        if( n < 14 ) return 0;
                        break;

                default:
                        write("冪闕靡趼渣昫ㄩ" + jing + "\n");
                        return 0;
        }

        set("jingmai/"+jing+"/chongxue_ok", 1, me);
        add_jingmai_effect(me, jing);
        check_zhoutian(me, jing);
        return 1;
}

int do_chongxue(object me, object tongren_ob)
{
        string jing, xue;
        string effect;
        string tongren_id;

        jing=query("jingmai_name", tongren_ob);
        xue=query("xuewei_name", tongren_ob);
        tongren_id=query("id", tongren_ob);

        if( query("jingmai/"+jing+"/"+tongren_id, me) )
                return notify_fail(xue + "眒冪掩湖籵賸﹝\n");

        if( query("neili", me)<query("cost_neili", tongren_ob) )
                return notify_fail("斕絞囀薯硉祥逋ㄛ祥逋眕喳悃﹝\n");

        message_vision( HIC "芼$N" HIC "湮瘓珨汒ㄛ珨嘖拸倛檢"
                        HIC "飧汃票羲懂ㄛ侐笚諾腎奀曹腕孲﹝\n" NOR, me);
        tell_object(me, HIG "斕嗨奀橇腕骰旯珨淝侂ㄛ珨嘖褸眳砩蚐"
                        HIG "奧ㄛ陑鍾珨諾隴ㄛ囀薯羶衄佪瑭郯笴ㄛ" + xue +"眒釧籵ㄛ戺怍眳憤﹝\n" NOR);

        addn("neili", -1*query("cost_neili", tongren_ob), me);

        // 暮翹喳悃杅擂
        set("jingmai/"+jing+"/"+tongren_id, 1, me);

        // 枑尨
        write(HIG "鳩炰斕ㄛ喳悃傖髡ㄐ\n" NOR);

/*
        CHANNEL_D->do_channel(this_object(), "rumor", "泭佽" + HIY + me->name() + HIM "喳羲賸" + HIY +
                                                       jing + "﹞" + xue + HIM "﹝\n");
*/

        // 鳳喳悃虴彆統杅
        effect=query("chongxue_xiaoguo", tongren_ob);

        // 种障肣
        destruct(tongren_ob);

        // 覃蚚喳悃傖髡滲杅崝樓虴彆
        add_chongxue_effect(me, effect);
        check_jingmai(me, jing);

        me->save();
        return 1;
}

// 殿隙硌隅冪闕腔垀衄悃弇,跡宒 ([ 悃弇靡1:悃弇ID1..])
mapping query_xuewei(string jing)
{
        mapping result;
        int i;
        string *key, *tmp;

        key = keys(tongren_list);
        result = ([]);

        for( i = 0; i < sizeof(key); i ++ )
        {
                tmp = tongren_list[key[i]];
                if( tmp[0] == jing )
                        result += ([tmp[1]:key[i]]);
        }

        return result;
}

// 脤艘冪闕喳悃錶
void show_jingmai(object me, string jing)
{
        string xuewei_id, xuewei_name;
        string msg;
        string status;
        string *xuewei_names;
        mapping xueweis;
        int i;

        msg  = sprintf("%-20s%-20s%-11s\n", HIC "悃弇靡備" NOR, HIC "喳悃袨怓" NOR, HIY "肣晤瘍" NOR);
        msg += "=----------------------------------------------=\n";

        xueweis = query_xuewei(jing);
        if( sizeof(xueweis) < 1 )
        {
                write("羶衄涴跺冪闕ㄛ瞄妗綴婬脤戙﹝\n");
                return;
        }

        xuewei_names = keys(xueweis);
        for( i = 0; i < sizeof(xuewei_names); i ++ )
        {
                xuewei_name = xuewei_names[i];
                xuewei_id = xueweis[xuewei_name];
                if( query("jingmai/"+jing+"/"+xuewei_id, me) )
                        status = HIG "眒湖籵" NOR;
                else
                        status = WHT "帤湖籵" NOR;

                xuewei_id = replace_string(xuewei_id, "tongren ", "");
                msg += sprintf("%-20s%-20s%-11s\n", xuewei_name, status, xuewei_id);
        }
        msg += "=----------------------------------------------=\n";

        write(msg);
        return;
}

// 殿隙肣晤瘍蹈桶
varargs string show_bianhao(string arg)
{
        string str;
        int i;
        string *key;
        string *list, *temp;

        if( !arg ) return "";

        switch( arg )
        {
                case "all" :
                        list = keys(tongren_list);
                        break;
                case "bh" :
                        list = keys(tongren_list1);
                        break;
                case "bh2" :
                        list = keys(tongren_list2);
                        break;
                default :
                        key = keys(tongren_list);
                        list = filter_array(key, (: $(tongren_list)[$1][0] == $(arg) :));
                        break;
        }

        list = sort_array(list, 1);

        str  = HIR "<喳悃肣晤瘍>\n" NOR;
        str += sprintf(HIY "%-20s%-20s%-20s\n" NOR, "肣晤瘍", "垀扽冪闕", "悃弇靡備");
        str += HIC "----------------------------------------------------\n" NOR;
        for( i = 0; i < sizeof(list); i ++ )
        {
                temp = tongren_list[list[i]];
                str += sprintf(HIW "%-20s%-20s%-20s\n" NOR, replace_string(list[i], "tongren ", ""), temp[0], temp[1]);
        }

        str += HIC "----------------------------------------------------\n" NOR;

        return str;
}

// 汜傖肣恅璃 醴翹 /clone/tongren/
/*
void create_tongren_file()
{
        string file, filename, tongren_name, tongren_id;
        string *temp;
        string *list;
        int i;

        list = keys(tongren_list);

        for( i = 0; i < sizeof(list); i ++ )
        {
                reset_eval_cost();
                temp = tongren_list[list[i]];
                tongren_id = list[i];
                tongren_name = "喳悃肣﹞" + temp[0] + "﹞" + temp[1];
                filename = replace_string(list[i], "tongren ", "tongren_");

                file = read_file("/clone/tongren/tongren.h");
                file = replace_string(file, "肣NAME", tongren_name);
                file = replace_string(file, "肣ID", tongren_id);
                file = replace_string(file, "JINGMAI_NAME", temp[0]);
                file = replace_string(file, "XUEWEI_NAME", temp[1]);
                file = replace_string(file, "CHONGXUE_XIAOGUO", temp[2]);
                file = replace_string(file, "NEILI_COST", temp[3]);

                write_file("/clone/tongren/" + filename + ".c", file, 1);
        }

        write(sprintf("%d", i) + " Files created at /clone/tongren/ .\n");
        return;
}
*/

// 牖隅拸靡肣
mixed identify_tongren(object me, object ob)
{
        object tongren;
        string *list;
        string tongren_id;

        if( ob->query_tongren() == 1 )
                list = keys(tongren_list1);
        else
        if( ob->query_tongren() == 2 )
                list = keys(tongren_list2);
        else
        {
                write(ob->name()+"豖遜ㄛ薊炵掛桴拵呇脤艘恀枙﹝\n");
                return;
        }

        tongren_id = list[random(sizeof(list))];
        tongren_id = replace_string(tongren_id, "tongren ", "tongren_");
        tongren = new("/clone/tongren/" + tongren_id);

        if( !tongren )
        {
                log_file("tongren", "tongren identify error, id:" + tongren_id + ".\n");
                write("砩俋渣昫笝砦ㄛ拸靡肣豖遜ㄛ薊炵掛桴拵呇脤艘炵苀暮翹﹝\n");
                return;
        }

        ob->add_amount(-1);

        write("鳩炰斕ㄛ鳳腕牖隅堤" + tongren->name() + NOR "﹝\n");
        return tongren;
}
