// This program is a part of NT MudLIB
// zhoutiand.c

#pragma optimize
#pragma save_binary

#include <ansi.h>

inherit F_CLEAN_UP;

nosave mapping data = ([
        "attack" : 1640,
        "neili" : 74160,
        "da_damage" : 10,
        "reduce_damage" : 10,
        "avoid_poison" : 7,
        "research_times" : 100,
        "derive_effect" : 205,
        "jing" : 4540,
        "research_effect" : 193,
        "food" : 1620,
        "jingli" : 45800,
        "dex" : 172,
        "int" : 144,
        "mar" : 108370,
        "armor" : 990,
        "damage" : 1840,
        "water" : 1410,
        "con" : 162,
        "kar" : 11,
        "practice_effect" : 180,
        "reflect" : 12,
        "jiali" : 4440,
        "pot" : 210910,
        "str" : 216,
        "finish" : 1,
        "magic_find" : 11,
        "weapon" : 30,
        "qi" : 125630,
        "defense" : 150,
]);

int query_jingmai_effect(string key)
{
        return data[key];
}
string *x_zhoutian = ({
        "陰蹺脈", "陽蹺脈", "陰維脈", "陽維脈", "帶脈", "衝脈", "任外脈", "督外脈", "經外奇脈",
});

string *d_zhoutian = ({
        "手太陰脈", "手太陽脈", "足太陰脈", "足太陽脈", "手少陽脈", "手少陰脈", "足少陰脈",
        "足少陽脈", "手陽明脈", "足陽明脈", "手厥陰脈", "足厥陰脈",
});

string *zhoutian = ({
        "陰蹺脈", "陽蹺脈", "陰維脈", "陽維脈", "帶脈", "衝脈", "任外脈", "督外脈", "經外奇脈",
        "手太陰脈", "手太陽脈", "足太陰脈", "足太陽脈", "手少陽脈", "手少陰脈", "足少陰脈",
        "足少陽脈", "手陽明脈", "足陽明脈", "手厥陰脈", "足厥陰脈",
});


/*  衝穴效果代碼列表
QI:N                   氣血上限+N       /adm/daemons/race/human.c  jingmai/qi
NEI:N                  內力上限+N       /clone/user/user.c         jingmai/neili
ATK:N                  命中等級+N       combatd.c                  jingmai/attack
DMG:N                  傷害等級+N       power.c combatd.c          jingmai/damage
AMR:N                  防護等級+N       power.c combatd.c          jingmai/armor
WEAPON:N               兵器威力+N%      power.c & combatd.c        jingmai/weapon
JIALI:N                加力上限+N       /cmds/.. /jiali.c          jingmai/jiali
JING:N                 精力上限+N       /clone/user/user.c         jingmai/jingli
MAR:N                  體會上限+N       /clone/user/user.c         jingmai/mar
POT:N                  潛能上限+N       /clone/user/user.c         jingmai/pot
MINGSI:N               冥思效果+N%      /cmds/.../reflect.c        jingmai/reflect
FOOD:N                 食物上限+N       /feature/damage.c          jingmai/food
WATER:N                飲水上限+N       /feature/damage.c          jingmai/water
KANGDU:N               抗毒提升+N%      /feature/condition.c       jingmai/avoid_poison
_STR:N                 後天臂力+N       /feature/attribute.c       jingmai/str
_DEX:N                 後天身法+N       /feature/attribute.c       jingmai/dex
_INT:N                 後天悟性+N       /feature/attribute.c       jingmai/int
_CON:N                 後天根骨+N       /feature/attribute.c       jingmai/con
STR:N                  先天臂力+N       直接增加
DEX:N                  先天身法+N       直接增加
INT:N                  先天悟性+N       直接增加
CON:N                  先天臂力+N       直接增加
ADDPOT:N               增加潛能+N       直接增加
                       增加負重
                       增加福緣         power.c combatd.c          jingmai/kar
                       增加氣運         power.c combatd.c          jingmai/magic_find
                       增加研究次數     /cmds/skill/yanjiu.c       jingmai/research_times
                       增加研究效率     /cmds/skill/yanjiu.c       jingmai/research_effect   %
                       提高汲取效率     /cmds/skill/jiqu.c         jingmai/derive_effect     %

*/

mapping tongren_list = ([
                     //({ 經脈名, 穴位名，衝穴效果，消耗內力})
        // 陰蹺脈
        "tongren a1"    :  ({"陰蹺脈","然谷穴", "QI:50","100"}),
        "tongren a2"    :  ({"陰蹺脈","照海穴", "NEI:20","150"}),
        "tongren a3"    :  ({"陰蹺脈","交信穴", "ATK:10","200"}),
        "tongren a4"    :  ({"陰蹺脈","陰谷穴", "DMG:10","200"}),
        "tongren a5"    :  ({"陰蹺脈","橫谷穴", "AMR:10","200"}),
        "tongren a6"    :  ({"陰蹺脈","氣衝穴", "JIALI:50","200"}),
        "tongren a7"    :  ({"陰蹺脈","乳根穴", "QI:30","100"}),
        "tongren a8"    :  ({"陰蹺脈","盆缺穴", "JING:20","200"}),
        "tongren a9"    :  ({"陰蹺脈","人迎穴", "MAR:10","100"}),
        "tongren a10"   :  ({"陰蹺脈","晴明穴", "QI:10","100"}),
        "tongren a11"   :  ({"陰蹺脈","不容穴", "AMR:10","100"}),
        "tongren a12"   :  ({"陰蹺脈","樑門穴", "QI:10","100"}),
        "tongren a13"   :  ({"陰蹺脈","橫鼻穴", "QI:20","100"}),
        "tongren a14"   :  ({"陰蹺脈","足三裏穴", "QI:30","100"}),
        "tongren a15"   :  ({"陰蹺脈","豐隆穴", "QI:40","100"}),
        "tongren a16"   :  ({"陰蹺脈","解溪穴", "POT:20","100"}),
        "tongren a17"   :  ({"陰蹺脈","衝陽穴", "NEI:10","100"}),
        "tongren a18"   :  ({"陰蹺脈","屬兑穴", "NEI:20","150"}),

        // 陽蹺脈
        "tongren b1"    :  ({"陽蹺脈","申脈穴", "QI:500","300"}),
        "tongren b2"    :  ({"陽蹺脈","僕參穴", "QI:600","300"}),
        "tongren b3"    :  ({"陽蹺脈","跗陽穴", "QI:700","500"}),
        "tongren b4"    :  ({"陽蹺脈","居髎穴", "QI:800:AMR:10","900"}),
        "tongren b5"    :  ({"陽蹺脈","臑俞穴", "QI:500:MAR:50","800"}),
        "tongren b6"    :  ({"陽蹺脈","肩髃穴", "QI:300","300"}),
        "tongren b7"    :  ({"陽蹺脈","地谷穴", "QI:600","300"}),
        "tongren b8"    :  ({"陽蹺脈","巨倉穴", "QI:100","300"}),
        "tongren b9"    :  ({"陽蹺脈","巨髎穴", "QI:100:ATK:10","400"}),
        "tongren b10"   :  ({"陽蹺脈","承泣穴", "QI:400:NEI:40","400"}),
        "tongren b11"   :  ({"陽蹺脈","風池穴", "QI:600","300"}),
        "tongren b12"   :  ({"陽蹺脈","攢竹穴", "QI:200","300"}),
        "tongren b13"   :  ({"陽蹺脈","眉衝穴", "QI:400","300"}),
        "tongren b14"   :  ({"陽蹺脈","曲差穴", "QI:700:DMG:10","1200"}),
        "tongren b15"   :  ({"陽蹺脈","五處穴", "QI:200:DMG:10","1200"}),
        "tongren b16"   :  ({"陽蹺脈","承光穴", "QI:800:AMR:20","2000"}),
        "tongren b17"   :  ({"陽蹺脈","通天穴", "QI:1200","1000"}),
        "tongren b18"   :  ({"陽蹺脈","絡卻穴", "QI:500:MAR:100","1100"}),
        "tongren b19"   :  ({"陽蹺脈","玉枕穴", "QI:400:POT:200","1200"}),
        "tongren b20"   :  ({"陽蹺脈","天柱穴", "QI:800","500"}),
        "tongren b21"   :  ({"陽蹺脈","承山穴", "QI:200","200"}),
        "tongren b22"   :  ({"陽蹺脈","崑崙穴", "QI:500","300"}),
        "tongren b23"   :  ({"陽蹺脈","飛揚穴", "QI:400","300"}),

        // 陰維脈
        "tongren c1"    :  ({"陰維脈","府舍穴", "NEI:120","800"}),
        "tongren c2"    :  ({"陰維脈","大橫穴", "NEI:300:QI:50","800"}),
        "tongren c3"    :  ({"陰維脈","陽交穴", "NEI:100","800"}),
        "tongren c4"    :  ({"陰維脈","腹衰穴", "NEI:150","800"}),
        "tongren c5"    :  ({"陰維脈","期門穴", "NEI:400","800"}),
        "tongren c6"    :  ({"陰維脈","廉泉穴", "NEI:300","800"}),
        "tongren c7"    :  ({"陰維脈","極泉穴", "NEI:200","800"}),
        "tongren c8"    :  ({"陰維脈","青靈穴", "NEI:800:ATK:20","4000"}),
        "tongren c9"    :  ({"陰維脈","少海穴", "NEI:700:DMG:10","3400"}),
        "tongren c10"   :  ({"陰維脈","靈道穴", "NEI:100:QI:100","800"}),
        "tongren c11"   :  ({"陰維脈","通裏穴", "NEI:200","800"}),
        "tongren c12"   :  ({"陰維脈","陰郄穴", "NEI:700","1500"}),
        "tongren c13"   :  ({"陰維脈","神門穴", "NEI:200","800"}),
        "tongren c14"   :  ({"陰維脈","少府穴", "NEI:500","800"}),
        "tongren c15"   :  ({"陰維脈","少衝穴", "NEI:500","800"}),
        "tongren c16"   :  ({"陰維脈","築賓穴", "NEI:300","800"}),

        // 陽維脈
        "tongren d1"    :  ({"陽維脈","天髎穴", "POT:200","600"}),
        "tongren d2"    :  ({"陽維脈","臑俞穴", "POT:100","600"}),
        "tongren d3"    :  ({"陽維脈","肩井穴", "POT:200:MAR:200","2000"}),
        "tongren d4"    :  ({"陽維脈","陽交穴", "POT:600","600"}),
        "tongren d5"    :  ({"陽維脈","頭維穴", "POT:400:JING:200","3000"}),
        "tongren d6"    :  ({"陽維脈","金門穴", "POT:400:NEI:200","1200"}),
        "tongren d7"    :  ({"陽維脈","陽白穴", "POT:300:QI:100","1000"}),
        "tongren d8"    :  ({"陽維脈","本神穴", "POT:200:JING:300","2200"}),
        "tongren d9"    :  ({"陽維脈","頭臨泣穴", "POT:200","600"}),
        "tongren d10"   :  ({"陽維脈","目窗穴", "POT:500:MINGSI:1","5500"}),
        "tongren d11"   :  ({"陽維脈","正營穴", "POT:500","600"}),
        "tongren d12"   :  ({"陽維脈","腦空穴", "POT:700:AMR:20","3500"}),
        "tongren d13"   :  ({"陽維脈","承靈穴", "POT:200","600"}),
        "tongren d14"   :  ({"陽維脈","風池穴", "POT:300:ATK:10","2200"}),
        "tongren d15"   :  ({"陽維脈","風府穴", "POT:500","600"}),
        "tongren d16"   :  ({"陽維脈","啞門穴", "POT:300","600"}),
        "tongren d17"   :  ({"陽維脈","雲門穴", "POT:100:NEI:200","1200"}),
        "tongren d18"   :  ({"陽維脈","尺澤穴", "POT:100","600"}),
        "tongren d19"   :  ({"陽維脈","孔最穴", "POT:400:JING:200","2000"}),
        "tongren d20"   :  ({"陽維脈","列缺穴", "POT:300","600"}),
        "tongren d21"   :  ({"陽維脈","經渠穴", "POT:600","600"}),
        "tongren d22"   :  ({"陽維脈","太淵穴", "POT:100:MINGSI:2","12000"}),
        "tongren d23"   :  ({"陽維脈","魚際穴", "POT:400","600"}),
        "tongren d24"   :  ({"陽維脈","少商穴", "POT:300","600"}),

        // 帶脈
        "tongren e1"    :  ({"帶脈","帶脈穴", "QI:200:NEI:50","1000"}),
        "tongren e2"    :  ({"帶脈","五樞穴", "ATK:20","1200"}),
        "tongren e3"    :  ({"帶脈","維道穴", "JIALI:50","1200"}),
        "tongren e4"    :  ({"帶脈","天衝穴", "AMR:10","1200"}),
        "tongren e5"    :  ({"帶脈","浮白穴", "WEAPON:10","6000"}),
        "tongren e6"    :  ({"帶脈","頭竅陰穴", "_INT:2","4000"}),
        "tongren e7"    :  ({"帶脈","完骨穴", "NEI:100","1000"}),
        "tongren e8"    :  ({"帶脈","本神穴", "JIALI:20","1200"}),
        "tongren e9"    :  ({"帶脈","陽白穴", "QI:50","1000"}),
        "tongren e10"   :  ({"帶脈","頭臨泣穴", "JIALI:20","1800"}),
        "tongren e11"   :  ({"帶脈","目窗穴", "JIALI:30","1800"}),
        "tongren e12"   :  ({"帶脈","正營穴", "JIALI:40","1800"}),
        "tongren e13"   :  ({"帶脈","承靈穴", "JIALI:10","1800"}),
        "tongren e14"   :  ({"帶脈","腦空穴", "JIALI:60","1800"}),
        "tongren e15"   :  ({"帶脈","外丘穴", "JIALI:30","1800"}),
        "tongren e16"   :  ({"帶脈","光明穴", "JIALI:30","1800"}),
        "tongren e17"   :  ({"帶脈","陽輔穴", "JIALI:80","1800"}),
        "tongren e18"   :  ({"帶脈","懸鐘穴", "JIALI:10","1800"}),
        "tongren e19"   :  ({"帶脈","丘墟穴", "JIALI:40","1800"}),

        // 衝脈
        "tongren f1"    :  ({"衝脈","會陰穴", "QI:200","1000"}),
        "tongren f2"    :  ({"衝脈","陰交穴", "AMR:10","1000"}),
        "tongren f3"    :  ({"衝脈","氣衝穴", "AMR:10","1000"}),
        "tongren f4"    :  ({"衝脈","橫骨穴", "ATK:20","1000"}),
        "tongren f5"    :  ({"衝脈","大赫穴", "JIALI:50","1000"}),
        "tongren f6"    :  ({"衝脈","氣穴", "JING:20","1000"}),
        "tongren f7"    :  ({"衝脈","四滿穴", "JING:30","1000"}),
        "tongren f8"    :  ({"衝脈","中注穴", "AMR:20","2000"}),
        "tongren f9"    :  ({"衝脈","盲俞穴", "AMR:30","3000"}),
        "tongren f10"   :  ({"衝脈","商曲穴", "AMR:40","4000"}),
        "tongren f11"   :  ({"衝脈","石關穴", "NEI:50","1000"}),
        "tongren f12"   :  ({"衝脈","陰都穴", "QI:100","1000"}),
        "tongren f13"   :  ({"衝脈","通谷穴", "FOOD:100","1000"}),
        "tongren f14"   :  ({"衝脈","幽門穴", "FOOD:200","1000"}),
        "tongren f15"   :  ({"衝脈","關門穴", "WATER:100","1000"}),
        "tongren f16"   :  ({"衝脈","太乙穴", "WATER:200","1000"}),
        "tongren f17"   :  ({"衝脈","歸來穴", "ADDPOT:600000","1000"}),
        "tongren f18"   :  ({"衝脈","大巨穴", "KANGDU:1","4000"}),
        "tongren f19"   :  ({"衝脈","天樞穴", "KANGDU:2","10000"}),
        "tongren f20"   :  ({"衝脈","氣舍穴", "QI:20","1000"}),
        "tongren f21"   :  ({"衝脈","水突穴", "AMR:40","4000"}),
        "tongren f22"   :  ({"衝脈","水道穴", "DMG:10","4000"}),
        "tongren f23"   :  ({"衝脈","外陵穴", "DMG:30","22000"}),
        "tongren f24"   :  ({"衝脈","滑肉門穴", "_DEX:6","8000"}),

        // 督外脈
        "tongren g1"    :  ({"督外脈","長強穴", "JIALI:60","4000"}),
        "tongren g2"    :  ({"督外脈","腰俞穴", "JIALI:20","4000"}),
        "tongren g3"    :  ({"督外脈","陽關入命門穴", "JIALI:30","4000"}),
        "tongren g4"    :  ({"督外脈","上行懸樞穴", "JIALI:40","4000"}),
        "tongren g5"    :  ({"督外脈","脊中穴", "JIALI:100","4000"}),
        "tongren g6"    :  ({"督外脈","至中樞穴", "JIALI:20","4000"}),
        "tongren g7"    :  ({"督外脈","筋縮穴", "JIALI:10","4000"}),
        "tongren g8"    :  ({"督外脈","至陽歸靈台穴", "JIALI:40","4000"}),
        "tongren g9"    :  ({"督外脈","神道穴", "JIALI:20","4000"}),
        "tongren g10"   :  ({"督外脈","身柱穴", "JIALI:30","4000"}),
        "tongren g11"   :  ({"督外脈","陶道開穴", "JIALI:40","4000"}),
        "tongren g12"   :  ({"督外脈","大椎穴", "JIALI:50","4000"}),
        "tongren g13"   :  ({"督外脈","啞門連風府穴", "JIALI:60","4000"}),
        "tongren g14"   :  ({"督外脈","腦户穴", "JIALI:10","4000"}),
        "tongren g15"   :  ({"督外脈","強間穴", "JIALI:5:DMG:10","12000"}),
        "tongren g16"   :  ({"督外脈","後頂排穴", "JIALI:10","4000"}),
        "tongren g17"   :  ({"督外脈","百合穴", "JIALI:80","4000"}),
        "tongren g18"   :  ({"督外脈","前頂通囟會穴", "JIALI:120","4000"}),
        "tongren g19"   :  ({"督外脈","上星穴", "JIALI:30","4000"}),
        "tongren g20"   :  ({"督外脈","神庭穴", "JIALI:20","4000"}),
        "tongren g21"   :  ({"督外脈","素穴", "JIALI:20","4000"}),
        "tongren g22"   :  ({"督外脈","水溝穴", "JIALI:10","4000"}),
        "tongren g23"   :  ({"督外脈","兑端穴", "JIALI:20","4000"}),
        "tongren g24"   :  ({"督外脈","齦交穴", "JIALI:15","4000"}),

        // 任外脈
        "tongren h1"    :  ({"任外脈","曲骨穴", "QI:20:_CON:2","6000"}),
        "tongren h2"    :  ({"任外脈","中極穴", "QI:20:_STR:2","9000"}),
        "tongren h3"    :  ({"任外脈","關元穴", "QI:20:_STR:1","6000"}),
        "tongren h4"    :  ({"任外脈","下脘穴", "QI:20:_DEX:4","6000"}),
        "tongren h5"    :  ({"任外脈","中脘穴", "NEI:20:_DEX:1","6000"}),
        "tongren h6"    :  ({"任外脈","上脘穴", "NEI:20:_INT:2","12000"}),
        "tongren h7"    :  ({"任外脈","天突穴", "NEI:20:_INT:1","9000"}),
        "tongren h8"    :  ({"任外脈","廉泉穴", "NEI:20:_CON:4","6000"}),
        "tongren h9"    :  ({"任外脈","承漿穴", "NEI:20:_INT:1","9000"}),
        "tongren h10"   :  ({"任外脈","大鐘穴", "JING:20:_DEX:2","6000"}),
        "tongren h11"   :  ({"任外脈","水泉穴", "JING:20:_STR:5","25000"}),
        "tongren h12"   :  ({"任外脈","大赫穴", "JING:20:_CON:1","6000"}),
        "tongren h13"   :  ({"任外脈","靈墟穴", "JING:20:_CON:2","6000"}),
        "tongren h14"   :  ({"任外脈","箕門穴", "MAR:20:_STR:1","6000"}),
        "tongren h15"   :  ({"任外脈","湧泉穴", "MAR:20:_INT:1","9000"}),
        "tongren h16"   :  ({"任外脈","神封穴", "MAR:20:_DEX:2","6000"}),
        "tongren h17"   :  ({"任外脈","地機穴", "MAR:20:_DEX:3","6000"}),
        "tongren h18"   :  ({"任外脈","血海穴", "POT:20:_INT:1","9000"}),
        "tongren h19"   :  ({"任外脈","腹通谷穴", "POT:20:_STR:1","6000"}),
        "tongren h20"   :  ({"任外脈","步廊穴", "POT:20:_DEX:2","6000"}),
        "tongren h21"   :  ({"任外脈","神藏穴", "POT:20:_INT:1","9000"}),
        "tongren h22"   :  ({"任外脈","俞府穴", "JIALI:20:_INT:4","18000"}),
        "tongren h23"   :  ({"任外脈","腹溜穴", "JIALI:20:_CON:4","6000"}),
        "tongren h24"   :  ({"任外脈","陰陵穴", "JIALI:20:_STR:4","18000"}),

        // 經外奇脈
        "tongren i1"    :  ({"經外奇脈","神聰穴", "JING:20","8000"}),
        "tongren i2"    :  ({"經外奇脈","印堂穴", "JING:30","8000"}),
        "tongren i3"    :  ({"經外奇脈","魚腰穴", "JING:40","8000"}),
        "tongren i4"    :  ({"經外奇脈","太陽穴", "JING:500","30000"}),
        "tongren i5"    :  ({"經外奇脈","耳尖穴", "JING:60","8000"}),
        "tongren i6"    :  ({"經外奇脈","球后穴", "NEI:30","8000"}),
        "tongren i7"    :  ({"經外奇脈","金津穴", "NEI:30","8000"}),
        "tongren i8"    :  ({"經外奇脈","玉液穴", "NEI:30","8000"}),
        "tongren i9"    :  ({"經外奇脈","八邪穴", "NEI:30","8000"}),
        "tongren i10"   :  ({"經外奇脈","四縫穴", "NEI:30","8000"}),
        "tongren i11"   :  ({"經外奇脈","翳明穴", "QI:50","8000"}),
        "tongren i12"   :  ({"經外奇脈","定喘穴", "QI:60","8000"}),
        "tongren i13"   :  ({"經外奇脈","十宣穴", "QI:70","8000"}),
        "tongren i14"   :  ({"經外奇脈","腰奇穴", "QI:80","8000"}),
        "tongren i15"   :  ({"經外奇脈","夾脊穴", "QI:90","8000"}),
        "tongren i16"   :  ({"經外奇脈","二白穴", "QI:100","8000"}),
        "tongren i17"   :  ({"經外奇脈","腰痛點穴", "MAR:10","8000"}),
        "tongren i18"   :  ({"經外奇脈","鶴頂穴", "MAR:20","8000"}),
        "tongren i19"   :  ({"經外奇脈","百蟲窩穴", "MAR:30","8000"}),
        "tongren i20"   :  ({"經外奇脈","膝眼穴", "MAR:40","8000"}),
        "tongren i21"   :  ({"經外奇脈","膽囊穴", "DMG:10","30000"}),
        "tongren i22"   :  ({"經外奇脈","闌尾穴", "AMR:40","30000"}),
        "tongren i23"   :  ({"經外奇脈","八風穴", "ATK:10","30000"}),

/////////////////////////////////////////////////////////////////////////

                     //({ 經脈名, 穴位名，衝穴效果，消耗內力})
        // 手太陰脈
        "tongren j1"    :  ({"手太陰脈","少商穴", "QI:50","100"}),
        "tongren j2"    :  ({"手太陰脈","太淵穴", "QI:30","150"}),
        "tongren j3"    :  ({"手太陰脈","中府穴", "QI:20","200"}),
        "tongren j4"    :  ({"手太陰脈","魚際穴", "NEI:10","200"}),
        "tongren j5"    :  ({"手太陰脈","雲門穴", "NEI:30","200"}),
        "tongren j6"    :  ({"手太陰脈","天府穴", "QI:10","200"}),
        "tongren j7"    :  ({"手太陰脈","經渠穴", "NEI:20","100"}),
        "tongren j8"    :  ({"手太陰脈","尺澤穴", "JING:10","200"}),
        "tongren j9"    :  ({"手太陰脈","俠白穴", "JING:10","100"}),
        "tongren j10"   :  ({"手太陰脈","列缺穴", "POT:100","100"}),


        // 手太陽脈
        "tongren k1"    :  ({"手太陽脈","少澤穴", "JING:20:_INT:1","300"}),
        "tongren k2"    :  ({"手太陽脈","前谷穴", "JING:30","300"}),
        "tongren k3"    :  ({"手太陽脈","顴髎穴", "JING:40","500"}),
        "tongren k4"    :  ({"手太陽脈","後溪穴", "JING:80:ATK:10","900"}),
        "tongren k5"    :  ({"手太陽脈","腕骨穴", "JING:60","800"}),
        "tongren k6"    :  ({"手太陽脈","肩髃穴", "NEI:30","300"}),
        "tongren k7"    :  ({"手太陽脈","天容穴", "NEI:30:AMR:10","300"}),
        "tongren k8"    :  ({"手太陽脈","秉風穴", "NEI:30","300"}),
        "tongren k9"    :  ({"手太陽脈","聽宮穴", "NEI:30","400"}),
        "tongren k10"   :  ({"手太陽脈","肩中俞穴", "NEI:30:JING:20","400"}),
        "tongren k11"   :  ({"手太陽脈","天宗穴", "JING:20","300"}),
        "tongren k12"   :  ({"手太陽脈","肩外俞穴", "JING:30","300"}),
        "tongren k13"   :  ({"手太陽脈","養老穴", "JING:40:NEI:30","300"}),
        "tongren k14"   :  ({"手太陽脈","陽骨穴", "JING:50","1200"}),
        "tongren k15"   :  ({"手太陽脈","曲垣穴", "JING:60:_DEX:1","1200"}),
        "tongren k16"   :  ({"手太陽脈","天窗穴", "NEI:30","2000"}),
        "tongren k17"   :  ({"手太陽脈","支正穴", "NEI:30","1000"}),
        "tongren k18"   :  ({"手太陽脈","儒俞穴", "NEI:30:_CON:1","1100"}),
        "tongren k19"   :  ({"手太陽脈","小海穴", "NEI:30","1200"}),
        "tongren k20"   :  ({"手太陽脈","肩貞穴", "NEI:30","500"}),


        // 足太陰脈
        "tongren l1"    :  ({"足太陰脈","血海穴", "QI:20:NEI:20","800"}),
        "tongren l2"    :  ({"足太陰脈","陰陵穴", "QI:30:JING:10","800"}),
        "tongren l3"    :  ({"足太陰脈","地機穴", "QI:40","800"}),
        "tongren l4"    :  ({"足太陰脈","箕門穴", "QI:50:_DEX:1","800"}),
        "tongren l5"    :  ({"足太陰脈","商丘穴", "QI:60","800"}),
        "tongren l6"    :  ({"足太陰脈","公孫穴", "NEI:30:POT:100","800"}),
        "tongren l7"    :  ({"足太陰脈","隱白穴", "NEI:30","800"}),
        "tongren l8"    :  ({"足太陰脈","大都穴", "NEI:30:MAR:50","4000"}),
        "tongren l9"    :  ({"足太陰脈","太白穴", "NEI:30","3400"}),
        "tongren l10"   :  ({"足太陰脈","漏骨穴", "NEI:30","800"}),
        "tongren l11"   :  ({"足太陰脈","衝門穴", "JING:20","800"}),
        "tongren l12"   :  ({"足太陰脈","府舍穴", "QI:30:DMG:10","1500"}),
        "tongren l13"   :  ({"足太陰脈","三陰交穴", "JING:40","800"}),
        "tongren l14"   :  ({"足太陰脈","腹結穴", "QI:50","800"}),
        "tongren l15"   :  ({"足太陰脈","大橫穴", "JING:60:_STR:2","800"}),
        "tongren l16"   :  ({"足太陰脈","腹哀穴", "QI:30","800"}),
        "tongren l17"   :  ({"足太陰脈","食竇穴", "QI:30","800"}),
        "tongren l18"   :  ({"足太陰脈","胸鄉穴", "NEI:30:AMR:10","800"}),
        "tongren l19"   :  ({"足太陰脈","大包穴", "NEI:30","1500"}),
        "tongren l20"   :  ({"足太陰脈","周榮穴", "NEI:30","800"}),
        "tongren l21"   :  ({"足太陰脈","天溪穴", "NEI:30:DMG:10","800"}),


        // 足太陽脈
        "tongren m1"    :  ({"足太陽脈","跗陽穴", "JING:20:QI:40","600"}),
        "tongren m2"    :  ({"足太陽脈","崑崙穴", "JING:30:JIALI:10","600"}),
        "tongren m3"    :  ({"足太陽脈","晴明穴", "JING:40","2000"}),
        "tongren m4"    :  ({"足太陽脈","飛揚穴", "JING:50","600"}),
        "tongren m5"    :  ({"足太陽脈","攢竹穴", "JING:60:JIALI:10","3000"}),
        "tongren m6"    :  ({"足太陽脈","風門穴", "NEI:30","1200"}),
        "tongren m7"    :  ({"足太陽脈","僕申穴", "NEI:30:ATK:10","1000"}),
        "tongren m8"    :  ({"足太陽脈","申脈穴", "NEI:30","2200"}),
        "tongren m9"    :  ({"足太陽脈","曲差穴", "NEI:30","600"}),
        "tongren m10"   :  ({"足太陽脈","眉衝穴", "NEI:30:JIALI:20","5500"}),
        "tongren m11"   :  ({"足太陽脈","五處穴", "QI:20","600"}),
        "tongren m12"   :  ({"足太陽脈","肺俞穴", "QI:30","3500"}),
        "tongren m13"   :  ({"足太陽脈","金門穴", "QI:40","600"}),
        "tongren m14"   :  ({"足太陽脈","京骨穴", "QI:50:ATK:10","2200"}),
        "tongren m15"   :  ({"足太陽脈","通天穴", "QI:60","600"}),
        "tongren m16"   :  ({"足太陽脈","承光穴", "NEI:30","600"}),
        "tongren m17"   :  ({"足太陽脈","絡卻穴", "NEI:30","1200"}),
        "tongren m18"   :  ({"足太陽脈","厥陰俞穴", "NEI:30:JIALI:30","600"}),
        "tongren m19"   :  ({"足太陽脈","束骨穴", "NEI:30","2000"}),
        "tongren m20"   :  ({"足太陽脈","足通骨穴", "NEI:30","600"}),
        "tongren m21"   :  ({"足太陽脈","天柱穴", "NEI:20","600"}),
        "tongren m22"   :  ({"足太陽脈","玉枕穴", "POT:20","12000"}),
        "tongren m23"   :  ({"足太陽脈","大紓穴", "POT:30:AMR:10","600"}),
        "tongren m24"   :  ({"足太陽脈","心俞穴", "POT:20","600"}),
        "tongren m25"   :  ({"足太陽脈","督俞穴", "POT:10:DMG:10","600"}),
        "tongren m26"   :  ({"足太陽脈","脾俞穴", "POT:60","2000"}),
        "tongren m27"   :  ({"足太陽脈","承山穴", "POT:10","600"}),
        "tongren m28"   :  ({"足太陽脈","胃俞穴", "NEI:30","600"}),
        "tongren m29"   :  ({"足太陽脈","上髎穴", "NEI:30:JIALI:20","12000"}),
        "tongren m30"   :  ({"足太陽脈","膈俞穴", "NEI:30","600"}),
        "tongren m31"   :  ({"足太陽脈","三焦俞穴", "NEI:20","600"}),
        "tongren m32"   :  ({"足太陽脈","氣海俞穴", "JING:20","2000"}),
        "tongren m33"   :  ({"足太陽脈","腎俞穴", "JING:30","600"}),
        "tongren m34"   :  ({"足太陽脈","次髎穴", "JING:20","600"}),
        "tongren m35"   :  ({"足太陽脈","肝俞穴", "JING:10","12000"}),
        "tongren m36"   :  ({"足太陽脈","關元俞穴", "JING:60","600"}),
        "tongren m37"   :  ({"足太陽脈","大腸俞穴", "NEI:30","600"}),
        "tongren m38"   :  ({"足太陽脈","小腸俞穴", "NEI:30","600"}),
        "tongren m39"   :  ({"足太陽脈","中髎穴", "NEI:30:JIALI:20","2000"}),
        "tongren m40"   :  ({"足太陽脈","膀胱俞穴", "POT:30","600"}),
        "tongren m41"   :  ({"足太陽脈","白環俞穴", "POT:30","600"}),
        "tongren m42"   :  ({"足太陽脈","下髎穴", "POT:30","12000"}),
        "tongren m43"   :  ({"足太陽脈","會陽穴", "POT:20","600"}),
        "tongren m44"   :  ({"足太陽脈","委陽穴", "JING:30:DMG:10","600"}),
        "tongren m45"   :  ({"足太陽脈","合陽穴", "JING:40:ATK:20","2000"}),
        "tongren m46"   :  ({"足太陽脈","委中穴", "JING:10","600"}),
        "tongren m47"   :  ({"足太陽脈","附分穴", "JING:30","600"}),
        "tongren m48"   :  ({"足太陽脈","承扶穴", "NEI:30","12000"}),
        "tongren m49"   :  ({"足太陽脈","膏肓穴", "NEI:30:_STR:2","600"}),
        "tongren m50"   :  ({"足太陽脈","魄户穴", "NEI:30","600"}),
        "tongren m51"   :  ({"足太陽脈","肓門穴", "NEI:30","600"}),
        "tongren m52"   :  ({"足太陽脈","神堂穴", "NEI:30","2000"}),
        "tongren m53"   :  ({"足太陽脈","殷門穴", "JING:20:JIALI:40","600"}),
        "tongren m54"   :  ({"足太陽脈","膈關穴", "JING:30","600"}),
        "tongren m55"   :  ({"足太陽脈","志室穴", "JING:20","12000"}),
        "tongren m56"   :  ({"足太陽脈","魂門穴", "JING:50","600"}),
        "tongren m57"   :  ({"足太陽脈","意舍穴", "JING:60:_INT:2","600"}),
        "tongren m58"   :  ({"足太陽脈","陽剛穴", "NEI:30:JING:50","2000"}),

        // 手少陰脈
        "tongren n1"    :  ({"手少陰脈","陰郗穴", "JING:20:_DEX:3","1000"}),
        "tongren n2"    :  ({"手少陰脈","通裏穴", "JING:30","1200"}),
        "tongren n3"    :  ({"手少陰脈","少府穴", "JING:40","1200"}),
        "tongren n4"    :  ({"手少陰脈","少衝穴", "JING:50:NEI:30","1200"}),
        "tongren n5"    :  ({"手少陰脈","靈道穴", "JING:60","6000"}),
        "tongren n6"    :  ({"手少陰脈","神門穴", "NEI:30","4000"}),
        "tongren n7"    :  ({"手少陰脈","青靈穴", "NEI:30:_INT:2","1000"}),
        "tongren n8"    :  ({"手少陰脈","少海穴", "NEI:30","1200"}),
        "tongren n9"    :  ({"手少陰脈","極泉穴", "NEI:30:_STR:2","1000"}),


        // 手少陽脈
        "tongren o1"    :  ({"手少陽脈","翳風穴", "NEI:20:JING:20","1000"}),
        "tongren o2"    :  ({"手少陽脈","絲竹空穴", "NEI:30:ATK:10","1000"}),
        "tongren o3"    :  ({"手少陽脈","耳門穴", "NEI:40","1000"}),
        "tongren o4"    :  ({"手少陽脈","耳門髎穴", "JING:20:AMR:10","1000"}),
        "tongren o5"    :  ({"手少陽脈","天髎穴", "JING:30","1000"}),
        "tongren o6"    :  ({"手少陽脈","支溝穴", "JING:40:JIALI:20","1000"}),
        "tongren o7"    :  ({"手少陽脈","關衝穴", "JING:50:JIALI:30","1000"}),
        "tongren o8"    :  ({"手少陽脈","液門穴", "JING:60","2000"}),
        "tongren o9"    :  ({"手少陽脈","天井穴", "NEI:30","3000"}),
        "tongren o10"   :  ({"手少陽脈","青冷淵穴", "NEI:30:MAR:50","4000"}),
        "tongren o11"   :  ({"手少陽脈","顱息穴", "NEI:30","1000"}),
        "tongren o12"   :  ({"手少陽脈","角孫穴", "NEI:30:DMG:10","1000"}),
        "tongren o13"   :  ({"手少陽脈","肩髎穴", "QI:20","1000"}),
        "tongren o14"   :  ({"手少陽脈","外關穴", "QI:30","1000"}),
        "tongren o15"   :  ({"手少陽脈","四瀆穴", "QI:40","1000"}),
        "tongren o16"   :  ({"手少陽脈","消濼穴", "QI:50:_STR:1","1000"}),
        "tongren o17"   :  ({"手少陽脈","儒會穴", "QI:60","1000"}),
        "tongren o18"   :  ({"手少陽脈","陽池穴", "QI:30","4000"}),
        "tongren o19"   :  ({"手少陽脈","中澤穴", "QI:30:DMG:10","10000"}),
        "tongren o20"   :  ({"手少陽脈","會宗穴", "NEI:30","1000"}),
        "tongren o21"   :  ({"手少陽脈","三陽絡穴", "NEI:30:JING:20","4000"}),


        // 足少陰脈
        "tongren p1"    :  ({"足少陰脈","大鐘穴", "POT:50:WEAPON:10","4000"}),
        "tongren p2"    :  ({"足少陰脈","太溪穴", "POT:30","4000"}),
        "tongren p3"    :  ({"足少陰脈","然谷穴", "POT:40","4000"}),
        "tongren p4"    :  ({"足少陰脈","湧泉穴", "POT:20:JIALI:10","4000"}),
        "tongren p5"    :  ({"足少陰脈","交信穴", "POT:30","4000"}),
        "tongren p6"    :  ({"足少陰脈","照海穴", "POT:40","4000"}),
        "tongren p7"    :  ({"足少陰脈","水泉穴", "POT:50:ATK:30","4000"}),
        "tongren p8"    :  ({"足少陰脈","橫骨穴", "POT:60","4000"}),
        "tongren p9"    :  ({"足少陰脈","商曲穴", "NEI:30:JIALI:20","4000"}),
        "tongren p10"   :  ({"足少陰脈","石關穴", "NEI:30","4000"}),
        "tongren p11"   :  ({"足少陰脈","陰都穴", "NEI:30","4000"}),
        "tongren p12"   :  ({"足少陰脈","腹通谷穴", "NEI:30:MINGSI:1","4000"}),
        "tongren p13"   :  ({"足少陰脈","幽門穴", "JING:20","4000"}),
        "tongren p14"   :  ({"足少陰脈","肓俞穴", "JING:30","4000"}),
        "tongren p15"   :  ({"足少陰脈","中注穴", "JING:40:DMG:20","12000"}),
        "tongren p16"   :  ({"足少陰脈","氣穴", "JING:20","4000"}),
        "tongren p17"   :  ({"足少陰脈","復溜穴", "JING:30","4000"}),
        "tongren p18"   :  ({"足少陰脈","大赫穴", "QI:10:JIALI:20","4000"}),
        "tongren p19"   :  ({"足少陰脈","陰谷穴", "QI:10","4000"}),
        "tongren p20"   :  ({"足少陰脈","築賓穴", "QI:10:JIALI:20","4000"}),
        "tongren p21"   :  ({"足少陰脈","四滿穴", "QI:10","4000"}),
        "tongren p22"   :  ({"足少陰脈","神封穴", "QI:10","4000"}),
        "tongren p23"   :  ({"足少陰脈","靈墟穴", "QI:10:WEAPON:10","4000"}),
        "tongren p24"   :  ({"足少陰脈","俞府穴", "NEI:30","4000"}),
        "tongren p25"   :  ({"足少陰脈","神藏穴", "NEI:30:JIALI:30","4000"}),

        // 足少陽脈
        "tongren q1"    :  ({"足少陽脈","風池穴", "NEI:320:KANGDU:1","6000"}),
        "tongren q2"    :  ({"足少陽脈","腦空穴", "NEI:130:FOOD:100","9000"}),
        "tongren q3"    :  ({"足少陽脈","頭竅陰穴", "NEI:340:_CON:1","6000"}),
        "tongren q4"    :  ({"足少陽脈","肩井穴", "NEI:120","6000"}),
        "tongren q5"    :  ({"足少陽脈","陽陵泉穴", "NEI:130:KANGDU:1","6000"}),
        "tongren q6"    :  ({"足少陽脈","浮白穴", "NEI:130:FOOD:100","12000"}),
        "tongren q7"    :  ({"足少陽脈","天衝穴", "NEI:150:WATER:100","9000"}),
        "tongren q8"    :  ({"足少陽脈","完骨穴", "NEI:160","6000"}),
        "tongren q9"    :  ({"足少陽脈","正營穴", "NEI:130:_STR:1","9000"}),
        "tongren q10"   :  ({"足少陽脈","目窗穴", "NEI:130","6000"}),
        "tongren q11"   :  ({"足少陽脈","頭臨泣穴", "NEI:130","25000"}),
        "tongren q12"   :  ({"足少陽脈","陽白穴", "NEI:130:_STR:1","6000"}),
        "tongren q13"   :  ({"足少陽脈","本神穴", "NEI:120","6000"}),
        "tongren q14"   :  ({"足少陽脈","環跳穴", "NEI:130:_CON:1","6000"}),
        "tongren q15"   :  ({"足少陽脈","京門穴", "NEI:140","9000"}),
        "tongren q16"   :  ({"足少陽脈","居髎穴", "NEI:120:_STR:1","6000"}),
        "tongren q17"   :  ({"足少陽脈","淵腋穴", "NEI:130","6000"}),
        "tongren q18"   :  ({"足少陽脈","上關穴", "NEI:140","9000"}),
        "tongren q19"   :  ({"足少陽脈","懸顱穴", "NEI:120:WATER:100","6000"}),
        "tongren q20"   :  ({"足少陽脈","聽會穴", "NEI:130","6000"}),
        "tongren q21"   :  ({"足少陽脈","五樞穴", "NEI:140","9000"}),
        "tongren q22"   :  ({"足少陽脈","足竅陰穴", "NEI:150:KANGDU:1","18000"}),
        "tongren q23"   :  ({"足少陽脈","曲鬢穴", "NEI:160","6000"}),
        "tongren q24"   :  ({"足少陽脈","懸釐穴", "NEI:130:FOOD:100","18000"}),
        "tongren q25"   :  ({"足少陽脈","瞳子髎穴", "NEI:130","6000"}),
        "tongren q26"   :  ({"足少陽脈","帶脈穴", "NEI:120:KANGDU:1","6000"}),
        "tongren q27"   :  ({"足少陽脈","率谷穴", "NEI:130","9000"}),
        "tongren q28"   :  ({"足少陽脈","風市穴", "NEI:140","6000"}),
        "tongren q29"   :  ({"足少陽脈","陽交穴", "NEI:120:_STR:1","6000"}),
        "tongren q30"   :  ({"足少陽脈","外丘穴", "NEI:130","9000"}),
        "tongren q31"   :  ({"足少陽脈","維道穴", "NEI:140:FOOD:100","6000"}),
        "tongren q32"   :  ({"足少陽脈","日月穴", "NEI:120:WATER:100","6000"}),
        "tongren q33"   :  ({"足少陽脈","地五會穴", "NEI:130","9000"}),
        "tongren q34"   :  ({"足少陽脈","俠溪穴", "NEI:210:_CON:1","18000"}),
        "tongren q35"   :  ({"足少陽脈","丘墟穴", "NEI:150","6000"}),
        "tongren q36"   :  ({"足少陽脈","懸鐘穴", "NEI:160:_STR:1","18000"}),
        "tongren q37"   :  ({"足少陽脈","光明穴", "NEI:230","6000"}),
        "tongren q38"   :  ({"足少陽脈","陽輔穴", "NEI:330:_CON:1","18000"}),

        // 手陽明脈
        "tongren r1"    :  ({"手陽明脈","肘髎穴", "QI:20:ADDPOT:1000000","8000"}),
        "tongren r2"    :  ({"手陽明脈","手五里穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r3"    :  ({"手陽明脈","曲池穴", "QI:40:ADDPOT:1000000","8000"}),
        "tongren r4"    :  ({"手陽明脈","迎香穴", "QI:20:ADDPOT:1000000","30000"}),
        "tongren r5"    :  ({"手陽明脈","臂儒穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r6"    :  ({"手陽明脈","巨骨穴", "QI:40:ADDPOT:1000000","8000"}),
        "tongren r7"    :  ({"手陽明脈","天鼎穴", "QI:50:ADDPOT:1000000","8000"}),
        "tongren r8"    :  ({"手陽明脈","扶突穴", "QI:60:ADDPOT:1000000","8000"}),
        "tongren r9"    :  ({"手陽明脈","口禾髎穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r10"   :  ({"手陽明脈","合谷穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r11"   :  ({"手陽明脈","二間穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r12"   :  ({"手陽明脈","三間穴", "FOOD:30:ADDPOT:1000000","8000"}),
        "tongren r13"   :  ({"手陽明脈","商陽穴", "FOOD:20:ADDPOT:1000000","8000"}),
        "tongren r14"   :  ({"手陽明脈","陽溪穴", "FOOD:30:ADDPOT:1000000","8000"}),
        "tongren r15"   :  ({"手陽明脈","手三裏穴", "FOOD:40:ADDPOT:1000000","8000"}),
        "tongren r16"   :  ({"手陽明脈","上廉穴", "WATER:20:ADDPOT:1000000","8000"}),
        "tongren r17"   :  ({"手陽明脈","下廉穴", "WATER:30:ADDPOT:1000000","8000"}),
        "tongren r18"   :  ({"手陽明脈","温溜穴", "WATER:40:ADDPOT:1000000","8000"}),
        "tongren r19"   :  ({"手陽明脈","偏歷穴", "WATER:20:ADDPOT:1000000","8000"}),

        // 足陽明脈
        "tongren s1"    :  ({"足陽明脈","承泣穴", "MAR:20:FOOD:100","8000"}),
        "tongren s2"    :  ({"足陽明脈","四白穴", "MAR:30:FOOD:100","8000"}),
        "tongren s3"    :  ({"足陽明脈","巨髎穴", "MAR:40:FOOD:100","8000"}),
        "tongren s4"    :  ({"足陽明脈","地倉穴", "MAR:20:FOOD:100","30000"}),
        "tongren s5"    :  ({"足陽明脈","下關穴", "MAR:30:FOOD:100","8000"}),
        "tongren s6"    :  ({"足陽明脈","頭維穴", "MAR:40:FOOD:100","8000"}),
        "tongren s7"    :  ({"足陽明脈","人迎穴", "MAR:50:FOOD:100","8000"}),
        "tongren s8"    :  ({"足陽明脈","水突穴", "MAR:60:FOOD:100","8000"}),
        "tongren s9"    :  ({"足陽明脈","氣舍穴", "NEI:30:WATER:100","8000"}),
        "tongren s10"   :  ({"足陽明脈","缺盆穴", "NEI:30:WATER:100","8000"}),
        "tongren s11"   :  ({"足陽明脈","氣户穴", "NEI:30:WATER:100","8000"}),
        "tongren s12"   :  ({"足陽明脈","庫房穴", "NEI:30:WATER:100","8000"}),
        "tongren s13"   :  ({"足陽明脈","大迎穴", "JING:20:WATER:100","8000"}),
        "tongren s14"   :  ({"足陽明脈","屋翳穴", "JING:30:WATER:100","8000"}),
        "tongren s15"   :  ({"足陽明脈","樑門穴", "POT:40:WATER:100","8000"}),
        "tongren s16"   :  ({"足陽明脈","乳中穴", "POT:20:ATK:10","8000"}),
        "tongren s17"   :  ({"足陽明脈","乳根穴", "POT:30","8000"}),
        "tongren s18"   :  ({"足陽明脈","不容穴", "POT:40:_DEX:2","8000"}),
        "tongren s19"   :  ({"足陽明脈","承滿穴", "POT:20:ATK:10","8000"}),
        "tongren s20"   :  ({"足陽明脈","關門穴", "POT:30","8000"}),
        "tongren s21"   :  ({"足陽明脈","太乙穴", "POT:40:DMG:10","8000"}),
        "tongren s22"   :  ({"足陽明脈","滑肉門穴", "POT:50:JIALI:30","8000"}),
        "tongren s23"   :  ({"足陽明脈","天樞穴", "POT:60","30000"}),
        "tongren s24"   :  ({"足陽明脈","外陵穴", "NEI:30:ATK:30","8000"}),
        "tongren s25"   :  ({"足陽明脈","大巨穴", "NEI:30","8000"}),
        "tongren s26"   :  ({"足陽明脈","水道穴", "JING:20:JIALI:50","8000"}),
        "tongren s27"   :  ({"足陽明脈","歸來穴", "JING:30","8000"}),
        "tongren s28"   :  ({"足陽明脈","氣衝穴", "JING:40:AMR:10","8000"}),
        "tongren s29"   :  ({"足陽明脈","伏兔穴", "JING:20","8000"}),
        "tongren s30"   :  ({"足陽明脈","陰市穴", "JING:30:ATK:10","8000"}),
        "tongren s31"   :  ({"足陽明脈","樑丘穴", "JING:40","8000"}),
        "tongren s32"   :  ({"足陽明脈","犢鼻穴", "QI:20:NEI:10","8000"}),
        "tongren s33"   :  ({"足陽明脈","上巨虛穴", "QI:30:ATK:10","8000"}),
        "tongren s34"   :  ({"足陽明脈","下巨虛穴", "QI:40","8000"}),
        "tongren s35"   :  ({"足陽明脈","豐隆穴", "QI:50","8000"}),
        "tongren s36"   :  ({"足陽明脈","解溪穴", "QI:60:JIALI:10","8000"}),
        "tongren s37"   :  ({"足陽明脈","衝陽穴", "QI:30","8000"}),
        "tongren s38"   :  ({"足陽明脈","陷骨穴", "QI:30:ATK:10","8000"}),
        "tongren s39"    :  ({"足陽明脈","內庭穴", "NEI:30:JIALI:10","8000"}),
        "tongren s40"    :  ({"足陽明脈","歷兑穴", "NEI:30:AMR:10","8000"}),

        // 手厥陰脈
        "tongren t1"    :  ({"手厥陰脈","內關穴", "JING:50:NEI:50","8000"}),
        "tongren t2"    :  ({"手厥陰脈","大陵穴", "JING:50:NEI:50","8000"}),
        "tongren t3"    :  ({"手厥陰脈","天泉穴", "JING:50:NEI:50","8000"}),
        "tongren t4"    :  ({"手厥陰脈","間使穴", "JING:50:_DEX:1","30000"}),
        "tongren t5"    :  ({"手厥陰脈","勞宮穴", "JING:50:_DEX:1","8000"}),
        "tongren t6"    :  ({"手厥陰脈","天池穴", "JING:50:_DEX:1","8000"}),
        "tongren t7"    :  ({"手厥陰脈","曲澤穴", "JING:50:_DEX:1","8000"}),
        "tongren t8"    :  ({"手厥陰脈","蹊門穴", "JING:50:MAR:50","8000"}),
        "tongren t9"    :  ({"手厥陰脈","中衝穴", "JING:50:MAR:50","8000"}),

        // 足厥陰脈
        "tongren u1"    :  ({"足厥陰脈","太沖穴", "JING:50:DMG:20","8000"}),
        "tongren u2"    :  ({"足厥陰脈","大敦穴", "JING:30:_CON:3","8000"}),
        "tongren u3"    :  ({"足厥陰脈","行間穴", "JING:40","8000"}),
        "tongren u4"    :  ({"足厥陰脈","中都穴", "JING:20:QI:20","30000"}),
        "tongren u5"    :  ({"足厥陰脈","臂溝穴", "JING:30:ATK:20","8000"}),
        "tongren u6"    :  ({"足厥陰脈","中封穴", "JING:40","8000"}),
        "tongren u7"    :  ({"足厥陰脈","章門穴", "JING:50:_DEX:2","8000"}),
        "tongren u8"    :  ({"足厥陰脈","足五里穴", "JING:60:NEI:50","8000"}),
        "tongren u9"    :  ({"足厥陰脈","膝關穴", "NEI:30:_DEX:1","8000"}),
        "tongren u10"   :  ({"足厥陰脈","曲泉穴", "JING:30:_CON:3","8000"}),
        "tongren u11"   :  ({"足厥陰脈","急脈穴", "JING:40:_STR:2","8000"}),
        "tongren u12"   :  ({"足厥陰脈","陰包穴", "JING:50","8000"}),
        "tongren u13"   :  ({"足厥陰脈","期門穴", "JING:60:QI:20","8000"}),
        "tongren u14"   :  ({"足厥陰脈","陰廉穴", "NEI:40:_STR:2","8000"}),
]);

// 無名銅人鑑定出的小週天銅人列表
mapping tongren_list1 = ([
                     //({ 經脈名, 穴位名，衝穴效果，消耗內力})
        // 陰蹺脈
        "tongren a1"    :  ({"陰蹺脈","然谷穴", "QI:50","100"}),
        "tongren a2"    :  ({"陰蹺脈","照海穴", "NEI:20","150"}),
        "tongren a3"    :  ({"陰蹺脈","交信穴", "ATK:10","200"}),
        "tongren a4"    :  ({"陰蹺脈","陰谷穴", "DMG:10","200"}),
        "tongren a5"    :  ({"陰蹺脈","橫谷穴", "AMR:10","200"}),
        "tongren a6"    :  ({"陰蹺脈","氣衝穴", "JIALI:50","200"}),
        "tongren a7"    :  ({"陰蹺脈","乳根穴", "QI:30","100"}),
        "tongren a8"    :  ({"陰蹺脈","盆缺穴", "JING:20","200"}),
        "tongren a9"    :  ({"陰蹺脈","人迎穴", "MAR:10","100"}),
        "tongren a10"   :  ({"陰蹺脈","晴明穴", "QI:10","100"}),
        "tongren a11"   :  ({"陰蹺脈","不容穴", "AMR:10","100"}),
        "tongren a12"   :  ({"陰蹺脈","樑門穴", "QI:10","100"}),
        "tongren a13"   :  ({"陰蹺脈","橫鼻穴", "QI:20","100"}),
        "tongren a14"   :  ({"陰蹺脈","足三裏穴", "QI:30","100"}),
        "tongren a15"   :  ({"陰蹺脈","豐隆穴", "QI:40","100"}),
        "tongren a16"   :  ({"陰蹺脈","解溪穴", "POT:20","100"}),
        "tongren a17"   :  ({"陰蹺脈","衝陽穴", "NEI:10","100"}),
        "tongren a18"   :  ({"陰蹺脈","屬兑穴", "NEI:20","150"}),

        // 陽蹺脈
        "tongren b1"    :  ({"陽蹺脈","申脈穴", "QI:500","300"}),
        "tongren b2"    :  ({"陽蹺脈","僕參穴", "QI:600","300"}),
        "tongren b3"    :  ({"陽蹺脈","跗陽穴", "QI:700","500"}),
        "tongren b4"    :  ({"陽蹺脈","居髎穴", "QI:800:AMR:10","900"}),
        "tongren b5"    :  ({"陽蹺脈","臑俞穴", "QI:500:MAR:50","800"}),
        "tongren b6"    :  ({"陽蹺脈","肩髃穴", "QI:300","300"}),
        "tongren b7"    :  ({"陽蹺脈","地谷穴", "QI:600","300"}),
        "tongren b8"    :  ({"陽蹺脈","巨倉穴", "QI:100","300"}),
        "tongren b9"    :  ({"陽蹺脈","巨髎穴", "QI:100:ATK:10","400"}),
        "tongren b10"   :  ({"陽蹺脈","承泣穴", "QI:400:NEI:40","400"}),
        "tongren b11"   :  ({"陽蹺脈","風池穴", "QI:600","300"}),
        "tongren b12"   :  ({"陽蹺脈","攢竹穴", "QI:200","300"}),
        "tongren b13"   :  ({"陽蹺脈","眉衝穴", "QI:400","300"}),
        "tongren b14"   :  ({"陽蹺脈","曲差穴", "QI:700:DMG:10","1200"}),
        "tongren b15"   :  ({"陽蹺脈","五處穴", "QI:200:DMG:10","1200"}),
        "tongren b16"   :  ({"陽蹺脈","承光穴", "QI:800:AMR:20","2000"}),
        "tongren b17"   :  ({"陽蹺脈","通天穴", "QI:1200","1000"}),
        "tongren b18"   :  ({"陽蹺脈","絡卻穴", "QI:500:MAR:100","1100"}),
        "tongren b19"   :  ({"陽蹺脈","玉枕穴", "QI:400:POT:200","1200"}),
        "tongren b20"   :  ({"陽蹺脈","天柱穴", "QI:800","500"}),
        "tongren b21"   :  ({"陽蹺脈","承山穴", "QI:200","200"}),
        "tongren b22"   :  ({"陽蹺脈","崑崙穴", "QI:500","300"}),
        "tongren b23"   :  ({"陽蹺脈","飛揚穴", "QI:400","300"}),

        // 陰維脈
        "tongren c1"    :  ({"陰維脈","府舍穴", "NEI:120","800"}),
        "tongren c2"    :  ({"陰維脈","大橫穴", "NEI:300:QI:50","800"}),
        "tongren c3"    :  ({"陰維脈","陽交穴", "NEI:100","800"}),
        "tongren c4"    :  ({"陰維脈","腹衰穴", "NEI:150","800"}),
        "tongren c5"    :  ({"陰維脈","期門穴", "NEI:400","800"}),
        "tongren c6"    :  ({"陰維脈","廉泉穴", "NEI:300","800"}),
        "tongren c7"    :  ({"陰維脈","極泉穴", "NEI:200","800"}),
        "tongren c8"    :  ({"陰維脈","青靈穴", "NEI:800:ATK:20","4000"}),
        "tongren c9"    :  ({"陰維脈","少海穴", "NEI:700:DMG:10","3400"}),
        "tongren c10"   :  ({"陰維脈","靈道穴", "NEI:100:QI:100","800"}),
        "tongren c11"   :  ({"陰維脈","通裏穴", "NEI:200","800"}),
        "tongren c12"   :  ({"陰維脈","陰郄穴", "NEI:700","1500"}),
        "tongren c13"   :  ({"陰維脈","神門穴", "NEI:200","800"}),
        "tongren c14"   :  ({"陰維脈","少府穴", "NEI:500","800"}),
        "tongren c15"   :  ({"陰維脈","少衝穴", "NEI:500","800"}),
        "tongren c16"   :  ({"陰維脈","築賓穴", "NEI:300","800"}),

        // 陽維脈
        "tongren d1"    :  ({"陽維脈","天髎穴", "POT:200","600"}),
        "tongren d2"    :  ({"陽維脈","臑俞穴", "POT:100","600"}),
        "tongren d3"    :  ({"陽維脈","肩井穴", "POT:200:MAR:200","2000"}),
        "tongren d4"    :  ({"陽維脈","陽交穴", "POT:600","600"}),
        "tongren d5"    :  ({"陽維脈","頭維穴", "POT:400:JING:200","3000"}),
        "tongren d6"    :  ({"陽維脈","金門穴", "POT:400:NEI:200","1200"}),
        "tongren d7"    :  ({"陽維脈","陽白穴", "POT:300:QI:100","1000"}),
        "tongren d8"    :  ({"陽維脈","本神穴", "POT:200:JING:300","2200"}),
        "tongren d9"    :  ({"陽維脈","頭臨泣穴", "POT:200","600"}),
        "tongren d10"   :  ({"陽維脈","目窗穴", "POT:500:MINGSI:1","5500"}),
        "tongren d11"   :  ({"陽維脈","正營穴", "POT:500","600"}),
        "tongren d12"   :  ({"陽維脈","腦空穴", "POT:700:AMR:20","3500"}),
        "tongren d13"   :  ({"陽維脈","承靈穴", "POT:200","600"}),
        "tongren d14"   :  ({"陽維脈","風池穴", "POT:300:ATK:10","2200"}),
        "tongren d15"   :  ({"陽維脈","風府穴", "POT:500","600"}),
        "tongren d16"   :  ({"陽維脈","啞門穴", "POT:300","600"}),
        "tongren d17"   :  ({"陽維脈","雲門穴", "POT:100:NEI:200","1200"}),
        "tongren d18"   :  ({"陽維脈","尺澤穴", "POT:100","600"}),
        "tongren d19"   :  ({"陽維脈","孔最穴", "POT:400:JING:200","2000"}),
        "tongren d20"   :  ({"陽維脈","列缺穴", "POT:300","600"}),
        "tongren d21"   :  ({"陽維脈","經渠穴", "POT:600","600"}),
        "tongren d22"   :  ({"陽維脈","太淵穴", "POT:100:MINGSI:2","12000"}),
        "tongren d23"   :  ({"陽維脈","魚際穴", "POT:400","600"}),
        "tongren d24"   :  ({"陽維脈","少商穴", "POT:300","600"}),

        // 帶脈
        "tongren e1"    :  ({"帶脈","帶脈穴", "QI:200:NEI:50","1000"}),
        "tongren e2"    :  ({"帶脈","五樞穴", "ATK:20","1200"}),
        "tongren e3"    :  ({"帶脈","維道穴", "JIALI:50","1200"}),
        "tongren e4"    :  ({"帶脈","天衝穴", "AMR:10","1200"}),
        "tongren e5"    :  ({"帶脈","浮白穴", "WEAPON:10","6000"}),
        "tongren e6"    :  ({"帶脈","頭竅陰穴", "_INT:2","4000"}),
        "tongren e7"    :  ({"帶脈","完骨穴", "NEI:100","1000"}),
        "tongren e8"    :  ({"帶脈","本神穴", "JIALI:20","1200"}),
        "tongren e9"    :  ({"帶脈","陽白穴", "QI:50","1000"}),
        "tongren e10"   :  ({"帶脈","頭臨泣穴", "JIALI:20","1800"}),
        "tongren e11"   :  ({"帶脈","目窗穴", "JIALI:30","1800"}),
        "tongren e12"   :  ({"帶脈","正營穴", "JIALI:40","1800"}),
        "tongren e13"   :  ({"帶脈","承靈穴", "JIALI:10","1800"}),
        "tongren e14"   :  ({"帶脈","腦空穴", "JIALI:60","1800"}),
        "tongren e15"   :  ({"帶脈","外丘穴", "JIALI:30","1800"}),
        "tongren e16"   :  ({"帶脈","光明穴", "JIALI:30","1800"}),
        "tongren e17"   :  ({"帶脈","陽輔穴", "JIALI:80","1800"}),
        "tongren e18"   :  ({"帶脈","懸鐘穴", "JIALI:10","1800"}),
        "tongren e19"   :  ({"帶脈","丘墟穴", "JIALI:40","1800"}),

        // 衝脈
        "tongren f1"    :  ({"衝脈","會陰穴", "QI:200","1000"}),
        "tongren f2"    :  ({"衝脈","陰交穴", "AMR:10","1000"}),
        "tongren f3"    :  ({"衝脈","氣衝穴", "AMR:10","1000"}),
        "tongren f4"    :  ({"衝脈","橫骨穴", "ATK:20","1000"}),
        "tongren f5"    :  ({"衝脈","大赫穴", "JIALI:50","1000"}),
        "tongren f6"    :  ({"衝脈","氣穴", "JING:20","1000"}),
        "tongren f7"    :  ({"衝脈","四滿穴", "JING:30","1000"}),
        "tongren f8"    :  ({"衝脈","中注穴", "AMR:20","2000"}),
        "tongren f9"    :  ({"衝脈","盲俞穴", "AMR:30","3000"}),
        "tongren f10"   :  ({"衝脈","商曲穴", "AMR:40","4000"}),
        "tongren f11"   :  ({"衝脈","石關穴", "NEI:50","1000"}),
        "tongren f12"   :  ({"衝脈","陰都穴", "QI:100","1000"}),
        "tongren f13"   :  ({"衝脈","通谷穴", "FOOD:100","1000"}),
        "tongren f14"   :  ({"衝脈","幽門穴", "FOOD:200","1000"}),
        "tongren f15"   :  ({"衝脈","關門穴", "WATER:100","1000"}),
        "tongren f16"   :  ({"衝脈","太乙穴", "WATER:200","1000"}),
        "tongren f17"   :  ({"衝脈","歸來穴", "ADDPOT:600000","1000"}),
        "tongren f18"   :  ({"衝脈","大巨穴", "KANGDU:1","4000"}),
        "tongren f19"   :  ({"衝脈","天樞穴", "KANGDU:2","10000"}),
        "tongren f20"   :  ({"衝脈","氣舍穴", "QI:20","1000"}),
        "tongren f21"   :  ({"衝脈","水突穴", "AMR:40","4000"}),
        "tongren f22"   :  ({"衝脈","水道穴", "DMG:10","4000"}),
        "tongren f23"   :  ({"衝脈","外陵穴", "DMG:30","22000"}),
        "tongren f24"   :  ({"衝脈","滑肉門穴", "_DEX:6","8000"}),

        // 督外脈
        "tongren g1"    :  ({"督外脈","長強穴", "JIALI:60","4000"}),
        "tongren g2"    :  ({"督外脈","腰俞穴", "JIALI:20","4000"}),
        "tongren g3"    :  ({"督外脈","陽關入命門穴", "JIALI:30","4000"}),
        "tongren g4"    :  ({"督外脈","上行懸樞穴", "JIALI:40","4000"}),
        "tongren g5"    :  ({"督外脈","脊中穴", "JIALI:100","4000"}),
        "tongren g6"    :  ({"督外脈","至中樞穴", "JIALI:20","4000"}),
        "tongren g7"    :  ({"督外脈","筋縮穴", "JIALI:10","4000"}),
        "tongren g8"    :  ({"督外脈","至陽歸靈台穴", "JIALI:40","4000"}),
        "tongren g9"    :  ({"督外脈","神道穴", "JIALI:20","4000"}),
        "tongren g10"   :  ({"督外脈","身柱穴", "JIALI:30","4000"}),
        "tongren g11"   :  ({"督外脈","陶道開穴", "JIALI:40","4000"}),
        "tongren g12"   :  ({"督外脈","大椎穴", "JIALI:50","4000"}),
        "tongren g13"   :  ({"督外脈","啞門連風府穴", "JIALI:60","4000"}),
        "tongren g14"   :  ({"督外脈","腦户穴", "JIALI:10","4000"}),
        "tongren g15"   :  ({"督外脈","強間穴", "JIALI:5:DMG:10","12000"}),
        "tongren g16"   :  ({"督外脈","後頂排穴", "JIALI:10","4000"}),
        "tongren g17"   :  ({"督外脈","百合穴", "JIALI:80","4000"}),
        "tongren g18"   :  ({"督外脈","前頂通囟會穴", "JIALI:120","4000"}),
        "tongren g19"   :  ({"督外脈","上星穴", "JIALI:30","4000"}),
        "tongren g20"   :  ({"督外脈","神庭穴", "JIALI:20","4000"}),
        "tongren g21"   :  ({"督外脈","素穴", "JIALI:20","4000"}),
        "tongren g22"   :  ({"督外脈","水溝穴", "JIALI:10","4000"}),
        "tongren g23"   :  ({"督外脈","兑端穴", "JIALI:20","4000"}),
        "tongren g24"   :  ({"督外脈","齦交穴", "JIALI:15","4000"}),

        // 任外脈
        "tongren h1"    :  ({"任外脈","曲骨穴", "QI:20:_CON:2","6000"}),
        "tongren h2"    :  ({"任外脈","中極穴", "QI:20:_STR:2","9000"}),
        "tongren h3"    :  ({"任外脈","關元穴", "QI:20:_STR:1","6000"}),
        "tongren h4"    :  ({"任外脈","下脘穴", "QI:20:_DEX:4","6000"}),
        "tongren h5"    :  ({"任外脈","中脘穴", "NEI:20:_DEX:1","6000"}),
        "tongren h6"    :  ({"任外脈","上脘穴", "NEI:20:_INT:2","12000"}),
        "tongren h7"    :  ({"任外脈","天突穴", "NEI:20:_INT:1","9000"}),
        "tongren h8"    :  ({"任外脈","廉泉穴", "NEI:20:_CON:4","6000"}),
        "tongren h9"    :  ({"任外脈","承漿穴", "NEI:20:_INT:1","9000"}),
        "tongren h10"   :  ({"任外脈","大鐘穴", "JING:20:_DEX:2","6000"}),
        "tongren h11"   :  ({"任外脈","水泉穴", "JING:20:_STR:5","25000"}),
        "tongren h12"   :  ({"任外脈","大赫穴", "JING:20:_CON:1","6000"}),
        "tongren h13"   :  ({"任外脈","靈墟穴", "JING:20:_CON:2","6000"}),
        "tongren h14"   :  ({"任外脈","箕門穴", "MAR:20:_STR:1","6000"}),
        "tongren h15"   :  ({"任外脈","湧泉穴", "MAR:20:_INT:1","9000"}),
        "tongren h16"   :  ({"任外脈","神封穴", "MAR:20:_DEX:2","6000"}),
        "tongren h17"   :  ({"任外脈","地機穴", "MAR:20:_DEX:3","6000"}),
        "tongren h18"   :  ({"任外脈","血海穴", "POT:20:_INT:1","9000"}),
        "tongren h19"   :  ({"任外脈","腹通谷穴", "POT:20:_STR:1","6000"}),
        "tongren h20"   :  ({"任外脈","步廊穴", "POT:20:_DEX:2","6000"}),
        "tongren h21"   :  ({"任外脈","神藏穴", "POT:20:_INT:1","9000"}),
        "tongren h22"   :  ({"任外脈","俞府穴", "JIALI:20:_INT:4","18000"}),
        "tongren h23"   :  ({"任外脈","腹溜穴", "JIALI:20:_CON:4","6000"}),
        "tongren h24"   :  ({"任外脈","陰陵穴", "JIALI:20:_STR:4","18000"}),

        // 經外奇脈
        "tongren i1"    :  ({"經外奇脈","神聰穴", "JING:20","8000"}),
        "tongren i2"    :  ({"經外奇脈","印堂穴", "JING:30","8000"}),
        "tongren i3"    :  ({"經外奇脈","魚腰穴", "JING:40","8000"}),
        "tongren i4"    :  ({"經外奇脈","太陽穴", "JING:500","30000"}),
        "tongren i5"    :  ({"經外奇脈","耳尖穴", "JING:60","8000"}),
        "tongren i6"    :  ({"經外奇脈","球后穴", "NEI:30","8000"}),
        "tongren i7"    :  ({"經外奇脈","金津穴", "NEI:30","8000"}),
        "tongren i8"    :  ({"經外奇脈","玉液穴", "NEI:30","8000"}),
        "tongren i9"    :  ({"經外奇脈","八邪穴", "NEI:30","8000"}),
        "tongren i10"   :  ({"經外奇脈","四縫穴", "NEI:30","8000"}),
        "tongren i11"   :  ({"經外奇脈","翳明穴", "QI:50","8000"}),
        "tongren i12"   :  ({"經外奇脈","定喘穴", "QI:60","8000"}),
        "tongren i13"   :  ({"經外奇脈","十宣穴", "QI:70","8000"}),
        "tongren i14"   :  ({"經外奇脈","腰奇穴", "QI:80","8000"}),
        "tongren i15"   :  ({"經外奇脈","夾脊穴", "QI:90","8000"}),
        "tongren i16"   :  ({"經外奇脈","二白穴", "QI:100","8000"}),
        "tongren i17"   :  ({"經外奇脈","腰痛點穴", "MAR:10","8000"}),
        "tongren i18"   :  ({"經外奇脈","鶴頂穴", "MAR:20","8000"}),
        "tongren i19"   :  ({"經外奇脈","百蟲窩穴", "MAR:30","8000"}),
        "tongren i20"   :  ({"經外奇脈","膝眼穴", "MAR:40","8000"}),
        "tongren i21"   :  ({"經外奇脈","膽囊穴", "DMG:10","30000"}),
        "tongren i22"   :  ({"經外奇脈","闌尾穴", "AMR:40","30000"}),
        "tongren i23"   :  ({"經外奇脈","八風穴", "ATK:10","30000"}),
]);

// 無名銅人鑑定出的大周天銅人列表
mapping tongren_list2 = ([

                     //({ 經脈名, 穴位名，衝穴效果，消耗內力})
        // 手太陰脈
        "tongren j1"    :  ({"手太陰脈","少商穴", "QI:50","100"}),
        "tongren j2"    :  ({"手太陰脈","太淵穴", "QI:30","150"}),
        "tongren j3"    :  ({"手太陰脈","中府穴", "QI:20","200"}),
        "tongren j4"    :  ({"手太陰脈","魚際穴", "NEI:10","200"}),
        "tongren j5"    :  ({"手太陰脈","雲門穴", "NEI:30","200"}),
        "tongren j6"    :  ({"手太陰脈","天府穴", "QI:10","200"}),
        "tongren j7"    :  ({"手太陰脈","經渠穴", "NEI:20","100"}),
        "tongren j8"    :  ({"手太陰脈","尺澤穴", "JING:10","200"}),
        "tongren j9"    :  ({"手太陰脈","俠白穴", "JING:10","100"}),
        "tongren j10"   :  ({"手太陰脈","列缺穴", "POT:100","100"}),


        // 手太陽脈
        "tongren k1"    :  ({"手太陽脈","少澤穴", "JING:20:_INT:1","300"}),
        "tongren k2"    :  ({"手太陽脈","前谷穴", "JING:30","300"}),
        "tongren k3"    :  ({"手太陽脈","顴髎穴", "JING:40","500"}),
        "tongren k4"    :  ({"手太陽脈","後溪穴", "JING:80:ATK:10","900"}),
        "tongren k5"    :  ({"手太陽脈","腕骨穴", "JING:60","800"}),
        "tongren k6"    :  ({"手太陽脈","肩髃穴", "NEI:30","300"}),
        "tongren k7"    :  ({"手太陽脈","天容穴", "NEI:30:AMR:10","300"}),
        "tongren k8"    :  ({"手太陽脈","秉風穴", "NEI:30","300"}),
        "tongren k9"    :  ({"手太陽脈","聽宮穴", "NEI:30","400"}),
        "tongren k10"   :  ({"手太陽脈","肩中俞穴", "NEI:30:JING:20","400"}),
        "tongren k11"   :  ({"手太陽脈","天宗穴", "JING:20","300"}),
        "tongren k12"   :  ({"手太陽脈","肩外俞穴", "JING:30","300"}),
        "tongren k13"   :  ({"手太陽脈","養老穴", "JING:40:NEI:30","300"}),
        "tongren k14"   :  ({"手太陽脈","陽骨穴", "JING:50","1200"}),
        "tongren k15"   :  ({"手太陽脈","曲垣穴", "JING:60:_DEX:1","1200"}),
        "tongren k16"   :  ({"手太陽脈","天窗穴", "NEI:30","2000"}),
        "tongren k17"   :  ({"手太陽脈","支正穴", "NEI:30","1000"}),
        "tongren k18"   :  ({"手太陽脈","儒俞穴", "NEI:30:_CON:1","1100"}),
        "tongren k19"   :  ({"手太陽脈","小海穴", "NEI:30","1200"}),
        "tongren k20"   :  ({"手太陽脈","肩貞穴", "NEI:30","500"}),


        // 足太陰脈
        "tongren l1"    :  ({"足太陰脈","血海穴", "QI:20:NEI:20","800"}),
        "tongren l2"    :  ({"足太陰脈","陰陵穴", "QI:30:JING:10","800"}),
        "tongren l3"    :  ({"足太陰脈","地機穴", "QI:40","800"}),
        "tongren l4"    :  ({"足太陰脈","箕門穴", "QI:50:_DEX:1","800"}),
        "tongren l5"    :  ({"足太陰脈","商丘穴", "QI:60","800"}),
        "tongren l6"    :  ({"足太陰脈","公孫穴", "NEI:30:POT:100","800"}),
        "tongren l7"    :  ({"足太陰脈","隱白穴", "NEI:30","800"}),
        "tongren l8"    :  ({"足太陰脈","大都穴", "NEI:30:MAR:50","4000"}),
        "tongren l9"    :  ({"足太陰脈","太白穴", "NEI:30","3400"}),
        "tongren l10"   :  ({"足太陰脈","漏骨穴", "NEI:30","800"}),
        "tongren l11"   :  ({"足太陰脈","衝門穴", "JING:20","800"}),
        "tongren l12"   :  ({"足太陰脈","府舍穴", "QI:30:DMG:10","1500"}),
        "tongren l13"   :  ({"足太陰脈","三陰交穴", "JING:40","800"}),
        "tongren l14"   :  ({"足太陰脈","腹結穴", "QI:50","800"}),
        "tongren l15"   :  ({"足太陰脈","大橫穴", "JING:60:_STR:2","800"}),
        "tongren l16"   :  ({"足太陰脈","腹哀穴", "QI:30","800"}),
        "tongren l17"   :  ({"足太陰脈","食竇穴", "QI:30","800"}),
        "tongren l18"   :  ({"足太陰脈","胸鄉穴", "NEI:30:AMR:10","800"}),
        "tongren l19"   :  ({"足太陰脈","大包穴", "NEI:30","1500"}),
        "tongren l20"   :  ({"足太陰脈","周榮穴", "NEI:30","800"}),
        "tongren l21"   :  ({"足太陰脈","天溪穴", "NEI:30:DMG:10","800"}),


        // 足太陽脈
        "tongren m1"    :  ({"足太陽脈","跗陽穴", "JING:20:QI:40","600"}),
        "tongren m2"    :  ({"足太陽脈","崑崙穴", "JING:30:JIALI:10","600"}),
        "tongren m3"    :  ({"足太陽脈","晴明穴", "JING:40","2000"}),
        "tongren m4"    :  ({"足太陽脈","飛揚穴", "JING:50","600"}),
        "tongren m5"    :  ({"足太陽脈","攢竹穴", "JING:60:JIALI:10","3000"}),
        "tongren m6"    :  ({"足太陽脈","風門穴", "NEI:30","1200"}),
        "tongren m7"    :  ({"足太陽脈","僕申穴", "NEI:30:ATK:10","1000"}),
        "tongren m8"    :  ({"足太陽脈","申脈穴", "NEI:30","2200"}),
        "tongren m9"    :  ({"足太陽脈","曲差穴", "NEI:30","600"}),
        "tongren m10"   :  ({"足太陽脈","眉衝穴", "NEI:30:JIALI:20","5500"}),
        "tongren m11"   :  ({"足太陽脈","五處穴", "QI:20","600"}),
        "tongren m12"   :  ({"足太陽脈","肺俞穴", "QI:30","3500"}),
        "tongren m13"   :  ({"足太陽脈","金門穴", "QI:40","600"}),
        "tongren m14"   :  ({"足太陽脈","京骨穴", "QI:50:ATK:10","2200"}),
        "tongren m15"   :  ({"足太陽脈","通天穴", "QI:60","600"}),
        "tongren m16"   :  ({"足太陽脈","承光穴", "NEI:30","600"}),
        "tongren m17"   :  ({"足太陽脈","絡卻穴", "NEI:30","1200"}),
        "tongren m18"   :  ({"足太陽脈","厥陰俞穴", "NEI:30:JIALI:30","600"}),
        "tongren m19"   :  ({"足太陽脈","束骨穴", "NEI:30","2000"}),
        "tongren m20"   :  ({"足太陽脈","足通骨穴", "NEI:30","600"}),
        "tongren m21"   :  ({"足太陽脈","天柱穴", "NEI:20","600"}),
        "tongren m22"   :  ({"足太陽脈","玉枕穴", "POT:20","12000"}),
        "tongren m23"   :  ({"足太陽脈","大紓穴", "POT:30:AMR:10","600"}),
        "tongren m24"   :  ({"足太陽脈","心俞穴", "POT:20","600"}),
        "tongren m25"   :  ({"足太陽脈","督俞穴", "POT:10:DMG:10","600"}),
        "tongren m26"   :  ({"足太陽脈","脾俞穴", "POT:60","2000"}),
        "tongren m27"   :  ({"足太陽脈","承山穴", "POT:10","600"}),
        "tongren m28"   :  ({"足太陽脈","胃俞穴", "NEI:30","600"}),
        "tongren m29"   :  ({"足太陽脈","上髎穴", "NEI:30:JIALI:20","12000"}),
        "tongren m30"   :  ({"足太陽脈","膈俞穴", "NEI:30","600"}),
        "tongren m31"   :  ({"足太陽脈","三焦俞穴", "NEI:20","600"}),
        "tongren m32"   :  ({"足太陽脈","氣海俞穴", "JING:20","2000"}),
        "tongren m33"   :  ({"足太陽脈","腎俞穴", "JING:30","600"}),
        "tongren m34"   :  ({"足太陽脈","次髎穴", "JING:20","600"}),
        "tongren m35"   :  ({"足太陽脈","肝俞穴", "JING:10","12000"}),
        "tongren m36"   :  ({"足太陽脈","關元俞穴", "JING:60","600"}),
        "tongren m37"   :  ({"足太陽脈","大腸俞穴", "NEI:30","600"}),
        "tongren m38"   :  ({"足太陽脈","小腸俞穴", "NEI:30","600"}),
        "tongren m39"   :  ({"足太陽脈","中髎穴", "NEI:30:JIALI:20","2000"}),
        "tongren m40"   :  ({"足太陽脈","膀胱俞穴", "POT:30","600"}),
        "tongren m41"   :  ({"足太陽脈","白環俞穴", "POT:30","600"}),
        "tongren m42"   :  ({"足太陽脈","下髎穴", "POT:30","12000"}),
        "tongren m43"   :  ({"足太陽脈","會陽穴", "POT:20","600"}),
        "tongren m44"   :  ({"足太陽脈","委陽穴", "JING:30:DMG:10","600"}),
        "tongren m45"   :  ({"足太陽脈","合陽穴", "JING:40:ATK:20","2000"}),
        "tongren m46"   :  ({"足太陽脈","委中穴", "JING:10","600"}),
        "tongren m47"   :  ({"足太陽脈","附分穴", "JING:30","600"}),
        "tongren m48"   :  ({"足太陽脈","承扶穴", "NEI:30","12000"}),
        "tongren m49"   :  ({"足太陽脈","膏肓穴", "NEI:30:_STR:2","600"}),
        "tongren m50"   :  ({"足太陽脈","魄户穴", "NEI:30","600"}),
        "tongren m51"   :  ({"足太陽脈","肓門穴", "NEI:30","600"}),
        "tongren m52"   :  ({"足太陽脈","神堂穴", "NEI:30","2000"}),
        "tongren m53"   :  ({"足太陽脈","殷門穴", "JING:20:JIALI:40","600"}),
        "tongren m54"   :  ({"足太陽脈","膈關穴", "JING:30","600"}),
        "tongren m55"   :  ({"足太陽脈","志室穴", "JING:20","12000"}),
        "tongren m56"   :  ({"足太陽脈","魂門穴", "JING:50","600"}),
        "tongren m57"   :  ({"足太陽脈","意舍穴", "JING:60:_INT:2","600"}),
        "tongren m58"   :  ({"足太陽脈","陽剛穴", "NEI:30:JING:50","2000"}),

        // 手少陰脈
        "tongren n1"    :  ({"手少陰脈","陰郗穴", "JING:20:_DEX:3","1000"}),
        "tongren n2"    :  ({"手少陰脈","通裏穴", "JING:30","1200"}),
        "tongren n3"    :  ({"手少陰脈","少府穴", "JING:40","1200"}),
        "tongren n4"    :  ({"手少陰脈","少衝穴", "JING:50:NEI:30","1200"}),
        "tongren n5"    :  ({"手少陰脈","靈道穴", "JING:60","6000"}),
        "tongren n6"    :  ({"手少陰脈","神門穴", "NEI:30","4000"}),
        "tongren n7"    :  ({"手少陰脈","青靈穴", "NEI:30:_INT:2","1000"}),
        "tongren n8"    :  ({"手少陰脈","少海穴", "NEI:30","1200"}),
        "tongren n9"    :  ({"手少陰脈","極泉穴", "NEI:30:_STR:2","1000"}),


        // 手少陽脈
        "tongren o1"    :  ({"手少陽脈","翳風穴", "NEI:20:JING:20","1000"}),
        "tongren o2"    :  ({"手少陽脈","絲竹空穴", "NEI:30:ATK:10","1000"}),
        "tongren o3"    :  ({"手少陽脈","耳門穴", "NEI:40","1000"}),
        "tongren o4"    :  ({"手少陽脈","耳門髎穴", "JING:20:AMR:10","1000"}),
        "tongren o5"    :  ({"手少陽脈","天髎穴", "JING:30","1000"}),
        "tongren o6"    :  ({"手少陽脈","支溝穴", "JING:40:JIALI:20","1000"}),
        "tongren o7"    :  ({"手少陽脈","關衝穴", "JING:50:JIALI:30","1000"}),
        "tongren o8"    :  ({"手少陽脈","液門穴", "JING:60","2000"}),
        "tongren o9"    :  ({"手少陽脈","天井穴", "NEI:30","3000"}),
        "tongren o10"   :  ({"手少陽脈","青冷淵穴", "NEI:30:MAR:50","4000"}),
        "tongren o11"   :  ({"手少陽脈","顱息穴", "NEI:30","1000"}),
        "tongren o12"   :  ({"手少陽脈","角孫穴", "NEI:30:DMG:10","1000"}),
        "tongren o13"   :  ({"手少陽脈","肩髎穴", "QI:20","1000"}),
        "tongren o14"   :  ({"手少陽脈","外關穴", "QI:30","1000"}),
        "tongren o15"   :  ({"手少陽脈","四瀆穴", "QI:40","1000"}),
        "tongren o16"   :  ({"手少陽脈","消濼穴", "QI:50:_STR:1","1000"}),
        "tongren o17"   :  ({"手少陽脈","儒會穴", "QI:60","1000"}),
        "tongren o18"   :  ({"手少陽脈","陽池穴", "QI:30","4000"}),
        "tongren o19"   :  ({"手少陽脈","中澤穴", "QI:30:DMG:10","10000"}),
        "tongren o20"   :  ({"手少陽脈","會宗穴", "NEI:30","1000"}),
        "tongren o21"   :  ({"手少陽脈","三陽絡穴", "NEI:30:JING:20","4000"}),


        // 足少陰脈
        "tongren p1"    :  ({"足少陰脈","大鐘穴", "POT:50:WEAPON:10","4000"}),
        "tongren p2"    :  ({"足少陰脈","太溪穴", "POT:30","4000"}),
        "tongren p3"    :  ({"足少陰脈","然谷穴", "POT:40","4000"}),
        "tongren p4"    :  ({"足少陰脈","湧泉穴", "POT:20:JIALI:10","4000"}),
        "tongren p5"    :  ({"足少陰脈","交信穴", "POT:30","4000"}),
        "tongren p6"    :  ({"足少陰脈","照海穴", "POT:40","4000"}),
        "tongren p7"    :  ({"足少陰脈","水泉穴", "POT:50:ATK:30","4000"}),
        "tongren p8"    :  ({"足少陰脈","橫骨穴", "POT:60","4000"}),
        "tongren p9"    :  ({"足少陰脈","商曲穴", "NEI:30:JIALI:20","4000"}),
        "tongren p10"   :  ({"足少陰脈","石關穴", "NEI:30","4000"}),
        "tongren p11"   :  ({"足少陰脈","陰都穴", "NEI:30","4000"}),
        "tongren p12"   :  ({"足少陰脈","腹通谷穴", "NEI:30:MINGSI:1","4000"}),
        "tongren p13"   :  ({"足少陰脈","幽門穴", "JING:20","4000"}),
        "tongren p14"   :  ({"足少陰脈","肓俞穴", "JING:30","4000"}),
        "tongren p15"   :  ({"足少陰脈","中注穴", "JING:40:DMG:20","12000"}),
        "tongren p16"   :  ({"足少陰脈","氣穴", "JING:20","4000"}),
        "tongren p17"   :  ({"足少陰脈","復溜穴", "JING:30","4000"}),
        "tongren p18"   :  ({"足少陰脈","大赫穴", "QI:10:JIALI:20","4000"}),
        "tongren p19"   :  ({"足少陰脈","陰谷穴", "QI:10","4000"}),
        "tongren p20"   :  ({"足少陰脈","築賓穴", "QI:10:JIALI:20","4000"}),
        "tongren p21"   :  ({"足少陰脈","四滿穴", "QI:10","4000"}),
        "tongren p22"   :  ({"足少陰脈","神封穴", "QI:10","4000"}),
        "tongren p23"   :  ({"足少陰脈","靈墟穴", "QI:10:WEAPON:10","4000"}),
        "tongren p24"   :  ({"足少陰脈","俞府穴", "NEI:30","4000"}),
        "tongren p25"   :  ({"足少陰脈","神藏穴", "NEI:30:JIALI:30","4000"}),

        // 足少陽脈
        "tongren q1"    :  ({"足少陽脈","風池穴", "NEI:320:KANGDU:1","6000"}),
        "tongren q2"    :  ({"足少陽脈","腦空穴", "NEI:130:FOOD:100","9000"}),
        "tongren q3"    :  ({"足少陽脈","頭竅陰穴", "NEI:340:_CON:1","6000"}),
        "tongren q4"    :  ({"足少陽脈","肩井穴", "NEI:120","6000"}),
        "tongren q5"    :  ({"足少陽脈","陽陵泉穴", "NEI:130:KANGDU:1","6000"}),
        "tongren q6"    :  ({"足少陽脈","浮白穴", "NEI:130:FOOD:100","12000"}),
        "tongren q7"    :  ({"足少陽脈","天衝穴", "NEI:150:WATER:100","9000"}),
        "tongren q8"    :  ({"足少陽脈","完骨穴", "NEI:160","6000"}),
        "tongren q9"    :  ({"足少陽脈","正營穴", "NEI:130:_STR:1","9000"}),
        "tongren q10"   :  ({"足少陽脈","目窗穴", "NEI:130","6000"}),
        "tongren q11"   :  ({"足少陽脈","頭臨泣穴", "NEI:130","25000"}),
        "tongren q12"   :  ({"足少陽脈","陽白穴", "NEI:130:_STR:1","6000"}),
        "tongren q13"   :  ({"足少陽脈","本神穴", "NEI:120","6000"}),
        "tongren q14"   :  ({"足少陽脈","環跳穴", "NEI:130:_CON:1","6000"}),
        "tongren q15"   :  ({"足少陽脈","京門穴", "NEI:140","9000"}),
        "tongren q16"   :  ({"足少陽脈","居髎穴", "NEI:120:_STR:1","6000"}),
        "tongren q17"   :  ({"足少陽脈","淵腋穴", "NEI:130","6000"}),
        "tongren q18"   :  ({"足少陽脈","上關穴", "NEI:140","9000"}),
        "tongren q19"   :  ({"足少陽脈","懸顱穴", "NEI:120:WATER:100","6000"}),
        "tongren q20"   :  ({"足少陽脈","聽會穴", "NEI:130","6000"}),
        "tongren q21"   :  ({"足少陽脈","五樞穴", "NEI:140","9000"}),
        "tongren q22"   :  ({"足少陽脈","足竅陰穴", "NEI:150:KANGDU:1","18000"}),
        "tongren q23"   :  ({"足少陽脈","曲鬢穴", "NEI:160","6000"}),
        "tongren q24"   :  ({"足少陽脈","懸釐穴", "NEI:130:FOOD:100","18000"}),
        "tongren q25"   :  ({"足少陽脈","瞳子髎穴", "NEI:130","6000"}),
        "tongren q26"   :  ({"足少陽脈","帶脈穴", "NEI:120:KANGDU:1","6000"}),
        "tongren q27"   :  ({"足少陽脈","率谷穴", "NEI:130","9000"}),
        "tongren q28"   :  ({"足少陽脈","風市穴", "NEI:140","6000"}),
        "tongren q29"   :  ({"足少陽脈","陽交穴", "NEI:120:_STR:1","6000"}),
        "tongren q30"   :  ({"足少陽脈","外丘穴", "NEI:130","9000"}),
        "tongren q31"   :  ({"足少陽脈","維道穴", "NEI:140:FOOD:100","6000"}),
        "tongren q32"   :  ({"足少陽脈","日月穴", "NEI:120:WATER:100","6000"}),
        "tongren q33"   :  ({"足少陽脈","地五會穴", "NEI:130","9000"}),
        "tongren q34"   :  ({"足少陽脈","俠溪穴", "NEI:210:_CON:1","18000"}),
        "tongren q35"   :  ({"足少陽脈","丘墟穴", "NEI:150","6000"}),
        "tongren q36"   :  ({"足少陽脈","懸鐘穴", "NEI:160:_STR:1","18000"}),
        "tongren q37"   :  ({"足少陽脈","光明穴", "NEI:230","6000"}),
        "tongren q38"   :  ({"足少陽脈","陽輔穴", "NEI:330:_CON:1","18000"}),

        // 手陽明脈
        "tongren r1"    :  ({"手陽明脈","肘髎穴", "QI:20:ADDPOT:1000000","8000"}),
        "tongren r2"    :  ({"手陽明脈","手五里穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r3"    :  ({"手陽明脈","曲池穴", "QI:40:ADDPOT:1000000","8000"}),
        "tongren r4"    :  ({"手陽明脈","迎香穴", "QI:20:ADDPOT:1000000","30000"}),
        "tongren r5"    :  ({"手陽明脈","臂儒穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r6"    :  ({"手陽明脈","巨骨穴", "QI:40:ADDPOT:1000000","8000"}),
        "tongren r7"    :  ({"手陽明脈","天鼎穴", "QI:50:ADDPOT:1000000","8000"}),
        "tongren r8"    :  ({"手陽明脈","扶突穴", "QI:60:ADDPOT:1000000","8000"}),
        "tongren r9"    :  ({"手陽明脈","口禾髎穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r10"   :  ({"手陽明脈","合谷穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r11"   :  ({"手陽明脈","二間穴", "QI:30:ADDPOT:1000000","8000"}),
        "tongren r12"   :  ({"手陽明脈","三間穴", "FOOD:30:ADDPOT:1000000","8000"}),
        "tongren r13"   :  ({"手陽明脈","商陽穴", "FOOD:20:ADDPOT:1000000","8000"}),
        "tongren r14"   :  ({"手陽明脈","陽溪穴", "FOOD:30:ADDPOT:1000000","8000"}),
        "tongren r15"   :  ({"手陽明脈","手三裏穴", "FOOD:40:ADDPOT:1000000","8000"}),
        "tongren r16"   :  ({"手陽明脈","上廉穴", "WATER:20:ADDPOT:1000000","8000"}),
        "tongren r17"   :  ({"手陽明脈","下廉穴", "WATER:30:ADDPOT:1000000","8000"}),
        "tongren r18"   :  ({"手陽明脈","温溜穴", "WATER:40:ADDPOT:1000000","8000"}),
        "tongren r19"   :  ({"手陽明脈","偏歷穴", "WATER:20:ADDPOT:1000000","8000"}),

        // 足陽明脈
        "tongren s1"    :  ({"足陽明脈","承泣穴", "MAR:20:FOOD:100","8000"}),
        "tongren s2"    :  ({"足陽明脈","四白穴", "MAR:30:FOOD:100","8000"}),
        "tongren s3"    :  ({"足陽明脈","巨髎穴", "MAR:40:FOOD:100","8000"}),
        "tongren s4"    :  ({"足陽明脈","地倉穴", "MAR:20:FOOD:100","30000"}),
        "tongren s5"    :  ({"足陽明脈","下關穴", "MAR:30:FOOD:100","8000"}),
        "tongren s6"    :  ({"足陽明脈","頭維穴", "MAR:40:FOOD:100","8000"}),
        "tongren s7"    :  ({"足陽明脈","人迎穴", "MAR:50:FOOD:100","8000"}),
        "tongren s8"    :  ({"足陽明脈","水突穴", "MAR:60:FOOD:100","8000"}),
        "tongren s9"    :  ({"足陽明脈","氣舍穴", "NEI:30:WATER:100","8000"}),
        "tongren s10"   :  ({"足陽明脈","缺盆穴", "NEI:30:WATER:100","8000"}),
        "tongren s11"   :  ({"足陽明脈","氣户穴", "NEI:30:WATER:100","8000"}),
        "tongren s12"   :  ({"足陽明脈","庫房穴", "NEI:30:WATER:100","8000"}),
        "tongren s13"   :  ({"足陽明脈","大迎穴", "JING:20:WATER:100","8000"}),
        "tongren s14"   :  ({"足陽明脈","屋翳穴", "JING:30:WATER:100","8000"}),
        "tongren s15"   :  ({"足陽明脈","樑門穴", "POT:40:WATER:100","8000"}),
        "tongren s16"   :  ({"足陽明脈","乳中穴", "POT:20:ATK:10","8000"}),
        "tongren s17"   :  ({"足陽明脈","乳根穴", "POT:30","8000"}),
        "tongren s18"   :  ({"足陽明脈","不容穴", "POT:40:_DEX:2","8000"}),
        "tongren s19"   :  ({"足陽明脈","承滿穴", "POT:20:ATK:10","8000"}),
        "tongren s20"   :  ({"足陽明脈","關門穴", "POT:30","8000"}),
        "tongren s21"   :  ({"足陽明脈","太乙穴", "POT:40:DMG:10","8000"}),
        "tongren s22"   :  ({"足陽明脈","滑肉門穴", "POT:50:JIALI:30","8000"}),
        "tongren s23"   :  ({"足陽明脈","天樞穴", "POT:60","30000"}),
        "tongren s24"   :  ({"足陽明脈","外陵穴", "NEI:30:ATK:30","8000"}),
        "tongren s25"   :  ({"足陽明脈","大巨穴", "NEI:30","8000"}),
        "tongren s26"   :  ({"足陽明脈","水道穴", "JING:20:JIALI:50","8000"}),
        "tongren s27"   :  ({"足陽明脈","歸來穴", "JING:30","8000"}),
        "tongren s28"   :  ({"足陽明脈","氣衝穴", "JING:40:AMR:10","8000"}),
        "tongren s29"   :  ({"足陽明脈","伏兔穴", "JING:20","8000"}),
        "tongren s30"   :  ({"足陽明脈","陰市穴", "JING:30:ATK:10","8000"}),
        "tongren s31"   :  ({"足陽明脈","樑丘穴", "JING:40","8000"}),
        "tongren s32"   :  ({"足陽明脈","犢鼻穴", "QI:20:NEI:10","8000"}),
        "tongren s33"   :  ({"足陽明脈","上巨虛穴", "QI:30:ATK:10","8000"}),
        "tongren s34"   :  ({"足陽明脈","下巨虛穴", "QI:40","8000"}),
        "tongren s35"   :  ({"足陽明脈","豐隆穴", "QI:50","8000"}),
        "tongren s36"   :  ({"足陽明脈","解溪穴", "QI:60:JIALI:10","8000"}),
        "tongren s37"   :  ({"足陽明脈","衝陽穴", "QI:30","8000"}),
        "tongren s38"   :  ({"足陽明脈","陷骨穴", "QI:30:ATK:10","8000"}),
        "tongren s39"    :  ({"足陽明脈","內庭穴", "NEI:30:JIALI:10","8000"}),
        "tongren s40"    :  ({"足陽明脈","歷兑穴", "NEI:30:AMR:10","8000"}),

        // 手厥陰脈
        "tongren t1"    :  ({"手厥陰脈","內關穴", "JING:50:NEI:50","8000"}),
        "tongren t2"    :  ({"手厥陰脈","大陵穴", "JING:50:NEI:50","8000"}),
        "tongren t3"    :  ({"手厥陰脈","天泉穴", "JING:50:NEI:50","8000"}),
        "tongren t4"    :  ({"手厥陰脈","間使穴", "JING:50:_DEX:1","30000"}),
        "tongren t5"    :  ({"手厥陰脈","勞宮穴", "JING:50:_DEX:1","8000"}),
        "tongren t6"    :  ({"手厥陰脈","天池穴", "JING:50:_DEX:1","8000"}),
        "tongren t7"    :  ({"手厥陰脈","曲澤穴", "JING:50:_DEX:1","8000"}),
        "tongren t8"    :  ({"手厥陰脈","蹊門穴", "JING:50:MAR:50","8000"}),
        "tongren t9"    :  ({"手厥陰脈","中衝穴", "JING:50:MAR:50","8000"}),

        // 足厥陰脈
        "tongren u1"    :  ({"足厥陰脈","太沖穴", "JING:50:DMG:20","8000"}),
        "tongren u2"    :  ({"足厥陰脈","大敦穴", "JING:30:_CON:3","8000"}),
        "tongren u3"    :  ({"足厥陰脈","行間穴", "JING:40","8000"}),
        "tongren u4"    :  ({"足厥陰脈","中都穴", "JING:20:QI:20","30000"}),
        "tongren u5"    :  ({"足厥陰脈","臂溝穴", "JING:30:ATK:20","8000"}),
        "tongren u6"    :  ({"足厥陰脈","中封穴", "JING:40","8000"}),
        "tongren u7"    :  ({"足厥陰脈","章門穴", "JING:50:_DEX:2","8000"}),
        "tongren u8"    :  ({"足厥陰脈","足五里穴", "JING:60:NEI:50","8000"}),
        "tongren u9"    :  ({"足厥陰脈","膝關穴", "NEI:30:_DEX:1","8000"}),
        "tongren u10"   :  ({"足厥陰脈","曲泉穴", "JING:30:_CON:3","8000"}),
        "tongren u11"   :  ({"足厥陰脈","急脈穴", "JING:40:_STR:2","8000"}),
        "tongren u12"   :  ({"足厥陰脈","陰包穴", "JING:50","8000"}),
        "tongren u13"   :  ({"足厥陰脈","期門穴", "JING:60:QI:20","8000"}),
        "tongren u14"   :  ({"足厥陰脈","陰廉穴", "NEI:40:_STR:2","8000"}),
]);

string effect_desc(string effect)
{
        string *tmp;
        int n, i;
        string msg;

        msg = "";
        tmp = explode(effect, ":");
        n = sizeof(tmp);

        if( !n )return "未定義";

        for( i = 1; i <= n;i += 2 )
        {
                switch(tmp[i-1])
                {
                        case "QI":
                                msg += "提升氣血上限：" + tmp[i] + "點、";
                                break;
                        case "NEI":
                                msg += "提升內力上限：" + tmp[i] + "點、";
                                break;
                        case "ATK":
                                msg += "提升命中等級：+" + tmp[i];
                                break;
                        case "DMG":
                                msg += "提升傷害等級：+" + tmp[i];
                                break;
                        case "AMR":
                                msg += "提升防護等級：+" + tmp[i] + "點、";
                                break;
                        case "JIALI":
                                msg += "提升加力上限：" + tmp[i] + "點、";
                                break;
                        case "JING":
                                msg += "提升精力上限：" + tmp[i] + "點、";
                                break;
                        case "MAR":
                                msg += "提升體會上限：" + tmp[i] + "點、";
                                break;
                        case "POT":
                                msg += "提升潛能上限：" + tmp[i] + "點、";
                                break;
                        case "MINGSI":
                                msg += "提升冥思效率：+" + tmp[i] + "%、";
                                break;
                        case "FOOD":
                                msg += "提升食物上限：" + tmp[i] + "點、";
                                break;
                        case "WATER":
                                msg += "提升飲水上限：" + tmp[i] + "點、";
                                break;
                        case "KANGDU":
                                msg += "提升抗毒能力：+" + tmp[i] + "%、";
                                break;
                        case "_STR":
                                msg += "提升後天臂力：+" + tmp[i];
                                break;
                        case "_DEX":
                                msg += "提升後天身法：+" + tmp[i];
                                break;
                        case "_INT":
                                msg += "提升後天悟性：+" + tmp[i];
                                break;
                        case "_CON":
                                msg += "提升後天根骨：+" + tmp[i];
                                break;
                        case "STR":
                                msg += "提升先天臂力：+" + tmp[i];
                                break;
                        case "DEX":
                                msg += "提升先天身法：+" + tmp[i];
                                break;
                        case "INT":
                                msg += "提升先天悟性：+" + tmp[i];
                                break;
                        case "CON":
                                msg += "提升先天根骨：+" + tmp[i];
                                break;
                        case "WEAPON":
                                msg += "提升兵器傷害：+" + tmp[i] + "%、";
                                break;
                        case "ADDPOT":
                                msg += "衝穴後獲取潛能：" + tmp[i] + "點、";
                                break;
                        default:
                                return "未定義。";

                }
        }
        return msg;
}

void add_chongxue_effect(object me, string effect)
{
        string *tmp;
        int n, i, p;

        tmp = explode(effect, ":");
        n = sizeof(tmp);

        if( !n )
                return;

        // 每衝開一穴獲取10萬潛，3萬體會
        addn("potential", 100000, me);
        addn("experience", 30000, me);
        write(HIC "衝穴效果：" + effect_desc(effect) + "\n" NOR);
        write(HIY "衝穴獎勵：十萬點潛能及三萬點實戰體會。\n" NOR);

        // 增加效果
        for( i = 1; i <= n; i += 2 )
        {
                sscanf(tmp[i], "%d", p);

                switch(tmp[i-1])
                {
                        case "QI":
                                addn("jingmai/qi", p, me);
                                break;
                        case "NEI":
                                addn("jingmai/neili", p, me);
                                break;
                        case "ATK":
                                addn("jingmai/attack", p, me);
                                break;
                        case "DMG":
                                addn("jingmai/damage", p, me);
                                break;
                        case "AMR":
                                addn("jingmai/armor", p, me);
                                break;
                        case "JIALI":
                                addn("jingmai/jiali", p, me);
                                break;
                        case "JING":
                                addn("jingmai/jing", p, me);
                        case "MAR":
                                addn("jingmai/mar", p, me);
                                break;
                        case "POT":
                                addn("jingmai/pot", p, me);
                                break;
                        case "MINGSI":
                                addn("jingmai/reflect", p, me);
                                break;
                        case "FOOD":
                                addn("jingmai/food", p, me);
                                break;
                        case "WATER":
                                addn("jingmai/water", p, me);
                                break;
                        case "KANGDU":
                                addn("jingmai/avoid_poison", p, me);
                                break;
                        case "_STR":
                                addn("jingmai/str", p, me);
                                break;
                        case "_DEX":
                                addn("jingmai/dex", p, me);
                                break;
                        case "_INT":
                                addn("jingmai/int", p, me);
                                break;
                        case "_CON":
                                addn("jingmai/con", p, me);
                                break;
                        case "STR":
                                addn("str", p, me);
                                break;
                        case "DEX":
                                addn("dex", p, me);
                                break;
                        case "INT":
                                addn("int", p, me);
                                break;
                        case "CON":
                                addn("con", p, me);
                                break;
                        case "WEAPON":
                                addn("jingmai/weapon", p, me);
                                break;
                        case "ADDPOT":
                                addn("potential", p, me);
                                break;
                        default:
                                write("default error.\n");
                                return;
                }
        }
}

// 追加通脈效果
void add_jingmai_effect(object me, string jing)
{
        switch( jing )
        {
                case "陰蹺脈":
                        addn("jingmai/qi", 600, me);
                        addn("jingmai/neili", 200, me);
                        addn("jingmai/jingli", 200, me);
                        addn("jingmai/pot", 400, me);
                        addn("jingmai/damage", 20, me);
                        addn("jingmai/kar", 1, me);

                        MYGIFT_D->check_mygift(me, "newbie_mygift/yinqiaomai");
                        break;

                case "陽蹺脈":
                        addn("jingmai/qi", 20000, me);
                        addn("jingmai/neili", 800, me);
                        addn("jingmai/jingli", 600, me);
                        addn("jingmai/pot", 1000, me);
                        addn("jingmai/mar", 200, me);
                        addn("jingmai/armor", 50, me);
                        addn("jingmai/damage", 40, me);
                        addn("jingmai/magic_find", 1, me);
                        break;

                case "陰維脈":
                        addn("jingmai/qi", 1000, me);
                        addn("jingmai/neili", 5000, me);
                        addn("jingmai/mar", 1000, me);
                        addn("jingmai/attack", 40, me);
                        addn("jingmai/damage", 20, me);
                        break;

                case "陽維脈":
                        addn("jingmai/qi", 500, me);
                        addn("jingmai/neili", 500, me);
                        addn("jingmai/mar", 4000, me);
                        addn("jingmai/pot", 10000, me);
                        addn("jingmai/research_times", 100, me);
                        addn("jingmai/research_effect", 5, me);
                        addn("jingmai/derive_effect", 10, me);
                        addn("jingmai/reflect", 3, me);
                        break;

                case "帶脈":
                        addn("jingmai/qi", 500, me);
                        addn("jingmai/neili", 500, me);
                        addn("jingmai/jingli", 500, me);
                        addn("jingmai/jiali", 400, me);
                        addn("jingmai/damage", 100, me);
                        addn("jingmai/armor", 120, me);
                        addn("jingmai/attack", 120, me);
                        addn("jingmai/magic_find", 1, me);
                        addn("jingmai/kar", 1, me);
                        break;

                case "衝脈":
                        addn("jingmai/qi", 4000, me);
                        addn("jingmai/neili", 200, me);
                        addn("jingmai/jingli", 600, me);
                        addn("jingmai/damage", 20, me);
                        addn("jingmai/armor", 200, me);
                        break;

                case "督外脈":
                        addn("jingmai/qi", 300, me);
                        addn("jingmai/neili", 200, me);
                        addn("jingmai/damage", 300, me);
                        addn("jingmai/attack", 300, me);
                        addn("jingmai/jiali", 1000, me);
                        break;

                case "任外脈":
                        addn("jingmai/qi", 200, me);
                        addn("jingmai/neili", 100, me);
                        addn("jingmai/jingli", 100, me);
                        addn("jingmai/mar", 600, me);
                        addn("jingmai/pot", 200, me);
                        addn("jingmai/str", 60, me);
                        addn("jingmai/dex", 60, me);
                        addn("jingmai/con", 60, me);
                        addn("jingmai/int", 60, me);
                        addn("add_max_encumbrance", 100000, me);
                        break;

                case "經外奇脈":
                        addn("jingmai/qi", 20000, me);
                        addn("jingmai/neili", 10000, me);
                        addn("jingmai/jingli", 5000, me);
                        addn("jingmai/mar", 5000, me);
                        addn("jingmai/damage", 100, me);
                        addn("jingmai/armor", 100, me);
                        addn("jingmai/attack", 100, me);
                        addn("jingmai/magic_find", 2, me);
                        addn("jingmai/kar", 2, me);
                        //me->add("str", 1);
                        //me->add("dex", 1);
                        //me->add("con", 1);
                        addn("int", 1, me);
                        break;

                case "手太陰脈":
                        addn("jingmai/qi", 800, me);
                        addn("jingmai/neili", 400, me);
                        addn("jingmai/jingli", 400, me);
                        addn("jingmai/pot", 10000, me);
                        addn("jingmai/damage", 30, me);
                        addn("jingmai/attack", 40, me);
                        addn("jingmai/armor", 40, me);
                        break;

                case "手太陽脈":
                        addn("jingmai/qi", 2000, me);
                        addn("jingmai/neili", 1000, me);
                        addn("jingmai/jingli", 1000, me);
                        addn("jingmai/pot", 10000, me);
                        addn("jingmai/magic_find", 2, me);
                        addn("jingmai/damage", 50, me);
                        addn("jingmai/str", 10, me);
                        addn("jingmai/dex", 12, me);

                        break;

                case "足太陰脈":
                        addn("jingmai/qi", 2000, me);
                        addn("jingmai/jingli", 1000, me);
                        addn("jingmai/neili", 2000, me);
                        addn("jingmai/pot", 30000, me);
                        addn("jingmai/damage", 50, me);
                        addn("jingmai/kar", 2, me);
                        addn("jingmai/str", 10, me);
                        addn("jingmai/con", 12, me);

                        break;

                case "足太陽脈":
                        addn("jingmai/qi", 20000, me);
                        addn("jingmai/jingli", 10000, me);
                        addn("jingmai/neili", 10000, me);
                        addn("jingmai/pot", 100000, me);
                        addn("jingmai/mar", 50000, me);
                        addn("jingmai/kar", 4, me);
                        addn("jingmai/magic_find", 4, me);
                        addn("jingmai/damage", 400, me);
                        addn("jingmai/attack", 200, me);
                        //me->add("int", 3);
                        //me->add("dex", 1);
                        addn("str", 1, me);
                        //me->add("con", 1);

                        break;

                case "手少陰脈":
                        addn("jingmai/qi", 1000, me);
                        addn("jingmai/neili", 400, me);
                        addn("jingmai/jingli", 400, me);
                        addn("jingmai/pot", 2000, me);
                        addn("jingmai/armor", 100, me);
                        addn("jingmai/str", 6, me);
                        addn("jingmai/int", 6, me);
                        addn("jingmai/dex", 6, me);
                        addn("jingmai/con", 6, me);

                        break;

                case "手少陽脈":
                        addn("jingmai/qi", 2000, me);
                        addn("jingmai/neili", 5000, me);
                        addn("jingmai/jingli", 5000, me);
                        addn("jingmai/pot", 5000, me);
                        addn("jingmai/mar", 3000, me);
                        addn("jingmai/research_effect", 8, me);
                        break;

                case "足少陰脈":
                        addn("jingmai/qi", 3000, me);
                        addn("jingmai/neili", 3000, me);
                        addn("jingmai/jingli", 2000, me);
                        addn("jingmai/pot", 1000, me);
                        addn("jingmai/mar", 10000, me);
                        addn("jingmai/derive_effect", 15, me);
                        addn("jingmai/reflect", 5, me);
                        addn("add_max_encumbrance", 200000, me);

                        break;

                case "足少陽脈":
                        addn("jingmai/qi", 10000, me);
                        addn("jingmai/neili", 5000, me);
                        addn("jingmai/jingli", 4000, me);
                        addn("jingmai/mar", 5000, me);
                        addn("jingmai/pot", 4000, me);
                        addn("jingmai/jiali", 500, me);
                        addn("jingmai/damage", 200, me);
                        addn("jingmai/attack", 150, me);
                        addn("jingmai/defense", 150, me);

                        break;

                case "手陽明脈":
                        addn("jingmai/qi", 2000, me);
                        addn("jingmai/neili", 2000, me);
                        addn("jingmai/jingli", 2000, me);
                        addn("jingmai/mar", 2000, me);
                        addn("jingmai/pot", 5000, me);
                        addn("jingmai/jiali", 200, me);
                        addn("jingmai/damage", 40, me);
                        addn("jingmai/attack", 40, me);
                        addn("jingmai/magic_find", 1, me);
                        addn("jingmai/kar", 1, me);

                        break;

                case "足陽明脈":
                        addn("jingmai/qi", 10000, me);
                        addn("jingmai/neili", 10000, me);
                        addn("jingmai/jingli", 10000, me);
                        addn("jingmai/mar", 20000, me);
                        addn("jingmai/pot", 20000, me);
                        addn("jingmai/jiali", 500, me);
                        addn("jingmai/damage", 200, me);
                        addn("jingmai/attack", 200, me);
                        addn("jingmai/str", 60, me);
                        addn("jingmai/dex", 60, me);
                        addn("jingmai/int", 60, me);
                        addn("jingmai/con", 60, me);

                        break;

                case "手厥陰脈":
                        addn("jingmai/qi", 1000, me);
                        addn("jingmai/neili", 1000, me);
                        addn("jingmai/jingli", 1000, me);
                        addn("jingmai/pot", 1000, me);
                        addn("jingmai/armor", 50, me);
                        addn("jingmai/attack", 100, me);
                        addn("jingmai/str", 20, me);
                        break;

                case "足厥陰脈":
                        addn("jingmai/qi", 10000, me);
                        addn("jingmai/neili", 2000, me);
                        addn("jingmai/jingli", 2000, me);
                        addn("jingmai/mar", 2000, me);
                        addn("jingmai/pot", 2000, me);
                        addn("jingmai/damage", 60, me);
                        addn("jingmai/attack", 60, me);
                        addn("jingmai/str", 20, me);
                        addn("add_max_encumbrance", 100000, me);
                        break;

                default:
                        write("經脈錯誤：" + jing + "\n");
                        break;
        }

        write(HIR "恭喜你，打通了" + HIY + jing + HIR "。\n" NOR);

        // 系統通告
        CHANNEL_D->do_channel(this_object(), "rumor", "恭喜" + HIY + me->name() + HIM "打通了" + HIR +
                                                      jing + HIM "。\n");
        return;
}

// 檢查大小週天是否被打通
int check_zhoutian(object me, string jing)
{
        int i, flag = 0;

        if( !query("x_zhoutian", me) )
        {
                for( i=0; i<sizeof(x_zhoutian); i++ )
                        if( !query("jingmai/"+x_zhoutian[i]+"/chongxue_ok", me) )
                        {
                                flag = 1;
                                break;
                        }

                if( !flag )
                {
                        set("x_zhoutian", 1, me);
                        write(HIR "恭喜你，打通了" + HIY + "小週天經脈" + HIR "。\n" NOR);
                        addn("potential", 1000000, me);
                        addn("experience", 300000, me);
                        addn("jingmai/research_effect", 30, me);
                        addn("jingmai/derive_effect", 30, me);
                        addn("jingmai/practice_effect", 30, me);
                        write(HIY "打通小週天獎勵：一百萬點潛能及三十萬點實戰體會。\n" NOR);

                        // 系統通告
                        CHANNEL_D->do_channel(this_object(), "rumor", "恭喜" + HIY + me->name() + HIM "打通了" + HIR +
                                              "小週天經脈" + HIM "，功力突飛猛進。\n");
                }
        }

        flag = 0;
        if( !query("d_zhoutian", me) )
        {
                for( i=0; i<sizeof(d_zhoutian); i++ )
                        if( !query("jingmai/"+d_zhoutian[i]+"/chongxue_ok", me) )
                        {
                                flag = 1;
                                break;
                        }

                if( !flag )
                {
                        set("d_zhoutian", 1, me);
                        write(HIR "恭喜你，打通了" + HIY + "大周天經脈" + HIR "。\n" NOR);

                        addn("potential", 2000000, me);
                        addn("experience", 600000, me);
                        addn("jingmai/research_effect", 50, me);
                        addn("jingmai/derive_effect", 50, me);
                        addn("jingmai/practice_effect", 50, me);
                        write(HIY "打通大周天獎勵：二百萬點潛能及六十萬點實戰體會。\n" NOR);

                        // 系統通告
                        CHANNEL_D->do_channel(this_object(), "rumor", "恭喜" + HIY + me->name() + HIM "打通了" + HIR +
                                              "大周天經脈" + HIM "，功力進入全新的境界。\n");
                }
        }

        if( query("breakup", me))return 1;

        if( query("x_zhoutian", me) && query("d_zhoutian", me) )
        {
                set("breakup", 1, me);
                delete("jingmai", me);
                set("jingmai/finish", 1, me);
                write(HIR "恭喜你，打通了" + HIY + "全身大小週天經脈" + HIR "。\n" NOR);

                addn("potential", 10000000, me);
                addn("experience", 3000000, me);
                /*
                addn("jingmai/research_effect", 100, me);
                addn("jingmai/derive_effect", 100, me);
                addn("jingmai/practice_effect", 100, me);
                addn("jingmai/reduce_damage", 10, me);
                */
                write(HIY "打通大小週天獎勵：一千萬點潛能及三百萬點實戰體會。\n" NOR);

                // 系統通告
                CHANNEL_D->do_channel(this_object(), "rumor", "恭喜" + HIY + me->name() + HIM "打通了" + HIR +
                                      "全身大小週天經脈" + HIM "，功力已如神人。\n");
                return 1;
        }

        return 0;
}

// 檢查指定經脈是否被打通
int check_jingmai(object me, string jing)
{
        int n;

        if( !query("jingmai/"+jing, me) )
                return 0;

        n=sizeof(keys(query("jingmai/"+jing, me)));

        switch( jing )
        {
                case "陰蹺脈":
                        if( n < 18 ) return 0;
                        break;

                case "陽蹺脈":
                        if( n < 23 ) return 0;
                        break;

                case "陰維脈":
                        if( n < 16 ) return 0;
                        break;

                case "陽維脈":
                        if( n < 24 ) return 0;
                        break;

                case "帶脈":
                        if( n < 19 ) return 0;
                        break;

                case "衝脈":
                        if( n < 24 ) return 0;
                        break;

                case "督外脈":
                        if( n < 24 ) return 0;
                        break;

                case "任外脈":
                        if( n < 24 ) return 0;
                        break;

                case "經外奇脈":
                        if( n < 23 ) return 0;
                        break;

                case "手太陰脈":
                        if( n < 10 ) return 0;
                        break;

                case "手太陽脈":
                        if( n < 20 ) return 0;
                        break;

                case "足太陰脈":
                        if( n < 21 ) return 0;
                        break;

                case "足太陽脈":
                        if( n < 58 ) return 0;
                        break;

                case "手少陰脈":
                        if( n < 9 )  return 0;
                        break;

                case "手少陽脈":
                        if( n < 21 ) return 0;
                        break;

                case "足少陰脈":
                        if( n < 25 ) return 0;
                        break;

                case "足少陽脈":
                        if( n < 38 ) return 0;
                        break;

                case "手陽明脈":
                        if( n < 19 ) return 0;
                        break;

                case "足陽明脈":
                        if( n < 40 ) return 0;
                        break;

                case "手厥陰脈":
                        if( n < 9 )  return 0;
                        break;

                case "足厥陰脈":
                        if( n < 14 ) return 0;
                        break;

                default:
                        write("經脈名字錯誤：" + jing + "\n");
                        return 0;
        }

        set("jingmai/"+jing+"/chongxue_ok", 1, me);
        add_jingmai_effect(me, jing);
        check_zhoutian(me, jing);
        return 1;
}

int do_chongxue(object me, object tongren_ob)
{
        string jing, xue;
        string effect;
        string tongren_id;

        jing=query("jingmai_name", tongren_ob);
        xue=query("xuewei_name", tongren_ob);
        tongren_id=query("id", tongren_ob);

        if( query("jingmai/"+jing+"/"+tongren_id, me) )
                return notify_fail(xue + "已經被打通了。\n");

        if( query("neili", me)<query("cost_neili", tongren_ob) )
                return notify_fail("你當前內力值不足，不足以衝穴。\n");

        message_vision( HIC "突然$N" HIC "大喝一聲，一股無形氣浪"
                        HIC "陡然散佈開來，四周空氣登時變得燥熱。\n" NOR, me);
        tell_object(me, HIG "你頓時覺得渾身一陣輕鬆，一股清涼之意油然"
                        HIG "而起，心靈一片空明，內力沒有絲毫阻滯，" + xue +"已然暢通，舒泰之極。\n" NOR);

        addn("neili", -1*query("cost_neili", tongren_ob), me);

        // 記錄衝穴數據
        set("jingmai/"+jing+"/"+tongren_id, 1, me);

        // 提示
        write(HIG "恭喜你，衝穴成功！\n" NOR);

/*
        CHANNEL_D->do_channel(this_object(), "rumor", "聽説" + HIY + me->name() + HIM "衝開了" + HIY +
                                                       jing + "·" + xue + HIM "。\n");
*/

        // 獲取衝穴效果參數
        effect=query("chongxue_xiaoguo", tongren_ob);

        // 銷燬銅人
        destruct(tongren_ob);

        // 調用衝穴成功函數增加效果
        add_chongxue_effect(me, effect);
        check_jingmai(me, jing);

        me->save();
        return 1;
}

// 返回指定經脈的所有穴位,格式 ([ 穴位名1:穴位ID1..])
mapping query_xuewei(string jing)
{
        mapping result;
        int i;
        string *key, *tmp;

        key = keys(tongren_list);
        result = ([]);

        for( i = 0; i < sizeof(key); i ++ )
        {
                tmp = tongren_list[key[i]];
                if( tmp[0] == jing )
                        result += ([tmp[1]:key[i]]);
        }

        return result;
}

// 查看經脈衝穴情況
void show_jingmai(object me, string jing)
{
        string xuewei_id, xuewei_name;
        string msg;
        string status;
        string *xuewei_names;
        mapping xueweis;
        int i;

        msg  = sprintf("%-20s%-20s%-11s\n", HIC "穴位名稱" NOR, HIC "衝穴狀態" NOR, HIY "銅人編號" NOR);
        msg += "=----------------------------------------------=\n";

        xueweis = query_xuewei(jing);
        if( sizeof(xueweis) < 1 )
        {
                write("沒有這個經脈，請核實後再查詢。\n");
                return;
        }

        xuewei_names = keys(xueweis);
        for( i = 0; i < sizeof(xuewei_names); i ++ )
        {
                xuewei_name = xuewei_names[i];
                xuewei_id = xueweis[xuewei_name];
                if( query("jingmai/"+jing+"/"+xuewei_id, me) )
                        status = HIG "已打通" NOR;
                else
                        status = WHT "未打通" NOR;

                xuewei_id = replace_string(xuewei_id, "tongren ", "");
                msg += sprintf("%-20s%-20s%-11s\n", xuewei_name, status, xuewei_id);
        }
        msg += "=----------------------------------------------=\n";

        write(msg);
        return;
}

// 返回銅人編號列表
varargs string show_bianhao(string arg)
{
        string str;
        int i;
        string *key;
        string *list, *temp;

        if( !arg ) return "";

        switch( arg )
        {
                case "all" :
                        list = keys(tongren_list);
                        break;
                case "bh" :
                        list = keys(tongren_list1);
                        break;
                case "bh2" :
                        list = keys(tongren_list2);
                        break;
                default :
                        key = keys(tongren_list);
                        list = filter_array(key, (: $(tongren_list)[$1][0] == $(arg) :));
                        break;
        }

        list = sort_array(list, 1);

        str  = HIR "<衝穴銅人編號>\n" NOR;
        str += sprintf(HIY "%-20s%-20s%-20s\n" NOR, "銅人編號", "所屬經脈", "穴位名稱");
        str += HIC "----------------------------------------------------\n" NOR;
        for( i = 0; i < sizeof(list); i ++ )
        {
                temp = tongren_list[list[i]];
                str += sprintf(HIW "%-20s%-20s%-20s\n" NOR, replace_string(list[i], "tongren ", ""), temp[0], temp[1]);
        }

        str += HIC "----------------------------------------------------\n" NOR;

        return str;
}

// 生成銅人文件 目錄 /clone/tongren/
/*
void create_tongren_file()
{
        string file, filename, tongren_name, tongren_id;
        string *temp;
        string *list;
        int i;

        list = keys(tongren_list);

        for( i = 0; i < sizeof(list); i ++ )
        {
                reset_eval_cost();
                temp = tongren_list[list[i]];
                tongren_id = list[i];
                tongren_name = "衝穴銅人·" + temp[0] + "·" + temp[1];
                filename = replace_string(list[i], "tongren ", "tongren_");

                file = read_file("/clone/tongren/tongren.h");
                file = replace_string(file, "銅人NAME", tongren_name);
                file = replace_string(file, "銅人ID", tongren_id);
                file = replace_string(file, "JINGMAI_NAME", temp[0]);
                file = replace_string(file, "XUEWEI_NAME", temp[1]);
                file = replace_string(file, "CHONGXUE_XIAOGUO", temp[2]);
                file = replace_string(file, "NEILI_COST", temp[3]);

                write_file("/clone/tongren/" + filename + ".c", file, 1);
        }

        write(sprintf("%d", i) + " Files created at /clone/tongren/ .\n");
        return;
}
*/

// 鑑定無名銅人
mixed identify_tongren(object me, object ob)
{
        object tongren;
        string *list;
        string tongren_id;

        if( ob->query_tongren() == 1 )
                list = keys(tongren_list1);
        else
        if( ob->query_tongren() == 2 )
                list = keys(tongren_list2);
        else
        {
                write(ob->name()+"退還，請聯繫本站巫師查看問題。\n");
                return;
        }

        tongren_id = list[random(sizeof(list))];
        tongren_id = replace_string(tongren_id, "tongren ", "tongren_");
        tongren = new("/clone/tongren/" + tongren_id);

        if( !tongren )
        {
                log_file("tongren", "tongren identify error, id:" + tongren_id + ".\n");
                write("意外錯誤終止，無名銅人退還，請聯繫本站巫師查看系統記錄。\n");
                return;
        }

        ob->add_amount(-1);

        write("恭喜你，獲得鑑定出" + tongren->name() + NOR "。\n");
        return tongren;
}
